Initializing gui preferences from file  /home/student/.synopsys_icc_prefs.tcl
icc_shell> start_gui
Information: Visibility is turned ON for cells and cell contents because the task is set to Block Implementation (GUI-026)
icc_shell> lappend search_path ~/Desktop/Workspace/SMIC18/db ../scripts ../design
. /usr/synopsys/ICC-2010.03-SP5-2/libraries/syn /usr/synopsys/ICC-2010.03-SP5-2/dw/syn_ver /usr/synopsys/ICC-2010.03-SP5-2/dw/sim_ver ~/Desktop/Workspace/SMIC18/db ../scripts ../design
icc_shell> set_app_var target_library "slow.db"
slow.db
icc_shell> set_app_var link_library "* slow.db SP018W_V1p5_max.db"
* slow.db SP018W_V1p5_max.db
icc_shell> set_min_library slow.db -min_version fast.db
Loading db file '/home/student/Desktop/Workspace/SMIC18/db/slow.db'
Loading db file '/home/student/Desktop/Workspace/SMIC18/db/fast.db'
1
icc_shell> set_min_library SP018W_V1p5_max.db -min_version SP018W_V1p5_min.db
Loading db file '/home/student/Desktop/Workspace/SMIC18/db/SP018W_V1p5_max.db'
Loading db file '/home/student/Desktop/Workspace/SMIC18/db/SP018W_V1p5_min.db'
1
icc_shell> set mw_path "~/Desktop/Workspace/SMIC18/mw_lib"
~/Desktop/Workspace/SMIC18/mw_lib
icc_shell> set tech_file "~/Desktop/Workspace/SMIC18/tech/smic18_5lm.tf"
~/Desktop/Workspace/SMIC18/tech/smic18_5lm.tf
icc_shell> set tlup_map "~/Desktop/Workspace/SMIC18/tlup/smic018_5lm_map"
~/Desktop/Workspace/SMIC18/tlup/smic018_5lm_map
icc_shell> set tlup_max "~/Desktop/Workspace/SMIC18/tlup/smiclog018_5lm_cell_max.tluplus"
~/Desktop/Workspace/SMIC18/tlup/smiclog018_5lm_cell_max.tluplus
icc_shell> set tlup_min "~/Desktop/Workspace/SMIC18/tlup/smiclog018_5lm_cell_min.tluplus"
~/Desktop/Workspace/SMIC18/tlup/smiclog018_5lm_cell_min.tluplus
icc_shell> set verilog_file "../design/idct_chip.v"
../design/idct_chip.v
icc_shell> set sdc_file "../design/idct_chip.sdc"
../design/idct_chip.sdc
icc_shell> source run_data_setup.tcl^M
Error: could not open script file "run_data_setup.tcl^M" (CMD-015)
icc_shell> source run_data_setup.tcl^M
Error: could not open script file "run_data_setup.tcl^M" (CMD-015)
icc_shell> source run_data_setup.tcl^M
Error: could not open script file "run_data_setup.tcl^M" (CMD-015)
icc_shell> set mw_path "~/Desktop/Workspace/SMIC18/mw_lib"
~/Desktop/Workspace/SMIC18/mw_lib
icc_shell> set tech_file "~/Desktop/Workspace/SMIC18/tech/smic18_5lm.tf"
~/Desktop/Workspace/SMIC18/tech/smic18_5lm.tf
icc_shell> set tlup_map "~/Desktop/Workspace/SMIC18/tlup/smic018_5lm_map"
~/Desktop/Workspace/SMIC18/tlup/smic018_5lm_map
icc_shell> set tlup_max "~/Desktop/Workspace/SMIC18/tlup/smiclog018_5lm_cell_max.tluplus"
~/Desktop/Workspace/SMIC18/tlup/smiclog018_5lm_cell_max.tluplus
icc_shell> set tlup_min "~/Desktop/Workspace/SMIC18/tlup/smiclog018_5lm_cell_min.tluplus"
~/Desktop/Workspace/SMIC18/tlup/smiclog018_5lm_cell_min.tluplus
icc_shell> set verilog_file "../design/idct_chip.v"
../design/idct_chip.v
icc_shell> set sdc_file "../design/idct_chip.sdc"
../design/idct_chip.sdc
icc_shell> source run_data_setup.tcl^M
Error: could not open script file "run_data_setup.tcl^M" (CMD-015)
icc_shell> source run_design_planning.tcl^M
Error: could not open script file "run_design_planning.tcl^M" (CMD-015)
icc_shell> source run_placement.tcl^M
Error: could not open script file "run_placement.tcl^M" (CMD-015)
icc_shell> source run_cts.tcl^M
Error: could not open script file "run_cts.tcl^M" (CMD-015)
icc_shell> source run_route.tcl^M
Error: could not open script file "run_route.tcl^M" (CMD-015)
icc_shell> source run_finishing.tcl^M
Error: could not open script file "run_finishing.tcl^M" (CMD-015)
icc_shell> lappend search_path ~/Desktop/Workspace/SMIC18/db ../scripts ../design
. /usr/synopsys/ICC-2010.03-SP5-2/libraries/syn /usr/synopsys/ICC-2010.03-SP5-2/dw/syn_ver /usr/synopsys/ICC-2010.03-SP5-2/dw/sim_ver ~/Desktop/Workspace/SMIC18/db ../scripts ../design ~/Desktop/Workspace/SMIC18/db ../scripts ../design
icc_shell> set_app_var target_library "slow.db"
slow.db
icc_shell> set_app_var link_library "* slow.db SP018W_V1p5_max.db"
* slow.db SP018W_V1p5_max.db
icc_shell> set_min_library slow.db -min_version fast.db
1
icc_shell> set_min_library SP018W_V1p5_max.db -min_version SP018W_V1p5_min.db
1
icc_shell> set mw_path "~/Desktop/Workspace/SMIC18/mw_lib"
~/Desktop/Workspace/SMIC18/mw_lib
icc_shell> set tech_file "~/Desktop/Workspace/SMIC18/tech/smic18_5lm.tf"
~/Desktop/Workspace/SMIC18/tech/smic18_5lm.tf
icc_shell> set tlup_map "~/Desktop/Workspace/SMIC18/tlup/smic018_5lm_map"
~/Desktop/Workspace/SMIC18/tlup/smic018_5lm_map
icc_shell> set tlup_max "~/Desktop/Workspace/SMIC18/tlup/smiclog018_5lm_cell_max.tluplus"
~/Desktop/Workspace/SMIC18/tlup/smiclog018_5lm_cell_max.tluplus
icc_shell> set tlup_min "~/Desktop/Workspace/SMIC18/tlup/smiclog018_5lm_cell_min.tluplus"
~/Desktop/Workspace/SMIC18/tlup/smiclog018_5lm_cell_min.tluplus
icc_shell> set verilog_file "../design/idct_chip.v"
../design/idct_chip.v
icc_shell> set sdc_file "../design/idct_chip.sdc"
../design/idct_chip.sdc
icc_shell> source run_data_setup.tcl
Start to load technology file /home/student/Desktop/Workspace/SMIC18/tech/smic18_5lm.tf.
Warning: ContactCode 'CONT1' is missing the attribute 'unitMinResistance'. (line 425) (TFCHK-014)
Warning: ContactCode 'CONT1' is missing the attribute 'unitNomResistance'. (line 425) (TFCHK-014)
Warning: ContactCode 'CONT1' is missing the attribute 'unitMaxResistance'. (line 425) (TFCHK-014)
Warning: Cut layer 'VIA12' has a non-cross primary default ContactCode 'via1'. (line 443) (TFCHK-092)
Warning: Cut layer 'VIA23' has a non-cross primary default ContactCode 'via2'. (line 461) (TFCHK-092)
Warning: Cut layer 'VIA34' has a non-cross primary default ContactCode 'via3'. (line 479) (TFCHK-092)
Warning: Layer 'METAL1' has a pitch 0.56 that does not match the recommended wire-to-via pitch 0.535 or 0.485. (TFCHK-049)
Warning: Layer 'METAL2' has a pitch 0.66 that does not match the recommended wire-to-via pitch 0.61 or 0.56. (TFCHK-049)
Warning: Layer 'METAL3' has a pitch 0.56 that does not match the doubled pitch 1.12 or tripled pitch 1.68. (TFCHK-050)
Warning: Layer 'METAL4' has a pitch 0.66 that does not match the doubled pitch 1.32 or tripled pitch 1.98. (TFCHK-050)
Warning: Layer 'METAL5' has a pitch 0.95 that does not match the doubled pitch 1.12 or tripled pitch 1.68. (TFCHK-050)
Technology file /home/student/Desktop/Workspace/SMIC18/tech/smic18_5lm.tf has been loaded successfully.
Loading db file '/usr/synopsys/ICC-2010.03-SP5-2/libraries/syn/gtech.db'
Loading db file '/usr/synopsys/ICC-2010.03-SP5-2/libraries/syn/standard.sldb'
Type of creating bus for undefined cells : 0
Warning: /home/student/Desktop/Workspace/SMIC18/mw_lib/smic18_5ml: bus naming style _<%d> is not consistent with main lib. (MWNL-111)

*****  Verilog HDL translation! *****

*****    Start Pass 1 *****

*****  Pass 1 Complete *****
Elapsed =    0:00:00, CPU =    0:00:00

*****  Verilog HDL translation! *****

*****    Start Pass 2 *****

*****  Pass 2 Complete *****

*****   Verilog HDL translation completed! *****
Elapsed =    0:00:01, CPU =    0:00:00
Hierarchy Preservation is turned ON
The quick-attach skip-search mode has been turned on.
  Start axu naming escaping style change ...
  End axu naming escaping style change, status is 1
Checking single pin net for cell 'idct_chip.CEL' now...
Total number of cell instances: 27086
Total number of nets: 29719
Total number of ports: 39 (include 0 PG ports)
Total number of hierarchical cell instances: 125

The quick-attach skip-search mode has been turned off.
INFO:  total find 0 pg nets connected with tie net.
Elapsed =    0:00:01, CPU =    0:00:00
Preparing data for GUI query...............................................
Information: Read verilog completed successfully.

#BEGIN_XCHECK_LIBRARY

Logic Library:    slow 
                  SP018W_V1p5_max 
Physical Library: /home/student/Desktop/Workspace/SMIC18/mw_lib/smic18_5ml 
                  /home/student/Desktop/Workspace/SMIC18/mw_lib/SP018W_V1p5_5MT 
check_library options:  
Version:                                D-2010.03-ICC-SP5-2
Check date and time:    Fri Apr 17 15:04:48 2020

          List of logic library and file names
------------------------------------------------------------------------------
Logic library name           Logic library file name
------------------------------------------------------------------------------
slow                         /home/student/Desktop/Workspace/SMIC18/db/slow.db
SP018W_V1p5_max              /home/student/Desktop/Workspace/SMIC18/db/SP018W_V1p5_max.db
------------------------------------------------------------------------------

#BEGIN_XCHECK_LOGICCELLS

Number of cells missing in logic library:       18 (out of 621)

Information: List of cells missing in logic library (LIBCHK-210)
-------------------------------------------------------------------------
Cell name                  Cell type             Physical library
-------------------------------------------------------------------------
PFILL22W                   Pad                   SP018W_V1p5_5MT
PCORNERW                   Pad                   SP018W_V1p5_5MT
PFILL5W                    Pad                   SP018W_V1p5_5MT
PFILL50W                   Pad                   SP018W_V1p5_5MT
PFILL2W                    Pad                   SP018W_V1p5_5MT
PFILL20W                   Pad                   SP018W_V1p5_5MT
PFILL1W                    Pad                   SP018W_V1p5_5MT
PFILL10W                   Pad                   SP018W_V1p5_5MT
PFILL01W                   Pad                   SP018W_V1p5_5MT
PFILL001W                  Pad                   SP018W_V1p5_5MT
PFILL001AW                 Pad                   SP018W_V1p5_5MT
PFILL01AW                  Pad                   SP018W_V1p5_5MT
PFILL10AW                  Pad                   SP018W_V1p5_5MT
PFILL1AW                   Pad                   SP018W_V1p5_5MT
PFILL20AW                  Pad                   SP018W_V1p5_5MT
PFILL2AW                   Pad                   SP018W_V1p5_5MT
PFILL50AW                  Pad                   SP018W_V1p5_5MT
PFILL5AW                   Pad                   SP018W_V1p5_5MT
-------------------------------------------------------------------------

Information: List of physical only cells (LIBCHK-119)
-------------------------------------------------------------------------
Cell name                  Cell type             Physical library
-------------------------------------------------------------------------
FILL8                      Filler                smic18_5ml
FILL64                     Filler                smic18_5ml
FILL4                      Filler                smic18_5ml
FILL32                     Filler                smic18_5ml
FILL2                      Filler                smic18_5ml
FILL16                     Filler                smic18_5ml
FILL1                      Filler                smic18_5ml
ANTENNA                    Filler                smic18_5ml
-------------------------------------------------------------------------

#END_XCHECK_LOGICCELLS

#BEGIN_XCHECK_PHYSICALCELLS

Number of cells missing in physical library:    0 (out of 647)

#END_XCHECK_PHYSICALCELLS

#BEGIN_XCHECK_PINS

Number of cells with missing or mismatched pins in libraries:   17

Error: List of pins mismatched in logic and physical libraries (LIBCHK-213)
Logic library:    SP018W_V1p5_max
Physical library: /home/student/Desktop/Workspace/SMIC18/mw_lib/SP018W_V1p5_5MT
-----------------------------------------------------------------------------------
                                          Pin direction           Pin type
Cell name                    Pin name    Logic   Physical     Logic         Physical
-----------------------------------------------------------------------------------
PVDD1W                       VDD         output  Output      signal         power
PVSS1W                       VSS         output  Output      signal         ground
PVSS3W                       VSS         output  Output      signal         ground
PVSS1ANPW                    SVSS1ANP    output  Output      signal         ground
PVDD1ANPW                    SVDD1ANP    output  Output      signal         power
PVSS3CAPW                    SAVSS       output  Output      signal         ground
PVDD3CAPW                    SAVDD       output  Output      signal         power
PVSS1CAP1W                   SVSS1CAP1   output  Output      signal         ground
PVSS1CAPW                    SVSS1CAP    output  Output      signal         ground
PVDD1CAPW                    SVDD1CAP    output  Output      signal         power
PVDD1CAP1W                   SVDD1CAP1   output  Output      signal         power
PVSS3APW                     SAVSS       output  Output      signal         ground
PVSS1APW                     SVSS1AP     output  Output      signal         ground
PVSS1AP1W                    SVSS1AP1    output  Output      signal         ground
PVDD3APW                     SAVDD       output  Output      signal         power
PVDD1APW                     SVDD1AP     output  Output      signal         power
PVDD1AP1W                    SVDD1AP1    output  Output      signal         power
-----------------------------------------------------------------------------------

#END_XCHECK_PINS

Logic vs. physical library check summary:
Number of cells missing in logic library:       18 
Number of cells with missing or mismatched pins in libraries:   17
Information: Logic library is INCONSISTENT with physical library (LIBCHK-220)

#END_XCHECK_LIBRARY

Information: linking reference library : /home/student/Desktop/Workspace/SMIC18/mw_lib/smic18_5ml. (PSYN-878)
Information: linking reference library : /home/student/Desktop/Workspace/SMIC18/mw_lib/SP018W_V1p5_5MT. (PSYN-878)

  Linking design 'idct_chip'
  Using the following designs and libraries:
  --------------------------------------------------------------------------
  * (125 designs)             idct_chip.CEL, etc
  slow (library)              /home/student/Desktop/Workspace/SMIC18/db/slow.db
  SP018W_V1p5_max (library)   /home/student/Desktop/Workspace/SMIC18/db/SP018W_V1p5_max.db

Load global CTS reference options from NID to stack
# GUI Debug: Building dc from empty. -- Time: 8sec 104ms

Sanity check for TLU+ vs MW-Tech files:
 max_tlu+: /home/student/Desktop/Workspace/SMIC18/tlup/smiclog018_5lm_cell_max.tluplus
 min_tlu+: /home/student/Desktop/Workspace/SMIC18/tlup/smiclog018_5lm_cell_min.tluplus
 mapping_file: /home/student/Desktop/Workspace/SMIC18/tlup/smic018_5lm_map
 max_emul_tlu+: **NONE**
 min_emul_tlu+: **NONE**
 MW design lib: idct_chip.mw

--------- Sanity Check on TLUPlus Files -------------
1. Checking the conducting layer names in ITF and mapping file ... 
[ Passed! ]
2. Checking the via layer names in ITF and mapping file ... 
[ Passed! ]
3. Checking the consistency of Min Width and Min Spacing between MW-tech and ITF ... 
[ Passed! ]
----------------- Check Ends ------------------
Logical Libraries:
-------------------------------------------------------------------------
Library         File                    Path
-------         ----                    ----
M slow          slow.db                 /home/student/Desktop/Workspace/SMIC18/db
m fast          fast.db                 /home/student/Desktop/Workspace/SMIC18/db
M SP018W_V1p5_max SP018W_V1p5_max.db    /home/student/Desktop/Workspace/SMIC18/db
m SP018W_V1p5_min SP018W_V1p5_min.db    /home/student/Desktop/Workspace/SMIC18/db
  gtech         gtech.db                /usr/synopsys/ICC-2010.03-SP5-2/libraries/syn
  standard.sldb standard.sldb           /usr/synopsys/ICC-2010.03-SP5-2/libraries/syn
begin derive_pg_connection...
--- connected 27047 power ports and 27047 ground ports
Information: PG PORT PUNCHING: Number of ports connected:                54094 (MW-337)
Information: PG PORT PUNCHING: Total number of changes:                  54094 (MW-339)
begin derive_pg_connection...
-- reconnected total 256 tie highs and 166 tie lows
Information: PG PORT PUNCHING: Number of ports connected:                414 (MW-337)
Information: PG PORT PUNCHING: Total number of changes:                  414 (MW-339)
Information: linking reference library : /home/student/Desktop/Workspace/SMIC18/mw_lib/smic18_5ml. (PSYN-878)
Information: linking reference library : /home/student/Desktop/Workspace/SMIC18/mw_lib/SP018W_V1p5_5MT. (PSYN-878)
Warning: Could not find valid driver for hierarchical Ground net 'VSS'. (MWDC-285)
Warning: Could not find valid driver for hierarchical Power net 'VDD'. (MWDC-285)

  Linking design 'idct_chip'
  Using the following designs and libraries:
  --------------------------------------------------------------------------
  * (125 designs)             idct_chip.CEL, etc
  slow (library)              /home/student/Desktop/Workspace/SMIC18/db/slow.db
  SP018W_V1p5_max (library)   /home/student/Desktop/Workspace/SMIC18/db/SP018W_V1p5_max.db

Load global CTS reference options from NID to stack
# GUI Debug: Building dc for netlist invalid. -- Time: 2sec 148ms
--------------------------------------------------------------------------------
       Power/Ground Pin Connection Checks
--------------------------------------------------------------------------------

Power/Ground Connection Summary:

P/G net name                P/G pin count
--------------------------------------------------------------------
Other power nets:                 27047
Unconnected power pins:           0

Other ground nets:                27047
Unconnected ground pins:          0
--------------------------------------------------------------------
Warning: Power connection/checking is skipped for 54094 power pins because the required power pin information cannot be found in logical libraries. (MV-510)

--------------------------------------------------------------------------------
       Supply Operating Voltage Checks
--------------------------------------------------------------------------------
No Errors/Warnings Found.

Please review report above for warnings and errors.
 Info: hierarchy_separator was changed to /

Reading SDC version 1.8...
Warning: Constraint 'set_wire_load_mode' is not supported by icc_shell. (SDC-3)
Current design is 'idct_chip'.
Current design is 'idct_chip'.
Warning: Design rule attributes from the driving cell will be
        set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
        set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
        set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
        set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
        set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
        set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
        set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
        set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
        set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
        set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
        set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
        set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
        set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
        set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
        set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
        set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
        set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
        set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
        set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
        set on the port. (UID-401)


Summary of unsupported constraints:
Information: Ignored 1 unsupported 'set_wire_load_mode' constraint. (SDC-4)
 Info: hierarchy_separator was changed to /
Warning: The trip points for the library named SP018W_V1p5_max differ from those in the library named slow. (TIM-164)
Warning: The trip points for the library named SP018W_V1p5_min differ from those in the library named slow. (TIM-164)
Information: Updating graph... (UID-83)
Warning: Design 'idct_chip' contains 2 high-fanout nets. A fanout number of 1000 will be used for delay calculations involving these nets. (TIM-134)
Information: Updating design information... (UID-85)
Warning: Design 'idct_chip' contains 2 high-fanout nets. A fanout number of 1000 will be used for delay calculations involving these nets. (TIM-134)

Information: Checking generated_clocks...

Information: Checking loops...
Warning: timing loops detected. (TIM-209)
    #              loop breakpoint

                 cell_arc                            lib cell
--------------------------------------------------------------------------------
inst_idct/inst_p2s2/U4/A -> inst_idct/inst_p2s2/U4/Y slow/AND2X4             #

                 cell_arc                            lib cell
--------------------------------------------------------------------------------
inst_idct/inst_p2s2/U5/A1N -> inst_idct/inst_p2s2/U5/Y slow/OAI2BB1X4        #

                 cell_arc                            lib cell
--------------------------------------------------------------------------------
inst_idct/inst_p2s1/U4/A -> inst_idct/inst_p2s1/U4/Y slow/AND2X4             #

                 cell_arc                            lib cell
--------------------------------------------------------------------------------
inst_idct/inst_p2s1/U5/A1N -> inst_idct/inst_p2s1/U5/Y slow/OAI2BB1X4        #

                 cell_arc                            lib cell
--------------------------------------------------------------------------------
inst_idct/idct_cal_col/U5/AN -> inst_idct/idct_cal_col/U5/Y slow/NOR2BX4     #

                 cell_arc                            lib cell
--------------------------------------------------------------------------------
inst_idct/idct_cal_col/U4/B1 -> inst_idct/idct_cal_col/U4/Y slow/AOI22X4     #
inst_idct/idct_cal_col/U3/A -> inst_idct/idct_cal_col/U3/Y slow/CLKINVX8      

                 cell_arc                            lib cell
--------------------------------------------------------------------------------
inst_idct/inst_s2p1/U4/A1N -> inst_idct/inst_s2p1/U4/Y slow/OAI2BB2X4        #

                 cell_arc                            lib cell
--------------------------------------------------------------------------------
inst_idct/inst_s2p1/U3/A1N -> inst_idct/inst_s2p1/U3/Y slow/OAI2BB2X4        #

                 cell_arc                            lib cell
--------------------------------------------------------------------------------
inst_idct/idct_cal_row/U5/AN -> inst_idct/idct_cal_row/U5/Y slow/NOR2BX4     #

                 cell_arc                            lib cell
--------------------------------------------------------------------------------
inst_idct/idct_cal_row/U4/B1 -> inst_idct/idct_cal_row/U4/Y slow/AOI22X4     #
inst_idct/idct_cal_row/U3/A -> inst_idct/idct_cal_row/U3/Y slow/CLKINVX8      

                 cell_arc                            lib cell
--------------------------------------------------------------------------------
inst_idct/inst_s2p2/U4/A1N -> inst_idct/inst_s2p2/U4/Y slow/OAI2BB2X4        #

                 cell_arc                            lib cell
--------------------------------------------------------------------------------
inst_idct/inst_s2p2/U3/A1N -> inst_idct/inst_s2p2/U3/Y slow/OAI2BB2X4        #

Information: Checking no_input_delay...

Information: Checking unconstrained_endpoints...

Warning: The following end-points are not constrained for maximum delay.

End point
---------------
inst_idct/inst_mem_ctrl_tran/coeff_num_r_reg_2_/D
inst_idct/inst_mem_ctrl_tran/coeff_num_r_reg_3_/D
inst_idct/inst_mem_ctrl_tran/coeff_num_w_reg_2_/D
inst_idct/inst_mem_ctrl_tran/coeff_num_w_reg_3_/D
inst_idct/inst_mem_ctrl_tran/coeff_shift_r_reg_0_/D
inst_idct/inst_mem_ctrl_tran/coeff_shift_w_reg_0_/D
inst_idct/inst_mem_ctrl_tran/mode_r_reg_0_/D
inst_idct/inst_mem_ctrl_tran/mode_r_reg_1_/D
inst_idct/inst_s2p1/dout_reg_0_/D
inst_idct/inst_s2p1/dout_reg_1_/D
inst_idct/inst_s2p1/dout_reg_2_/D
inst_idct/inst_s2p1/dout_reg_3_/D
inst_idct/inst_s2p1/dout_reg_4_/D
inst_idct/inst_s2p1/dout_reg_5_/D
inst_idct/inst_s2p1/dout_reg_6_/D
inst_idct/inst_s2p1/dout_reg_7_/D
inst_idct/inst_s2p1/dout_reg_8_/D
inst_idct/inst_s2p1/dout_reg_9_/D
inst_idct/inst_s2p1/dout_reg_10_/D
inst_idct/inst_s2p1/dout_reg_11_/D
inst_idct/inst_s2p1/dout_reg_12_/D
inst_idct/inst_s2p1/dout_reg_13_/D
inst_idct/inst_s2p1/dout_reg_14_/D
inst_idct/inst_s2p1/dout_reg_15_/D
inst_idct/inst_s2p1/dout_reg_16_/D
inst_idct/inst_s2p1/dout_reg_17_/D
inst_idct/inst_s2p1/dout_reg_18_/D
inst_idct/inst_s2p1/dout_reg_19_/D
inst_idct/inst_s2p1/dout_reg_20_/D
inst_idct/inst_s2p1/dout_reg_21_/D
inst_idct/inst_s2p1/dout_reg_22_/D
inst_idct/inst_s2p1/dout_reg_23_/D
inst_idct/inst_s2p1/dout_reg_24_/D
inst_idct/inst_s2p1/dout_reg_25_/D
inst_idct/inst_s2p1/dout_reg_26_/D
inst_idct/inst_s2p1/dout_reg_27_/D
inst_idct/inst_s2p1/dout_reg_28_/D
inst_idct/inst_s2p1/dout_reg_29_/D
inst_idct/inst_s2p1/dout_reg_30_/D
inst_idct/inst_s2p1/dout_reg_31_/D
inst_idct/inst_s2p1/dout_reg_32_/D
inst_idct/inst_s2p1/dout_reg_33_/D
inst_idct/inst_s2p1/dout_reg_34_/D
inst_idct/inst_s2p1/dout_reg_35_/D
inst_idct/inst_s2p1/dout_reg_36_/D
inst_idct/inst_s2p1/dout_reg_37_/D
inst_idct/inst_s2p1/dout_reg_38_/D
inst_idct/inst_s2p1/dout_reg_39_/D
inst_idct/inst_s2p1/dout_reg_40_/D
inst_idct/inst_s2p1/dout_reg_41_/D
inst_idct/inst_s2p1/dout_reg_42_/D
inst_idct/inst_s2p1/dout_reg_43_/D
inst_idct/inst_s2p1/dout_reg_44_/D
inst_idct/inst_s2p1/dout_reg_45_/D
inst_idct/inst_s2p1/dout_reg_46_/D
inst_idct/inst_s2p1/dout_reg_47_/D
inst_idct/inst_s2p1/dout_reg_48_/D
inst_idct/inst_s2p1/dout_reg_49_/D
inst_idct/inst_s2p1/dout_reg_50_/D
inst_idct/inst_s2p1/dout_reg_51_/D
inst_idct/inst_s2p1/dout_reg_52_/D
inst_idct/inst_s2p1/dout_reg_53_/D
inst_idct/inst_s2p1/dout_reg_54_/D
inst_idct/inst_s2p1/dout_reg_55_/D
inst_idct/inst_s2p1/dout_reg_56_/D
inst_idct/inst_s2p1/dout_reg_57_/D
inst_idct/inst_s2p1/dout_reg_58_/D
inst_idct/inst_s2p1/dout_reg_59_/D
inst_idct/inst_s2p1/dout_reg_60_/D
inst_idct/inst_s2p1/dout_reg_61_/D
inst_idct/inst_s2p1/dout_reg_62_/D
inst_idct/inst_s2p1/dout_reg_63_/D
inst_idct/inst_s2p1/dout_reg_64_/D
inst_idct/inst_s2p1/dout_reg_65_/D
inst_idct/inst_s2p1/dout_reg_66_/D
inst_idct/inst_s2p1/dout_reg_67_/D
inst_idct/inst_s2p1/dout_reg_68_/D
inst_idct/inst_s2p1/dout_reg_69_/D
inst_idct/inst_s2p1/dout_reg_70_/D
inst_idct/inst_s2p1/dout_reg_71_/D
inst_idct/inst_s2p1/dout_reg_72_/D
inst_idct/inst_s2p1/dout_reg_73_/D
inst_idct/inst_s2p1/dout_reg_74_/D
inst_idct/inst_s2p1/dout_reg_75_/D
inst_idct/inst_s2p1/dout_reg_76_/D
inst_idct/inst_s2p1/dout_reg_77_/D
inst_idct/inst_s2p1/dout_reg_78_/D
inst_idct/inst_s2p1/dout_reg_79_/D
inst_idct/inst_s2p1/dout_reg_80_/D
inst_idct/inst_s2p1/dout_reg_81_/D
inst_idct/inst_s2p1/dout_reg_82_/D
inst_idct/inst_s2p1/dout_reg_83_/D
inst_idct/inst_s2p1/dout_reg_84_/D
inst_idct/inst_s2p1/dout_reg_85_/D
inst_idct/inst_s2p1/dout_reg_86_/D
inst_idct/inst_s2p1/dout_reg_87_/D
inst_idct/inst_s2p1/dout_reg_88_/D
inst_idct/inst_s2p1/dout_reg_89_/D
inst_idct/inst_s2p1/dout_reg_90_/D
inst_idct/inst_s2p1/dout_reg_91_/D
inst_idct/inst_s2p1/dout_reg_92_/D
inst_idct/inst_s2p1/dout_reg_93_/D
inst_idct/inst_s2p1/dout_reg_94_/D
inst_idct/inst_s2p1/dout_reg_95_/D
inst_idct/inst_s2p1/dout_reg_96_/D
inst_idct/inst_s2p1/dout_reg_97_/D
inst_idct/inst_s2p1/dout_reg_98_/D
inst_idct/inst_s2p1/dout_reg_99_/D
inst_idct/inst_s2p1/dout_reg_100_/D
inst_idct/inst_s2p1/dout_reg_101_/D
inst_idct/inst_s2p1/dout_reg_102_/D
inst_idct/inst_s2p1/dout_reg_103_/D
inst_idct/inst_s2p1/dout_reg_104_/D
inst_idct/inst_s2p1/dout_reg_105_/D
inst_idct/inst_s2p1/dout_reg_106_/D
inst_idct/inst_s2p1/dout_reg_107_/D
inst_idct/inst_s2p1/dout_reg_108_/D
inst_idct/inst_s2p1/dout_reg_109_/D
inst_idct/inst_s2p1/dout_reg_110_/D
inst_idct/inst_s2p1/dout_reg_111_/D
inst_idct/inst_s2p1/dout_reg_112_/D
inst_idct/inst_s2p1/dout_reg_113_/D
inst_idct/inst_s2p1/dout_reg_114_/D
inst_idct/inst_s2p1/dout_reg_115_/D
inst_idct/inst_s2p1/dout_reg_116_/D
inst_idct/inst_s2p1/dout_reg_117_/D
inst_idct/inst_s2p1/dout_reg_118_/D
inst_idct/inst_s2p1/dout_reg_119_/D
inst_idct/inst_s2p1/dout_reg_120_/D
inst_idct/inst_s2p1/dout_reg_121_/D
inst_idct/inst_s2p1/dout_reg_122_/D
inst_idct/inst_s2p1/dout_reg_123_/D
inst_idct/inst_s2p1/dout_reg_124_/D
inst_idct/inst_s2p1/dout_reg_125_/D
inst_idct/inst_s2p1/dout_reg_126_/D
inst_idct/inst_s2p1/dout_reg_127_/D
inst_idct/inst_s2p1/dout_reg_128_/D
inst_idct/inst_s2p1/dout_reg_129_/D
inst_idct/inst_s2p1/dout_reg_130_/D
inst_idct/inst_s2p1/dout_reg_131_/D
inst_idct/inst_s2p1/dout_reg_132_/D
inst_idct/inst_s2p1/dout_reg_133_/D
inst_idct/inst_s2p1/dout_reg_134_/D
inst_idct/inst_s2p1/dout_reg_135_/D
inst_idct/inst_s2p1/dout_reg_136_/D
inst_idct/inst_s2p1/dout_reg_137_/D
inst_idct/inst_s2p1/dout_reg_138_/D
inst_idct/inst_s2p1/dout_reg_139_/D
inst_idct/inst_s2p1/dout_reg_140_/D
inst_idct/inst_s2p1/dout_reg_141_/D
inst_idct/inst_s2p1/dout_reg_142_/D
inst_idct/inst_s2p1/dout_reg_143_/D
inst_idct/inst_s2p1/dout_reg_144_/D
inst_idct/inst_s2p1/dout_reg_145_/D
inst_idct/inst_s2p1/dout_reg_146_/D
inst_idct/inst_s2p1/dout_reg_147_/D
inst_idct/inst_s2p1/dout_reg_148_/D
inst_idct/inst_s2p1/dout_reg_149_/D
inst_idct/inst_s2p1/dout_reg_150_/D
inst_idct/inst_s2p1/dout_reg_151_/D
inst_idct/inst_s2p1/dout_reg_152_/D
inst_idct/inst_s2p1/dout_reg_153_/D
inst_idct/inst_s2p1/dout_reg_154_/D
inst_idct/inst_s2p1/dout_reg_155_/D
inst_idct/inst_s2p1/dout_reg_156_/D
inst_idct/inst_s2p1/dout_reg_157_/D
inst_idct/inst_s2p1/dout_reg_158_/D
inst_idct/inst_s2p1/dout_reg_159_/D
inst_idct/inst_s2p1/dout_reg_160_/D
inst_idct/inst_s2p1/dout_reg_161_/D
inst_idct/inst_s2p1/dout_reg_162_/D
inst_idct/inst_s2p1/dout_reg_163_/D
inst_idct/inst_s2p1/dout_reg_164_/D
inst_idct/inst_s2p1/dout_reg_165_/D
inst_idct/inst_s2p1/dout_reg_166_/D
inst_idct/inst_s2p1/dout_reg_167_/D
inst_idct/inst_s2p1/dout_reg_168_/D
inst_idct/inst_s2p1/dout_reg_169_/D
inst_idct/inst_s2p1/dout_reg_170_/D
inst_idct/inst_s2p1/dout_reg_171_/D
inst_idct/inst_s2p1/dout_reg_172_/D
inst_idct/inst_s2p1/dout_reg_173_/D
inst_idct/inst_s2p1/dout_reg_174_/D
inst_idct/inst_s2p1/dout_reg_175_/D
inst_idct/inst_s2p1/dout_reg_176_/D
inst_idct/inst_s2p1/dout_reg_177_/D
inst_idct/inst_s2p1/dout_reg_178_/D
inst_idct/inst_s2p1/dout_reg_179_/D
inst_idct/inst_s2p1/dout_reg_180_/D
inst_idct/inst_s2p1/dout_reg_181_/D
inst_idct/inst_s2p1/dout_reg_182_/D
inst_idct/inst_s2p1/dout_reg_183_/D
inst_idct/inst_s2p1/dout_reg_184_/D
inst_idct/inst_s2p1/dout_reg_185_/D
inst_idct/inst_s2p1/dout_reg_186_/D
inst_idct/inst_s2p1/dout_reg_187_/D
inst_idct/inst_s2p1/dout_reg_188_/D
inst_idct/inst_s2p1/dout_reg_189_/D
inst_idct/inst_s2p1/dout_reg_190_/D
inst_idct/inst_s2p1/dout_reg_191_/D
inst_idct/inst_s2p1/dout_reg_192_/D
inst_idct/inst_s2p1/dout_reg_193_/D
inst_idct/inst_s2p1/dout_reg_194_/D
inst_idct/inst_s2p1/dout_reg_195_/D
inst_idct/inst_s2p1/dout_reg_196_/D
inst_idct/inst_s2p1/dout_reg_197_/D
inst_idct/inst_s2p1/dout_reg_198_/D
inst_idct/inst_s2p1/dout_reg_199_/D
inst_idct/inst_s2p1/dout_reg_200_/D
inst_idct/inst_s2p1/dout_reg_201_/D
inst_idct/inst_s2p1/dout_reg_202_/D
inst_idct/inst_s2p1/dout_reg_203_/D
inst_idct/inst_s2p1/dout_reg_204_/D
inst_idct/inst_s2p1/dout_reg_205_/D
inst_idct/inst_s2p1/dout_reg_206_/D
inst_idct/inst_s2p1/dout_reg_207_/D
inst_idct/inst_s2p1/dout_reg_208_/D
inst_idct/inst_s2p1/dout_reg_209_/D
inst_idct/inst_s2p1/dout_reg_210_/D
inst_idct/inst_s2p1/dout_reg_211_/D
inst_idct/inst_s2p1/dout_reg_212_/D
inst_idct/inst_s2p1/dout_reg_213_/D
inst_idct/inst_s2p1/dout_reg_214_/D
inst_idct/inst_s2p1/dout_reg_215_/D
inst_idct/inst_s2p1/dout_reg_216_/D
inst_idct/inst_s2p1/dout_reg_217_/D
inst_idct/inst_s2p1/dout_reg_218_/D
inst_idct/inst_s2p1/dout_reg_219_/D
inst_idct/inst_s2p1/dout_reg_220_/D
inst_idct/inst_s2p1/dout_reg_221_/D
inst_idct/inst_s2p1/dout_reg_222_/D
inst_idct/inst_s2p1/dout_reg_223_/D
inst_idct/inst_s2p1/dout_reg_224_/D
inst_idct/inst_s2p1/dout_reg_225_/D
inst_idct/inst_s2p1/dout_reg_226_/D
inst_idct/inst_s2p1/dout_reg_227_/D
inst_idct/inst_s2p1/dout_reg_228_/D
inst_idct/inst_s2p1/dout_reg_229_/D
inst_idct/inst_s2p1/dout_reg_230_/D
inst_idct/inst_s2p1/dout_reg_231_/D
inst_idct/inst_s2p1/dout_reg_232_/D
inst_idct/inst_s2p1/dout_reg_233_/D
inst_idct/inst_s2p1/dout_reg_234_/D
inst_idct/inst_s2p1/dout_reg_235_/D
inst_idct/inst_s2p1/dout_reg_236_/D
inst_idct/inst_s2p1/dout_reg_237_/D
inst_idct/inst_s2p1/dout_reg_238_/D
inst_idct/inst_s2p1/dout_reg_239_/D
inst_idct/inst_s2p1/dout_reg_240_/D
inst_idct/inst_s2p1/dout_reg_241_/D
inst_idct/inst_s2p1/dout_reg_242_/D
inst_idct/inst_s2p1/dout_reg_243_/D
inst_idct/inst_s2p1/dout_reg_244_/D
inst_idct/inst_s2p1/dout_reg_245_/D
inst_idct/inst_s2p1/dout_reg_246_/D
inst_idct/inst_s2p1/dout_reg_247_/D
inst_idct/inst_s2p1/dout_reg_248_/D
inst_idct/inst_s2p1/dout_reg_249_/D
inst_idct/inst_s2p1/dout_reg_250_/D
inst_idct/inst_s2p1/dout_reg_251_/D
inst_idct/inst_s2p1/dout_reg_252_/D
inst_idct/inst_s2p1/dout_reg_253_/D
inst_idct/inst_s2p1/dout_reg_254_/D
inst_idct/inst_s2p1/dout_reg_255_/D
inst_idct/inst_s2p2/dout_reg_0_/D
inst_idct/inst_s2p2/dout_reg_1_/D
inst_idct/inst_s2p2/dout_reg_2_/D
inst_idct/inst_s2p2/dout_reg_3_/D
inst_idct/inst_s2p2/dout_reg_4_/D
inst_idct/inst_s2p2/dout_reg_5_/D
inst_idct/inst_s2p2/dout_reg_6_/D
inst_idct/inst_s2p2/dout_reg_7_/D
inst_idct/inst_s2p2/dout_reg_8_/D
inst_idct/inst_s2p2/dout_reg_9_/D
inst_idct/inst_s2p2/dout_reg_10_/D
inst_idct/inst_s2p2/dout_reg_11_/D
inst_idct/inst_s2p2/dout_reg_12_/D
inst_idct/inst_s2p2/dout_reg_13_/D
inst_idct/inst_s2p2/dout_reg_14_/D
inst_idct/inst_s2p2/dout_reg_15_/D
inst_idct/inst_s2p2/dout_reg_16_/D
inst_idct/inst_s2p2/dout_reg_17_/D
inst_idct/inst_s2p2/dout_reg_18_/D
inst_idct/inst_s2p2/dout_reg_19_/D
inst_idct/inst_s2p2/dout_reg_20_/D
inst_idct/inst_s2p2/dout_reg_21_/D
inst_idct/inst_s2p2/dout_reg_22_/D
inst_idct/inst_s2p2/dout_reg_23_/D
inst_idct/inst_s2p2/dout_reg_24_/D
inst_idct/inst_s2p2/dout_reg_25_/D
inst_idct/inst_s2p2/dout_reg_26_/D
inst_idct/inst_s2p2/dout_reg_27_/D
inst_idct/inst_s2p2/dout_reg_28_/D
inst_idct/inst_s2p2/dout_reg_29_/D
inst_idct/inst_s2p2/dout_reg_30_/D
inst_idct/inst_s2p2/dout_reg_31_/D
inst_idct/inst_s2p2/dout_reg_32_/D
inst_idct/inst_s2p2/dout_reg_33_/D
inst_idct/inst_s2p2/dout_reg_34_/D
inst_idct/inst_s2p2/dout_reg_35_/D
inst_idct/inst_s2p2/dout_reg_36_/D
inst_idct/inst_s2p2/dout_reg_37_/D
inst_idct/inst_s2p2/dout_reg_38_/D
inst_idct/inst_s2p2/dout_reg_39_/D
inst_idct/inst_s2p2/dout_reg_40_/D
inst_idct/inst_s2p2/dout_reg_41_/D
inst_idct/inst_s2p2/dout_reg_42_/D
inst_idct/inst_s2p2/dout_reg_43_/D
inst_idct/inst_s2p2/dout_reg_44_/D
inst_idct/inst_s2p2/dout_reg_45_/D
inst_idct/inst_s2p2/dout_reg_46_/D
inst_idct/inst_s2p2/dout_reg_47_/D
inst_idct/inst_s2p2/dout_reg_48_/D
inst_idct/inst_s2p2/dout_reg_49_/D
inst_idct/inst_s2p2/dout_reg_50_/D
inst_idct/inst_s2p2/dout_reg_51_/D
inst_idct/inst_s2p2/dout_reg_52_/D
inst_idct/inst_s2p2/dout_reg_53_/D
inst_idct/inst_s2p2/dout_reg_54_/D
inst_idct/inst_s2p2/dout_reg_55_/D
inst_idct/inst_s2p2/dout_reg_56_/D
inst_idct/inst_s2p2/dout_reg_57_/D
inst_idct/inst_s2p2/dout_reg_58_/D
inst_idct/inst_s2p2/dout_reg_59_/D
inst_idct/inst_s2p2/dout_reg_60_/D
inst_idct/inst_s2p2/dout_reg_61_/D
inst_idct/inst_s2p2/dout_reg_62_/D
inst_idct/inst_s2p2/dout_reg_63_/D
inst_idct/inst_s2p2/dout_reg_64_/D
inst_idct/inst_s2p2/dout_reg_65_/D
inst_idct/inst_s2p2/dout_reg_66_/D
inst_idct/inst_s2p2/dout_reg_67_/D
inst_idct/inst_s2p2/dout_reg_68_/D
inst_idct/inst_s2p2/dout_reg_69_/D
inst_idct/inst_s2p2/dout_reg_70_/D
inst_idct/inst_s2p2/dout_reg_71_/D
inst_idct/inst_s2p2/dout_reg_72_/D
inst_idct/inst_s2p2/dout_reg_73_/D
inst_idct/inst_s2p2/dout_reg_74_/D
inst_idct/inst_s2p2/dout_reg_75_/D
inst_idct/inst_s2p2/dout_reg_76_/D
inst_idct/inst_s2p2/dout_reg_77_/D
inst_idct/inst_s2p2/dout_reg_78_/D
inst_idct/inst_s2p2/dout_reg_79_/D
inst_idct/inst_s2p2/dout_reg_80_/D
inst_idct/inst_s2p2/dout_reg_81_/D
inst_idct/inst_s2p2/dout_reg_82_/D
inst_idct/inst_s2p2/dout_reg_83_/D
inst_idct/inst_s2p2/dout_reg_84_/D
inst_idct/inst_s2p2/dout_reg_85_/D
inst_idct/inst_s2p2/dout_reg_86_/D
inst_idct/inst_s2p2/dout_reg_87_/D
inst_idct/inst_s2p2/dout_reg_88_/D
inst_idct/inst_s2p2/dout_reg_89_/D
inst_idct/inst_s2p2/dout_reg_90_/D
inst_idct/inst_s2p2/dout_reg_91_/D
inst_idct/inst_s2p2/dout_reg_92_/D
inst_idct/inst_s2p2/dout_reg_93_/D
inst_idct/inst_s2p2/dout_reg_94_/D
inst_idct/inst_s2p2/dout_reg_95_/D
inst_idct/inst_s2p2/dout_reg_96_/D
inst_idct/inst_s2p2/dout_reg_97_/D
inst_idct/inst_s2p2/dout_reg_98_/D
inst_idct/inst_s2p2/dout_reg_99_/D
inst_idct/inst_s2p2/dout_reg_100_/D
inst_idct/inst_s2p2/dout_reg_101_/D
inst_idct/inst_s2p2/dout_reg_102_/D
inst_idct/inst_s2p2/dout_reg_103_/D
inst_idct/inst_s2p2/dout_reg_104_/D
inst_idct/inst_s2p2/dout_reg_105_/D
inst_idct/inst_s2p2/dout_reg_106_/D
inst_idct/inst_s2p2/dout_reg_107_/D
inst_idct/inst_s2p2/dout_reg_108_/D
inst_idct/inst_s2p2/dout_reg_109_/D
inst_idct/inst_s2p2/dout_reg_110_/D
inst_idct/inst_s2p2/dout_reg_111_/D
inst_idct/inst_s2p2/dout_reg_112_/D
inst_idct/inst_s2p2/dout_reg_113_/D
inst_idct/inst_s2p2/dout_reg_114_/D
inst_idct/inst_s2p2/dout_reg_115_/D
inst_idct/inst_s2p2/dout_reg_116_/D
inst_idct/inst_s2p2/dout_reg_117_/D
inst_idct/inst_s2p2/dout_reg_118_/D
inst_idct/inst_s2p2/dout_reg_119_/D
inst_idct/inst_s2p2/dout_reg_120_/D
inst_idct/inst_s2p2/dout_reg_121_/D
inst_idct/inst_s2p2/dout_reg_122_/D
inst_idct/inst_s2p2/dout_reg_123_/D
inst_idct/inst_s2p2/dout_reg_124_/D
inst_idct/inst_s2p2/dout_reg_125_/D
inst_idct/inst_s2p2/dout_reg_126_/D
inst_idct/inst_s2p2/dout_reg_127_/D
inst_idct/inst_s2p2/dout_reg_128_/D
inst_idct/inst_s2p2/dout_reg_129_/D
inst_idct/inst_s2p2/dout_reg_130_/D
inst_idct/inst_s2p2/dout_reg_131_/D
inst_idct/inst_s2p2/dout_reg_132_/D
inst_idct/inst_s2p2/dout_reg_133_/D
inst_idct/inst_s2p2/dout_reg_134_/D
inst_idct/inst_s2p2/dout_reg_135_/D
inst_idct/inst_s2p2/dout_reg_136_/D
inst_idct/inst_s2p2/dout_reg_137_/D
inst_idct/inst_s2p2/dout_reg_138_/D
inst_idct/inst_s2p2/dout_reg_139_/D
inst_idct/inst_s2p2/dout_reg_140_/D
inst_idct/inst_s2p2/dout_reg_141_/D
inst_idct/inst_s2p2/dout_reg_142_/D
inst_idct/inst_s2p2/dout_reg_143_/D
inst_idct/inst_s2p2/dout_reg_144_/D
inst_idct/inst_s2p2/dout_reg_145_/D
inst_idct/inst_s2p2/dout_reg_146_/D
inst_idct/inst_s2p2/dout_reg_147_/D
inst_idct/inst_s2p2/dout_reg_148_/D
inst_idct/inst_s2p2/dout_reg_149_/D
inst_idct/inst_s2p2/dout_reg_150_/D
inst_idct/inst_s2p2/dout_reg_151_/D
inst_idct/inst_s2p2/dout_reg_152_/D
inst_idct/inst_s2p2/dout_reg_153_/D
inst_idct/inst_s2p2/dout_reg_154_/D
inst_idct/inst_s2p2/dout_reg_155_/D
inst_idct/inst_s2p2/dout_reg_156_/D
inst_idct/inst_s2p2/dout_reg_157_/D
inst_idct/inst_s2p2/dout_reg_158_/D
inst_idct/inst_s2p2/dout_reg_159_/D
inst_idct/inst_s2p2/dout_reg_160_/D
inst_idct/inst_s2p2/dout_reg_161_/D
inst_idct/inst_s2p2/dout_reg_162_/D
inst_idct/inst_s2p2/dout_reg_163_/D
inst_idct/inst_s2p2/dout_reg_164_/D
inst_idct/inst_s2p2/dout_reg_165_/D
inst_idct/inst_s2p2/dout_reg_166_/D
inst_idct/inst_s2p2/dout_reg_167_/D
inst_idct/inst_s2p2/dout_reg_168_/D
inst_idct/inst_s2p2/dout_reg_169_/D
inst_idct/inst_s2p2/dout_reg_170_/D
inst_idct/inst_s2p2/dout_reg_171_/D
inst_idct/inst_s2p2/dout_reg_172_/D
inst_idct/inst_s2p2/dout_reg_173_/D
inst_idct/inst_s2p2/dout_reg_174_/D
inst_idct/inst_s2p2/dout_reg_175_/D
inst_idct/inst_s2p2/dout_reg_176_/D
inst_idct/inst_s2p2/dout_reg_177_/D
inst_idct/inst_s2p2/dout_reg_178_/D
inst_idct/inst_s2p2/dout_reg_179_/D
inst_idct/inst_s2p2/dout_reg_180_/D
inst_idct/inst_s2p2/dout_reg_181_/D
inst_idct/inst_s2p2/dout_reg_182_/D
inst_idct/inst_s2p2/dout_reg_183_/D
inst_idct/inst_s2p2/dout_reg_184_/D
inst_idct/inst_s2p2/dout_reg_185_/D
inst_idct/inst_s2p2/dout_reg_186_/D
inst_idct/inst_s2p2/dout_reg_187_/D
inst_idct/inst_s2p2/dout_reg_188_/D
inst_idct/inst_s2p2/dout_reg_189_/D
inst_idct/inst_s2p2/dout_reg_190_/D
inst_idct/inst_s2p2/dout_reg_191_/D
inst_idct/inst_s2p2/dout_reg_192_/D
inst_idct/inst_s2p2/dout_reg_193_/D
inst_idct/inst_s2p2/dout_reg_194_/D
inst_idct/inst_s2p2/dout_reg_195_/D
inst_idct/inst_s2p2/dout_reg_196_/D
inst_idct/inst_s2p2/dout_reg_197_/D
inst_idct/inst_s2p2/dout_reg_198_/D
inst_idct/inst_s2p2/dout_reg_199_/D
inst_idct/inst_s2p2/dout_reg_200_/D
inst_idct/inst_s2p2/dout_reg_201_/D
inst_idct/inst_s2p2/dout_reg_202_/D
inst_idct/inst_s2p2/dout_reg_203_/D
inst_idct/inst_s2p2/dout_reg_204_/D
inst_idct/inst_s2p2/dout_reg_205_/D
inst_idct/inst_s2p2/dout_reg_206_/D
inst_idct/inst_s2p2/dout_reg_207_/D
inst_idct/inst_s2p2/dout_reg_208_/D
inst_idct/inst_s2p2/dout_reg_209_/D
inst_idct/inst_s2p2/dout_reg_210_/D
inst_idct/inst_s2p2/dout_reg_211_/D
inst_idct/inst_s2p2/dout_reg_212_/D
inst_idct/inst_s2p2/dout_reg_213_/D
inst_idct/inst_s2p2/dout_reg_214_/D
inst_idct/inst_s2p2/dout_reg_215_/D
inst_idct/inst_s2p2/dout_reg_216_/D
inst_idct/inst_s2p2/dout_reg_217_/D
inst_idct/inst_s2p2/dout_reg_218_/D
inst_idct/inst_s2p2/dout_reg_219_/D
inst_idct/inst_s2p2/dout_reg_220_/D
inst_idct/inst_s2p2/dout_reg_221_/D
inst_idct/inst_s2p2/dout_reg_222_/D
inst_idct/inst_s2p2/dout_reg_223_/D
inst_idct/inst_s2p2/dout_reg_224_/D
inst_idct/inst_s2p2/dout_reg_225_/D
inst_idct/inst_s2p2/dout_reg_226_/D
inst_idct/inst_s2p2/dout_reg_227_/D
inst_idct/inst_s2p2/dout_reg_228_/D
inst_idct/inst_s2p2/dout_reg_229_/D
inst_idct/inst_s2p2/dout_reg_230_/D
inst_idct/inst_s2p2/dout_reg_231_/D
inst_idct/inst_s2p2/dout_reg_232_/D
inst_idct/inst_s2p2/dout_reg_233_/D
inst_idct/inst_s2p2/dout_reg_234_/D
inst_idct/inst_s2p2/dout_reg_235_/D
inst_idct/inst_s2p2/dout_reg_236_/D
inst_idct/inst_s2p2/dout_reg_237_/D
inst_idct/inst_s2p2/dout_reg_238_/D
inst_idct/inst_s2p2/dout_reg_239_/D
inst_idct/inst_s2p2/dout_reg_240_/D
inst_idct/inst_s2p2/dout_reg_241_/D
inst_idct/inst_s2p2/dout_reg_242_/D
inst_idct/inst_s2p2/dout_reg_243_/D
inst_idct/inst_s2p2/dout_reg_244_/D
inst_idct/inst_s2p2/dout_reg_245_/D
inst_idct/inst_s2p2/dout_reg_246_/D
inst_idct/inst_s2p2/dout_reg_247_/D
inst_idct/inst_s2p2/dout_reg_248_/D
inst_idct/inst_s2p2/dout_reg_249_/D
inst_idct/inst_s2p2/dout_reg_250_/D
inst_idct/inst_s2p2/dout_reg_251_/D
inst_idct/inst_s2p2/dout_reg_252_/D
inst_idct/inst_s2p2/dout_reg_253_/D
inst_idct/inst_s2p2/dout_reg_254_/D
inst_idct/inst_s2p2/dout_reg_255_/D

Information: Checking pulse_clock_cell_type...

Information: Checking no_driving_cell...

Information: Checking partial_input_delay...
Warning: there are 20 input ports that only have partial input delay specified. (TIM-212)
--------------------
din[4]
din[3]
din[2]
din[1]
din[0]
mode[1]
mode[0]
din[12]
din[11]
din[10]
din[9]
din[8]
din[7]
din[6]
din[5]
din[15]
din[14]
din[13]
start
rstn
Information: Updating design information... (UID-85)
Warning: Design 'idct_chip' contains 2 high-fanout nets. A fanout number of 1000 will be used for delay calculations involving these nets. (TIM-134)
Information: Timing loop detected. (OPT-150)
        inst_idct/inst_p2s2/U4/A inst_idct/inst_p2s2/U4/Y 
Information: Timing loop detected. (OPT-150)
        inst_idct/inst_p2s2/U5/A1N inst_idct/inst_p2s2/U5/Y 
Warning: Disabling timing arc between pins 'A' and 'Y' on cell 'inst_idct/inst_p2s2/U4'
         to break a timing loop. (OPT-314)
Warning: Disabling timing arc between pins 'A1N' and 'Y' on cell 'inst_idct/inst_p2s2/U5'
         to break a timing loop. (OPT-314)
Warning: Disabling timing arc between pins 'A' and 'Y' on cell 'inst_idct/inst_p2s1/U4'
         to break a timing loop. (OPT-314)
Warning: Disabling timing arc between pins 'A1N' and 'Y' on cell 'inst_idct/inst_p2s1/U5'
         to break a timing loop. (OPT-314)
Warning: Disabling timing arc between pins 'AN' and 'Y' on cell 'inst_idct/idct_cal_col/U5'
         to break a timing loop. (OPT-314)
Warning: Disabling timing arc between pins 'B1' and 'Y' on cell 'inst_idct/idct_cal_col/U4'
         to break a timing loop. (OPT-314)
Warning: Disabling timing arc between pins 'A1N' and 'Y' on cell 'inst_idct/inst_s2p1/U4'
         to break a timing loop. (OPT-314)
Warning: Disabling timing arc between pins 'A1N' and 'Y' on cell 'inst_idct/inst_s2p1/U3'
         to break a timing loop. (OPT-314)
Warning: Disabling timing arc between pins 'AN' and 'Y' on cell 'inst_idct/idct_cal_row/U5'
         to break a timing loop. (OPT-314)
Warning: Disabling timing arc between pins 'B1' and 'Y' on cell 'inst_idct/idct_cal_row/U4'
         to break a timing loop. (OPT-314)
Warning: Disabling timing arc between pins 'A1N' and 'Y' on cell 'inst_idct/inst_s2p2/U4'
         to break a timing loop. (OPT-314)
Warning: Disabling timing arc between pins 'A1N' and 'Y' on cell 'inst_idct/inst_s2p2/U3'
         to break a timing loop. (OPT-314)
 
****************************************
Report : timing_requirements
        -attributes
Design : idct_chip
Version: D-2010.03-ICC-SP5-2
Date   : Fri Apr 17 15:05:01 2020
****************************************

 
****************************************
Report : disable_timing
Design : idct_chip
Version: D-2010.03-ICC-SP5-2
Date   : Fri Apr 17 15:05:01 2020
****************************************



Flags:       c  case-analysis
             f  false net arc
             C  Conditional arc
             l  loop breaking
             u  user-defined
             L  stored loop breaking


  Cell or Port        From        To             Sense               Flag
--------------------------------------------------------------------------------

  inst_idct/idct_cal_col/U4
                      B1          Y              negative_unate      L 
  inst_idct/idct_cal_col/U5
                      AN          Y              positive_unate      L 
  inst_idct/idct_cal_row/U4
                      B1          Y              negative_unate      L 
  inst_idct/idct_cal_row/U5
                      AN          Y              positive_unate      L 
  inst_idct/inst_p2s1/U4
                      A           Y              positive_unate      L 
  inst_idct/inst_p2s1/U5
                      A1N         Y              positive_unate      L 
  inst_idct/inst_p2s2/U4
                      A           Y              positive_unate      L 
  inst_idct/inst_p2s2/U5
                      A1N         Y              positive_unate      L 
  inst_idct/inst_s2p1/U3
                      A1N         Y              positive_unate      L 
  inst_idct/inst_s2p1/U4
                      A1N         Y              positive_unate      L 
  inst_idct/inst_s2p2/U3
                      A1N         Y              positive_unate      L 
  inst_idct/inst_s2p2/U4
                      A1N         Y              positive_unate      L 

 
****************************************
Report : case_analysis
Design : idct_chip
Version: D-2010.03-ICC-SP5-2
Date   : Fri Apr 17 15:05:02 2020
****************************************


 
****************************************
Report : clocks
Design : idct_chip
Version: D-2010.03-ICC-SP5-2
Date   : Fri Apr 17 15:05:02 2020
****************************************

Attributes:
    d - dont_touch_network
    f - fix_hold
    p - propagated_clock
    G - generated_clock
    g - lib_generated_clock

Clock          Period   Waveform            Attrs     Sources
--------------------------------------------------------------------------------
clk             20.00   {0 10}                        {clk}
--------------------------------------------------------------------------------
 
****************************************
Report : clock_skew
Design : idct_chip
Version: D-2010.03-ICC-SP5-2
Date   : Fri Apr 17 15:05:02 2020
****************************************

                 Rise      Fall  Min Rise  Min fall        Uncertainty
Object          Delay     Delay     Delay     Delay     Plus      Minus
--------------------------------------------------------------------------------
clk                 -         -         -         -      0.20      0.20

                 Max Transition      Min Transition
Object           Rise      Fall      Rise      Fall
-------------------------------------------------------
clk              0.10      0.10         -         -
Warning: Design 'idct_chip' contains 2 high-fanout nets. A fanout number of 1000 will be used for delay calculations involving these nets. (TIM-134)
Information: Timing loop detected. (OPT-150)
        inst_idct/inst_p2s2/U4/A inst_idct/inst_p2s2/U4/Y 
Information: Timing loop detected. (OPT-150)
        inst_idct/inst_p2s2/U5/A1N inst_idct/inst_p2s2/U5/Y 
Warning: Disabling timing arc between pins 'A' and 'Y' on cell 'inst_idct/inst_p2s2/U4'
         to break a timing loop. (OPT-314)
Warning: Disabling timing arc between pins 'A1N' and 'Y' on cell 'inst_idct/inst_p2s2/U5'
         to break a timing loop. (OPT-314)
Warning: Disabling timing arc between pins 'A' and 'Y' on cell 'inst_idct/inst_p2s1/U4'
         to break a timing loop. (OPT-314)
Warning: Disabling timing arc between pins 'A1N' and 'Y' on cell 'inst_idct/inst_p2s1/U5'
         to break a timing loop. (OPT-314)
Warning: Disabling timing arc between pins 'AN' and 'Y' on cell 'inst_idct/idct_cal_col/U5'
         to break a timing loop. (OPT-314)
Warning: Disabling timing arc between pins 'B1' and 'Y' on cell 'inst_idct/idct_cal_col/U4'
         to break a timing loop. (OPT-314)
Warning: Disabling timing arc between pins 'A1N' and 'Y' on cell 'inst_idct/inst_s2p1/U4'
         to break a timing loop. (OPT-314)
Warning: Disabling timing arc between pins 'A1N' and 'Y' on cell 'inst_idct/inst_s2p1/U3'
         to break a timing loop. (OPT-314)
Warning: Disabling timing arc between pins 'AN' and 'Y' on cell 'inst_idct/idct_cal_row/U5'
         to break a timing loop. (OPT-314)
Warning: Disabling timing arc between pins 'B1' and 'Y' on cell 'inst_idct/idct_cal_row/U4'
         to break a timing loop. (OPT-314)
Warning: Disabling timing arc between pins 'A1N' and 'Y' on cell 'inst_idct/inst_s2p2/U4'
         to break a timing loop. (OPT-314)
Warning: Disabling timing arc between pins 'A1N' and 'Y' on cell 'inst_idct/inst_s2p2/U3'
         to break a timing loop. (OPT-314)
Warning: Timer is in zero interconnect delay mode. (TIM-177)
Information: Timer is not in zero interconnect delay mode. (TIM-176)
Information: Performing CEL netlist consistency check. (MWDC-118)
Information: CEL consistency check PASSED. (MWDC-119)
Information: Saved design named 1_datasetup. (UIG-5)
1
icc_shell> gui_set_current_task -name {Design Planning}
Information: Visibility is turned OFF for cells and cell contents because the task is set to Design Planning (GUI-026)
icc_shell> source pad_cell_cons.tcl
Creating cell 'CornerLL' in design 'idct_chip'.
Creating cell 'CornerLR' in design 'idct_chip'.
Creating cell 'CornerTR' in design 'idct_chip'.
Creating cell 'CornerTL' in design 'idct_chip'.
Creating cell 'vss1_l' in design 'idct_chip'.
Creating cell 'vss1_r' in design 'idct_chip'.
Creating cell 'vss1_t' in design 'idct_chip'.
Creating cell 'vss1_b' in design 'idct_chip'.
Creating cell 'vdd1_l' in design 'idct_chip'.
Creating cell 'vdd1_r' in design 'idct_chip'.
Creating cell 'vdd1_t' in design 'idct_chip'.
Creating cell 'vdd1_b' in design 'idct_chip'.
Creating cell 'vss2_l' in design 'idct_chip'.
Creating cell 'vss2_r' in design 'idct_chip'.
Creating cell 'vss2_t' in design 'idct_chip'.
Creating cell 'vss2_b' in design 'idct_chip'.
Creating cell 'vdd2_l' in design 'idct_chip'.
Creating cell 'vdd2_r' in design 'idct_chip'.
Creating cell 'vdd2_t' in design 'idct_chip'.
Creating cell 'vdd2_b' in design 'idct_chip'.
1
icc_shell> initialize_floorplan -core_utilization 0.8 -left_io2core 30.0 -bottom_io2core 30.0 -right_io2core 30.0 -top_io2core 30.0
59 pads are constrained in TDF table
There are 55 IO pads 4 corner pads in total
Start to create wire tracks ...
GRC reference (234960,234960), dimensions (5040, 5040)
Start to place pads/pins ...
ERROR : No such pad/pin PIW_mode2; Constraint ignored.
ERROR : No such pad/pin PO2W_dout0; Constraint ignored.
ERROR : No such pad/pin PO2W_dout1; Constraint ignored.
ERROR : No such pad/pin PO2W_dout2; Constraint ignored.
ERROR : No such pad/pin PO2W_dout3; Constraint ignored.
ERROR : No such pad/pin PO2W_dout4; Constraint ignored.
ERROR : No such pad/pin PO2W_dout5; Constraint ignored.
ERROR : No such pad/pin PO2W_dout6; Constraint ignored.
ERROR : No such pad/pin PO2W_dout7; Constraint ignored.
ERROR : No such pad/pin PO2W_dout8; Constraint ignored.
ERROR : No such pad/pin PO2W_dout9; Constraint ignored.
ERROR : No such pad/pin PO2W_dout10; Constraint ignored.
ERROR : No such pad/pin PO2W_dout11; Constraint ignored.
ERROR : No such pad/pin PO2W_dout12; Constraint ignored.
ERROR : No such pad/pin PO2W_dout13; Constraint ignored.
ERROR : No such pad/pin PO2W_dout14; Constraint ignored.
ERROR : No such pad/pin PO2W_dout15; Constraint ignored.
ERROR : No such pad/pin PO2W_douten; Constraint ignored.
ERROR : No such pad/pin PIW_rst_n; Constraint ignored.
There are 0 pads constrained by min IO spacing.

Running IO Placement Refinement...

IO Placement Refinement Completed Successfully.

Place pads/pins successfully
Warning: Pin constraints not found for top block.  Default pin constraints are saved. (FPHSM-0010)
Warning: Cell instance inst_idct/inst_s2p1/dout_reg_76_ is not completely placed inside top block idct_chip (FPHSM-1800)
Warning: Current cell: cell placement is incomplete and will be ignored (FPHSM-1829)
Warning: Pad cells edges are now open for terminal placement (FPHSM-0019)
Number of terminals created: 39.
=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
Name        Original Ports
idct_chip               39
=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
Completed pin assignment.
Elapsed =    0:00:00, CPU =    0:00:00
Planner Summary:
This floorplan is created by using tile name (unit).
        Row Direction = HORIZONTAL
        Control Parameter =  Aspect Ratio
        Core Utilization = 0.802
        Number Of Rows = 234
        Core Width = 1182.06
        Core Height = 1179.36
        Aspect Ratio = 0.998
        Double Back ON
        Flip First Row = NO
        Start From First Row = NO
Planner run through successfully.
1
icc_shell> source derive_pg.tcl
begin derive_pg_connection...
--- connected 4 power ports and 4 ground ports
Information: PG PORT PUNCHING: Number of ports connected:                8 (MW-337)
Information: PG PORT PUNCHING: Total number of changes:                  8 (MW-339)
begin derive_pg_connection...
-- reconnected total 0 tie highs and 0 tie lows
1
icc_shell> save_mw_cel -as 2_1_floorplan_init
Information: Performing CEL netlist consistency check. (MWDC-118)
Information: CEL consistency check PASSED. (MWDC-119)
Information: Saved design named 2_1_floorplan_init. (UIG-5)
1
icc_shell> source pns.tcl
Geometry mapping begins.
Removing all the files with the prefix idct_chip in the directory ./pna_output
Parasitics Operating Condition is max

TLU+ File = /home/student/Desktop/Workspace/SMIC18/tlup/smiclog018_5lm_cell_max.tluplus
TLU+ File = /home/student/Desktop/Workspace/SMIC18/tlup/smiclog018_5lm_cell_min.tluplus

--------- Sanity Check on TLUPlus Files -------------
1. Checking the conducting layer names in ITF and mapping file ... 
[ Passed! ]
2. Checking the via layer names in ITF and mapping file ... 
[ Passed! ]
3. Checking the consistency of Min Width and Min Spacing between MW-tech and ITF ... 
[ Passed! ]
----------------- Check Ends ------------------
TLU+ based extraction:
Resistance based on max model.
Using operating temperature of  25.00 degree Celsius.
EKL: layer poly has pitch<width+spacing, forced pitch=width+spacing
Getting the info of via resistance from TLU+ model
can not find resistance in tluplus for polyCont; skip ...
can not find resistance in tluplus for polyCont; skip ...
lower mask id 0, upper mask id 1, via layer 50, resistivity 0.000000
via resistance of default area is used for layer 20
via resistance of default area is used for layer 20
lower mask id 1, upper mask id 2, via layer 70, resistivity 10.000000
via resistance of default area is used for layer 21
lower mask id 2, upper mask id 3, via layer 71, resistivity 10.000000
lower mask id 3, upper mask id 4, via layer 72, resistivity 10.000000
lower mask id 4, upper mask id 5, via layer 73, resistivity 8.000000
EKL: max metal layer: 5  max back metal layer: 0
Ignoring all CONN views
Number of pad instances: 8
Geometry mapping took     0.19 seconds

Name of design : idct_chip
Number of cell instance masters in the library : 73
Number of cell instances in the design : 27106
Power Network Synthesis Begins ...
Target IR drop : 198.000 mV
Processing net VDD ...
Average power dissipation in idct_chip :    50.00 mW
Power supply voltage :     1.98 V
Average current in idct_chip :    25.25 mA
Total power of the unplaced cells :      50.000 mW
EKL: layer 2, width 10.000 > max tlu+ tab range
EKL: layer 2, width 10.000 > max tlu+ tab range
EKL: layer 5, width 4.000 > max tlu+ tab range
EKL: layer 5, width 4.000 > max tlu+ tab range
EKL: layer 4, width 4.000 > max tlu+ tab range
25 percent of initial power plan synthesis is done.
50 percent of initial power plan synthesis is done.
75 percent of initial power plan synthesis is done.
100 percent of initial power plan synthesis is done.
Performing Wire Cutting and Resizing of net VDD for Honoring Blockage Constraints
Processing 7x7 straps
Number of power pads reaching to the power ports of the leaf cells or blocks: 4
Total assigned virtual connection port current is 25.252525
Total assigned connected port current is 0.000000
Total assigned current is 25.252525
Total floating virtual connection port current is 0.000000
Total floating connected port current is 0.000000
Simulation begin ...
Pad Cell vdd1_l at (0.000 836.420) Supplies    7.28 mA Current (28.82%)
Pad Cell vdd1_t at (793.030 1449.360) Supplies    6.83 mA Current (27.05%)
Pad Cell vdd1_r at (1452.060 306.945) Supplies    6.74 mA Current (26.68%)
Pad Cell vdd1_b at (307.170 0.000) Supplies    4.41 mA Current (17.44%)
Total Current from Pad Cells:   25.25 mA (100.00%)
Total Current from Virtual Pads:    0.00 mA (0.00%)
Maximum IR drop in idct_chip : 20.14 mV
Maximum current in idct_chip : 7.277 mA
Maximum EM of wires in idct_chip : 9.876592e+00 A/cm, layer METAL5
Maximum EM of vias in idct_chip : 5.363176e+04 A/cm_square, layer VIA45
The PNS synthesizes the net VDD successfully
The maximum IR drop of the synthesized net VDD is  20.142 mV
Processing net VSS ...
Average power dissipation in idct_chip :    50.00 mW
Power supply voltage :     1.98 V
Average current in idct_chip :    25.25 mA
Total power of the unplaced cells :      50.000 mW
Performing Wire Cutting of net VSS for Honoring Blockage Constraints
Number of power pads reaching to the power ports of the leaf cells or blocks: 4
Total assigned virtual connection port current is 25.252525
Total assigned connected port current is 0.000000
Total assigned current is 25.252525
Total floating virtual connection port current is 0.000000
Total floating connected port current is 0.000000
Simulation begin ...
Pad Cell vss1_l at (0.000 925.910) Supplies    7.32 mA Current (28.99%)
Pad Cell vss1_r at (1452.060 403.890) Supplies    6.96 mA Current (27.56%)
Pad Cell vss1_t at (876.320 1449.360) Supplies    6.19 mA Current (24.52%)
Pad Cell vss1_b at (404.340 0.000) Supplies    4.78 mA Current (18.94%)
Total Current from Pad Cells:   25.25 mA (100.00%)
Total Current from Virtual Pads:    0.00 mA (0.00%)
Maximum IR drop in idct_chip : 18.61 mV
Maximum current in idct_chip : 7.320 mA
Maximum EM of wires in idct_chip : 1.015079e+01 A/cm, layer METAL5
Maximum EM of vias in idct_chip : 6.116490e+04 A/cm_square, layer VIA45
The PPS synthesizes the net VSS successfully
The maximum IR drop of the synthesized net VSS is  18.610

The statistics of PNS results
Global Constraints Setting
Remove Floating Segments:       On
Use Stack Via:                  On
Same PG Width Sizing:           On
Optimize Track Usage:           Off
Keep Ring Outside Core Area:    Off
No Straps Over Hard Macros:     On
No Straps Over Plan Groups:     Off
No Straps Over Soft Macros:     Off
Ignore Blockage:                Off
Target IR drop :  198.00 mV
Net name : VDD
IR drop of the synthesized net :   20.14 mV
Core ring segment: Horizontal: metal3, Width: 10.000 microns
Core ring segment: Vertical: metal2, Width: 10.000 microns
Layer: metal5, Direction: Horizontal, # of Straps: 7, PG spacing
The maximum width of straps: 2.000 microns
The average width of straps: 2.000 microns
Layer: metal4, Direction: Vertical, # of Straps: 7, PG spacing
The maximum width of straps: 2.000 microns
The average width of straps: 2.000 microns
The percentage of routing tracks used by the power net VDD for layer metal5: 1.20%
The percentage of routing tracks used by the power net VDD for layer metal4: 1.04%
The percentage of routing tracks used by the power net VDD for layer metal3: 1.06%
The percentage of routing tracks used by the power net VDD for layer metal2: 1.07%
The percentage of routing tracks used by the power net VDD for layer metal1: 0.00%
Net name : VSS
IR drop of the synthesized net :   18.61 mV
Core ring segment: Horizontal: metal3, Width: 10.000 microns
Core ring segment: Vertical: metal2, Width: 10.000 microns
Layer: metal5, Direction: Horizontal, # of Straps: 7, PG spacing
The maximum width of straps: 2.000 microns
The average width of straps: 2.000 microns
Layer: metal4, Direction: Vertical, # of Straps: 7, PG spacing
The maximum width of straps: 2.000 microns
The average width of straps: 2.000 microns
The percentage of routing tracks used by the power net VSS for layer metal5: 1.18%
The percentage of routing tracks used by the power net VSS for layer metal4: 1.02%
The percentage of routing tracks used by the power net VSS for layer metal3: 1.04%
The percentage of routing tracks used by the power net VSS for layer metal2: 0.99%
The percentage of routing tracks used by the power net VSS for layer metal1: 0.00%
Generating instance power and IR drop file ./pna_output/idct_chip.inst_hl.pna
Memory usage for design data :      16973.824 Kbytes
Generating Power Routing Tcl commands file ./pna_output/create_pns_pg.tcl
Overall takes     0.29 seconds
Please read idct_chip.PNS.log for detail information
Creating PNS Replay file ./pna_output/pns_replay.tcl
Power network synthesis is done successfully.
Reading power network analysis highlight file: ./pna_output/idct_chip.VDD.pw_hl.pna ...
Setting the IR threshold of drop ratio display to 0.100 mV
Successfully create error file ./pna_output/VDD.VD.report
Successfully loaded voltage drop map
Report display map data ...
Successfully created the VD report file icc_gui.output
1
icc_shell> commit_fp_rail
Committing the synthesized power plan ... 
27047 cells out of bound
Done with committing power plan!
1
icc_shell> preroute_instances27047 cells out of bound

Instance being processed:
 [1] PIW_din6
 [2] PIW_din7
 [3] PIW_din8
 [4] PIW_din9
 [5] PIW_din10
 [6] PIW_din11
 [7] vdd2_t
 [8] vdd1_t
WARNING:  Failed to make a connection for the following pin:
((799.730, 1449.360) (862.330, 1450.210)) (Net: VDD)(wire on layer: METAL3 [63])
WARNING:  Failed to make a connection for the following pin:
((799.730, 1449.360) (862.330, 1450.210)) (Net: VDD)(wire on layer: METAL4 [64])
 [9] vss1_t
 [10] vss2_t
 [11] PIW_din12
 [12] PIW_din13
 [13] PIW_din14
 [14] PIW_din15
 [15] PO8W_dout10
 [16] vdd2_b
 [17] vdd1_b
WARNING:  Failed to make a connection for the following pin:
((313.870, 209.150) (376.470, 210.000)) (Net: VDD)(wire on layer: METAL3 [63])
 [18] vss1_b
 [19] vss2_b
 [20] PIW_clk
 [21] PO8W_dout12
 [22] PO8W_dout14
 [23] PO8W_dout_mode0
 [24] PO8W_dout2
 [25] PO8W_dout4
 [26] PO8W_dout6
 [27] PO8W_dout8
 [28] PO8W_dout0
 [29] vdd2_r
 [30] vdd1_r
WARNING:  Failed to make a connection for the following pin:
((1452.060, 313.645) (1452.910, 376.245)) (Net: VDD)(wire on layer: METAL2 [62])
 [31] vss1_r
 [32] vss2_r
 [33] PO8W_dout11
 [34] PO8W_dout13
 [35] PO8W_dout15
 [36] PO8W_dout_mode1
 [37] PO8W_dout3
 [38] PO8W_dout5
 [39] PO8W_dout7
 [40] PO8W_dout9
 [41] PO8W_dout1
 [42] PIW_start
 [43] PIW_mode0
 [44] PIW_mode1
 [45] PIW_din0
 [46] PIW_din1
 [47] PIW_din2
 [48] vdd2_l
 [49] vdd1_l
WARNING:  Failed to make a connection for the following pin:
((209.150, 843.120) (210.000, 905.720)) (Net: VDD)(wire on layer: METAL2 [62])
 [50] vss1_l
 [51] vss2_l
 [52] PIW_din3
 [53] PIW_din4
 [54] PIW_din5
 [55] PIW_rstn
 [59] [done] 

[Prerouter] CPU = 00:00:00, Elapsed = 00:00:00
        Peak Memory =      361M Data =       33M
1
icc_shell> preroute_standard_cells -fill_empty_rows -remove_floating_pieces27047 cells out of bound

Prerouting standard cells horizontally: 
 [10.68%]  
 [20.94%]  
 [31.20%]  
 [41.45%]  
 [52.14%]  
 [62.39%]  
 [72.65%]  
 [82.91%]  
 [93.16%]  
 [100.00%] [done] 

[Prerouter] CPU = 00:00:00, Elapsed = 00:00:01
        Peak Memory =      361M Data =       33M
1
icc_shell> analyze_fp_rail -nets {VDD VSS} -voltage_supply 1.98 -pad_masters {PVSS1W PVDD1W}
Geometry mapping begins.
Removing all the files with the prefix idct_chip in the directory ./pna_output
Parasitics Operating Condition is max
TLU+ based extraction:
Resistance based on max model.
Using operating temperature of  25.00 degree Celsius.
EKL: layer poly has pitch<width+spacing, forced pitch=width+spacing
Getting the info of via resistance from TLU+ model
can not find resistance in tluplus for polyCont; skip ...
can not find resistance in tluplus for polyCont; skip ...
lower mask id 0, upper mask id 1, via layer 50, resistivity 0.000000
lower mask id 1, upper mask id 2, via layer 70, resistivity 10.000000
lower mask id 2, upper mask id 3, via layer 71, resistivity 10.000000
lower mask id 3, upper mask id 4, via layer 72, resistivity 10.000000
lower mask id 4, upper mask id 5, via layer 73, resistivity 8.000000
EKL: max metal layer: 5  max back metal layer: 0
Number of pad instances: 8
Geometry mapping took     0.18 seconds
All the cells are not placed

Name of design : idct_chip
Number of cell instances in the design : 27106
Number of cell instance masters in the library : 73

Processing power net VSS ...
Number of power net wires : 141
Number of vias : 2818
Average power dissipation in idct_chip :  1000.00 mW
Power supply voltage :     1.98 V
Assigning vias begins
Assigning vias took     0.00 seconds
Total power of the unplaced cells :      1000.000 mW
Assigning power net wires ...
Reading virtual power pads
Extracting power net VSS ...
Number of power pad nodes connecting to power net VSS : 8
Number of power pads reaching to the power ports of the leaf cells or blocks: 8
Number of resistors in VSS : 5345
Number of nodes in VSS : 4279
Assigning netlists to simulation engine begins...
Total assigned virtual connection port current is 505.050500
Total assigned connected port current is 0.000000
Total assigned current is 505.050500
Total floating virtual connection port current is 0.000000
Total floating connected port current is 0.000000
Assigning netlists to simulation engine finished
Simulation begin ...
Pad Cell vss1_l at (0.000 925.910) Supplies  184.34 mA Current (36.50%)
Pad Cell vss1_r at (1452.060 403.890) Supplies  144.79 mA Current (28.67%)
Pad Cell vss1_t at (876.320 1449.360) Supplies   99.25 mA Current (19.65%)
Pad Cell vss1_b at (404.340 0.000) Supplies   76.67 mA Current (15.18%)
Total Current from Pad Cells:  505.05 mA (100.00%)
Total Current from Virtual Pads:    0.00 mA (0.00%)
Maximum IR drop in idct_chip : 186.78 mV
Maximum current in idct_chip : 171.213 mA
Maximum EM of wires in idct_chip : 1.112657e+02 A/cm, layer METAL4
Maximum EM of vias in idct_chip : 1.090352e+06 A/cm_square, layer VIA12

Processing power net VDD ...
Number of power net wires : 181
Number of vias : 2827
Average power dissipation in idct_chip :  1000.00 mW
Power supply voltage :     1.98 V
Assigning vias begins
Assigning vias took     0.00 seconds
Total power of the unplaced cells :      1000.000 mW
Assigning power net wires ...
Reading virtual power pads
Extracting power net VDD ...
Number of power pad nodes connecting to power net VDD : 18
Number of power pads reaching to the power ports of the leaf cells or blocks: 18
Number of resistors in VDD : 5511
Number of nodes in VDD : 4431
Assigning netlists to simulation engine begins...
Total assigned virtual connection port current is 505.050500
Total assigned connected port current is 0.000000
Total assigned current is 505.050500
Total floating virtual connection port current is 0.000000
Total floating connected port current is 0.000000
Assigning netlists to simulation engine finished
Simulation begin ...
Pad Cell vdd1_l at (0.000 836.420) Supplies  185.39 mA Current (36.71%)
Pad Cell vdd1_r at (1452.060 306.945) Supplies  128.57 mA Current (25.46%)
Pad Cell vdd1_t at (793.030 1449.360) Supplies  118.41 mA Current (23.45%)
Pad Cell vdd1_b at (307.170 0.000) Supplies   72.68 mA Current (14.39%)
Total Current from Pad Cells:  505.05 mA (100.00%)
Total Current from Virtual Pads:    0.00 mA (0.00%)
Maximum IR drop in idct_chip : 211.15 mV
Maximum current in idct_chip : 109.337 mA
Maximum EM of wires in idct_chip : 1.540487e+02 A/cm, layer METAL4
Maximum EM of vias in idct_chip : 1.382295e+06 A/cm_square, layer VIA12
Generating instance power and IR drop file ./pna_output/idct_chip.inst_hl.pna
Overall takes     0.28 seconds
Please read ./pna_output/idct_chip.VPNA.log for detail information

Summary of the Power Network Analysis Results
Total Run Time:     0.46 seconds
Output directory used: ./pna_output
Average power dissipation in idct_chip: 1000.00 mW
Power Supply Voltage:    1.98 Volt
Number of the Analyzed Power/Ground Nets: 2

Net Name: VSS
Number of Pad Cells: 4
Number of Pad Cells Supplying Current: 4
Number of Virtual Pad Nodes: 0
Number of Virtual Pad Nodes Supplying Current: 0
Number of Net Wires: 141
Number of Net Vias: 2818
Number of Extracted Resistors: 5345
Number of Extracted Nodes: 4279
Current from Pad Cells:  505.05 mA (100.00%)
Current from Virtual Pad Nodes:    0.00 mA (0.00%)
Maximum IR drop: 186.779 mV at (1129.990 1025.840) (1278.490 1026.640) layer METAL1
Maximum Wire EM: 1.112657e+02 A/cm at (979.830 1419.360) (981.830 1433.060) layer METAL4
Maximum Via EM: 1.090352e+06 A/cm_2 at (221.480 995.600) (231.220 996.400) layer VIA12
The percentage of routing tracks used by the power net for layer metal5: 1.18%
The percentage of routing tracks used by the power net for layer metal4: 1.02%
The percentage of routing tracks used by the power net for layer metal3: 2.08%
The percentage of routing tracks used by the power net for layer metal2: 2.19%
The percentage of routing tracks used by the power net for layer metal1: 5.98%

Net Name: VDD
Number of Pad Cells: 4
Number of Pad Cells Supplying Current: 4
Number of Virtual Pad Nodes: 0
Number of Virtual Pad Nodes Supplying Current: 0
Number of Net Wires: 181
Number of Net Vias: 2827
Number of Extracted Resistors: 5511
Number of Extracted Nodes: 4431
Current from Pad Cells:  505.05 mA (100.00%)
Current from Virtual Pad Nodes:    0.00 mA (0.00%)
Maximum IR drop: 211.155 mV at (1127.390 1030.880) (1275.890 1031.680) layer METAL1
Maximum Wire EM: 1.540487e+02 A/cm at (828.730 1414.320) (830.730 1443.670) layer METAL4
Maximum Via EM: 1.382295e+06 A/cm_2 at (231.950 940.160) (232.330 940.960) layer VIA12
The percentage of routing tracks used by the power net for layer metal5: 1.28%
The percentage of routing tracks used by the power net for layer metal4: 1.11%
The percentage of routing tracks used by the power net for layer metal3: 2.36%
The percentage of routing tracks used by the power net for layer metal2: 2.47%
The percentage of routing tracks used by the power net for layer metal1: 5.95%
PNA is done successfully.
Reading power network analysis highlight file: ./pna_output/idct_chip.VDD.pw_hl.pna ...
Setting the IR threshold of drop ratio display to 0.100 mV
Successfully create error file ./pna_output/VDD.VD.report
Successfully loaded voltage drop map
Report display map data ...
Successfully created the VD report file icc_gui.output
1
icc_shell> save_mw_cel -as 2_2_floorplan_pns
Information: Performing CEL netlist consistency check. (MWDC-118)
Information: CEL consistency check PASSED. (MWDC-119)
Information: Saved design named 2_2_floorplan_pns. (UIG-5)
1
icc_shell> create_fp_placement -timing_driven -no_hierarchy_gravity
CPU time for freeing timing design =    0:00:00
Elapsed time for freeing timing design =    0:00:00
num_cpus = 1
Reference Point: Lower Left-hand corner of Core Base Array
Reference Point: Lower Left-hand corner of Core Base Array
Reference Point: Lower Left-hand corner of Core Base Array
Reference Point: Lower Left-hand corner of Core Base Array
Reference Point: Lower Left-hand corner of Core Base Array
flip_chip = 0
*** Performing global placement...
Transferring Data From Milkyway...
  21 blocks freed
  0 bytes freed
Placement Effort Level: Low
Placement Design Stats
Num std     cells  = 27047 (fixed = 0)
Num macros  cells  = 0 (fixed = 0)
Num IOs     cells  = 59
Num bump    cells  = 0
Num LS/ISO  cells  = 0
Num no type cells  = 0
Num other   cells  = 0
Num cells with no net connections = 256
Num non-zero wt nets = 29260
Num     zero wt nets = 0
A net with highest fanout (33) is inst_idct/inst_s2p1/n313
grouping macros ...
0 macro arrays generated automatically.
0 array cells created
No large HMs were processed
coarse place 0% done.
coarse place 20% done.
coarse place 40% done.
coarse place 60% done.
coarse place 80% done.
coarse place 100% done.
Transferring Data to Milkyway ...
Calculating timing weight ...
Information: linking reference library : /home/student/Desktop/Workspace/SMIC18/mw_lib/smic18_5ml. (PSYN-878)
Information: linking reference library : /home/student/Desktop/Workspace/SMIC18/mw_lib/SP018W_V1p5_5MT. (PSYN-878)
Warning: Could not find valid driver for hierarchical Ground net 'VSS'. (MWDC-285)
Warning: Could not find valid driver for hierarchical Power net 'VDD'. (MWDC-285)

  Linking design 'idct_chip'
  Using the following designs and libraries:
  --------------------------------------------------------------------------
  * (125 designs)             idct_chip.CEL, etc
  slow (library)              /home/student/Desktop/Workspace/SMIC18/db/slow.db
  SP018W_V1p5_max (library)   /home/student/Desktop/Workspace/SMIC18/db/SP018W_V1p5_max.db

Load global CTS reference options from NID to stack
# GUI Debug: Building dc from empty. -- Time: 1sec 411ms
(Running rc extraction with virtual route...)
Information: The design has horizontal rows, and Y-symmetry has been used for sites. (MWDC-217)
Floorplan loading succeeded.

Warning: Cell 'PO8W_dout2' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout3' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout4' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout5' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout6' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout7' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout8' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout9' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout10' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout11' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout12' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout13' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout14' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout15' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout_mode0' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout_mode1' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_clk' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_rstn' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_start' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_mode0' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_mode1' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din0' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din1' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din2' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din3' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din4' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din5' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din6' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din7' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din8' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din9' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din10' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din11' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din12' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din13' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din14' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din15' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout0' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout1' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
  Loading design 'idct_chip'
Warning: Cell 'PO8W_dout2' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout3' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout4' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout5' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout6' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout7' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout8' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout9' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout10' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout11' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout12' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout13' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout14' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout15' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout_mode0' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout_mode1' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_clk' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_rstn' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_start' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_mode0' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_mode1' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din0' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din1' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din2' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din3' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din4' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din5' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din6' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din7' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din8' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din9' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din10' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din11' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din12' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din13' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din14' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din15' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout0' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout1' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)


Information: Setting a dont_touch attribute on net 'din[4]' because it is connected to a pad cell. (PSYN-088)
Information: Setting a dont_touch attribute on net 'din[3]' because it is connected to a pad cell. (PSYN-088)
Information: Setting a dont_touch attribute on net 'din[2]' because it is connected to a pad cell. (PSYN-088)
Information: Setting a dont_touch attribute on net 'din[1]' because it is connected to a pad cell. (PSYN-088)
Information: Setting a dont_touch attribute on net 'din[0]' because it is connected to a pad cell. (PSYN-088)
Information: Setting a dont_touch attribute on net 'mode[1]' because it is connected to a pad cell. (PSYN-088)
Information: Setting a dont_touch attribute on net 'mode[0]' because it is connected to a pad cell. (PSYN-088)
Information: Setting a dont_touch attribute on net 'din[12]' because it is connected to a pad cell. (PSYN-088)
Information: Setting a dont_touch attribute on net 'din[11]' because it is connected to a pad cell. (PSYN-088)
Information: Setting a dont_touch attribute on net 'din[10]' because it is connected to a pad cell. (PSYN-088)
Information: Setting a dont_touch attribute on net 'din[9]' because it is connected to a pad cell. (PSYN-088)
Information: Setting a dont_touch attribute on net 'din[8]' because it is connected to a pad cell. (PSYN-088)
Information: Setting a dont_touch attribute on net 'din[7]' because it is connected to a pad cell. (PSYN-088)
Information: Setting a dont_touch attribute on net 'din[6]' because it is connected to a pad cell. (PSYN-088)
Information: Setting a dont_touch attribute on net 'din[5]' because it is connected to a pad cell. (PSYN-088)
Information: Setting a dont_touch attribute on net 'dout[4]' because it is connected to a pad cell. (PSYN-088)
Information: Setting a dont_touch attribute on net 'dout[3]' because it is connected to a pad cell. (PSYN-088)
Information: Setting a dont_touch attribute on net 'dout[2]' because it is connected to a pad cell. (PSYN-088)
Information: Setting a dont_touch attribute on net 'dout[1]' because it is connected to a pad cell. (PSYN-088)
Information: Setting a dont_touch attribute on net 'dout[0]' because it is connected to a pad cell. (PSYN-088)
Information: Setting a dont_touch attribute on net 'din[15]' because it is connected to a pad cell. (PSYN-088)
Information: Setting a dont_touch attribute on net 'din[14]' because it is connected to a pad cell. (PSYN-088)
Information: Setting a dont_touch attribute on net 'din[13]' because it is connected to a pad cell. (PSYN-088)
Information: Setting a dont_touch attribute on net 'dout[12]' because it is connected to a pad cell. (PSYN-088)
Information: Setting a dont_touch attribute on net 'dout[11]' because it is connected to a pad cell. (PSYN-088)
Information: Setting a dont_touch attribute on net 'dout[10]' because it is connected to a pad cell. (PSYN-088)
Information: Setting a dont_touch attribute on net 'dout[9]' because it is connected to a pad cell. (PSYN-088)
Information: Setting a dont_touch attribute on net 'dout[8]' because it is connected to a pad cell. (PSYN-088)
Information: Setting a dont_touch attribute on net 'dout[7]' because it is connected to a pad cell. (PSYN-088)
Information: Setting a dont_touch attribute on net 'dout[6]' because it is connected to a pad cell. (PSYN-088)
Information: Setting a dont_touch attribute on net 'dout[5]' because it is connected to a pad cell. (PSYN-088)
Information: Setting a dont_touch attribute on net 'start' because it is connected to a pad cell. (PSYN-088)
Information: Setting a dont_touch attribute on net 'rstn' because it is connected to a pad cell. (PSYN-088)
Information: Setting a dont_touch attribute on net 'clk' because it is connected to a pad cell. (PSYN-088)
Information: Setting a dont_touch attribute on net 'dout_mode[1]' because it is connected to a pad cell. (PSYN-088)
Information: Setting a dont_touch attribute on net 'dout_mode[0]' because it is connected to a pad cell. (PSYN-088)
Information: Setting a dont_touch attribute on net 'dout[15]' because it is connected to a pad cell. (PSYN-088)
Information: Setting a dont_touch attribute on net 'dout[14]' because it is connected to a pad cell. (PSYN-088)
Information: Setting a dont_touch attribute on net 'dout[13]' because it is connected to a pad cell. (PSYN-088)


Information: Library Manufacturing Grid(GridResolution) : 5
Information: Time Unit from Milkyway design library: 'ns' 
Information: Design Library and main library timing units are matched - 1.000 ns. 
Information: Resistance Unit from Milkyway design library: 'kohm' 
Information: Design Library and main library resistance units are matched - 1.000 kohm. 
Information: Capacitance Unit from Milkyway design library: 'pf' 
Information: Design Library and main library capacitance units are matched - 1.000 pf. 
****************************************************************
Information: TLUPlus based RC computation is enabled. (RCEX-141)
****************************************************************
Information: The distance unit in Capacitance and Resistance is 1 micron. (RCEX-007)
Information: The RC model used is TLU+. (RCEX-015)
Information: Library Derived Cap for layer METAL1 : 0.00022 0.0002 (RCEX-011)
Information: Library Derived Res for layer METAL1 : 0.00044 0.00024 (RCEX-011)
Information: Library Derived Cap for layer METAL2 : 0.00021 0.00019 (RCEX-011)
Information: Library Derived Res for layer METAL2 : 0.00036 0.0002 (RCEX-011)
Information: Library Derived Cap for layer METAL3 : 0.00025 0.00023 (RCEX-011)
Information: Library Derived Res for layer METAL3 : 0.00036 0.0002 (RCEX-011)
Information: Library Derived Cap for layer METAL4 : 0.00021 0.00019 (RCEX-011)
Information: Library Derived Res for layer METAL4 : 0.00036 0.0002 (RCEX-011)
Information: Library Derived Cap for layer METAL5 : 0.00028 0.00026 (RCEX-011)
Information: Library Derived Res for layer METAL5 : 0.0001 6.1e-05 (RCEX-011)
Information: Library Derived Horizontal Cap : 0.00025 0.00023 (RCEX-011)
Information: Library Derived Horizontal Res : 0.0003 0.00017 (RCEX-011)
Information: Library Derived Vertical Cap : 0.00021 0.00019 (RCEX-011)
Information: Library Derived Vertical Res : 0.00036 0.0002 (RCEX-011)
Information: Using derived R and C coefficients. (RCEX-008)
Information: Using region-based R and C coefficients. (RCEX-013)
Information: Library Derived Via Res : 0.0095 0.001 (RCEX-011)
....................................................................................................................................................................................................................................................................................................
29258 nets processed. 
Router succeeded.
Warning: Cell 'PO8W_dout2' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout3' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout4' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout5' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout6' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout7' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout8' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout9' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout10' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout11' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout12' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout13' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout14' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout15' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout_mode0' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout_mode1' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_clk' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_rstn' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_start' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_mode0' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_mode1' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din0' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din1' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din2' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din3' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din4' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din5' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din6' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din7' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din8' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din9' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din10' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din11' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din12' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din13' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din14' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PIW_din15' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout0' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
Warning: Cell 'PO8W_dout1' is being marked as "dont_touch" because it has 
        a fixed_placement attribute. (PSYN-040)
rc extraction finished.
CPU time for rc extraction =    0:00:03
Elapsed time for rc extraction =    0:00:04
Warning: High fanout net synthesis has not performed on the design yet. (VFP-432)
Information: Updating design information... (UID-85)
Warning: Design 'idct_chip' contains 2 high-fanout nets. A fanout number of 1000 will be used for delay calculations involving these nets. (TIM-134)
Information: Timing loop detected. (OPT-150)
        inst_idct/inst_p2s2/U4/A inst_idct/inst_p2s2/U4/Y 
Information: Timing loop detected. (OPT-150)
        inst_idct/inst_p2s2/U5/A1N inst_idct/inst_p2s2/U5/Y 
Warning: Disabling timing arc between pins 'A' and 'Y' on cell 'inst_idct/inst_p2s2/U4'
         to break a timing loop. (OPT-314)
Warning: Disabling timing arc between pins 'A1N' and 'Y' on cell 'inst_idct/inst_p2s2/U5'
         to break a timing loop. (OPT-314)
Warning: Disabling timing arc between pins 'A' and 'Y' on cell 'inst_idct/inst_p2s1/U4'
         to break a timing loop. (OPT-314)
Warning: Disabling timing arc between pins 'A1N' and 'Y' on cell 'inst_idct/inst_p2s1/U5'
         to break a timing loop. (OPT-314)
Warning: Disabling timing arc between pins 'AN' and 'Y' on cell 'inst_idct/idct_cal_col/U5'
         to break a timing loop. (OPT-314)
Warning: Disabling timing arc between pins 'B1' and 'Y' on cell 'inst_idct/idct_cal_col/U4'
         to break a timing loop. (OPT-314)
Warning: Disabling timing arc between pins 'A1N' and 'Y' on cell 'inst_idct/inst_s2p1/U4'
         to break a timing loop. (OPT-314)
Warning: Disabling timing arc between pins 'A1N' and 'Y' on cell 'inst_idct/inst_s2p1/U3'
         to break a timing loop. (OPT-314)
Warning: Disabling timing arc between pins 'AN' and 'Y' on cell 'inst_idct/idct_cal_row/U5'
         to break a timing loop. (OPT-314)
Warning: Disabling timing arc between pins 'B1' and 'Y' on cell 'inst_idct/idct_cal_row/U4'
         to break a timing loop. (OPT-314)
Warning: Disabling timing arc between pins 'A1N' and 'Y' on cell 'inst_idct/inst_s2p2/U4'
         to break a timing loop. (OPT-314)
Warning: Disabling timing arc between pins 'A1N' and 'Y' on cell 'inst_idct/inst_s2p2/U3'
         to break a timing loop. (OPT-314)

  Timing Path Group 'INPUTS'
  -----------------------------------
  Levels of Logic:               7.00
  Critical Path Length:          6.58
  Critical Path Slack:          12.32
  Critical Path Clk Period:     20.00
  Total Negative Slack:          0.00
  No. of Violating Paths:        0.00
  Worst Hold Violation:          0.00
  Total Hold Violation:          0.00
  No. of Hold Violations:        0.00
  -----------------------------------

  Timing Path Group 'OUTPUTS'
  -----------------------------------
  Levels of Logic:               1.00
  Critical Path Length:          4.51
  Critical Path Slack:          14.79
  Critical Path Clk Period:     20.00
  Total Negative Slack:          0.00
  No. of Violating Paths:        0.00
  Worst Hold Violation:          0.00
  Total Hold Violation:          0.00
  No. of Hold Violations:        0.00
  -----------------------------------

  Timing Path Group 'clk'
  -----------------------------------
  Levels of Logic:              11.00
  Critical Path Length:         12.10
  Critical Path Slack:           7.29
  Critical Path Clk Period:     20.00
  Total Negative Slack:          0.00
  No. of Violating Paths:        0.00
  Worst Hold Violation:         -0.04
  Total Hold Violation:         -3.55
  No. of Hold Violations:      141.00
  -----------------------------------


  Cell Count
  -----------------------------------
  Hierarchical Cell Count:        124
  Hierarchical Port Count:      11340
  Leaf Cell Count:              27086
  Buf/Inv Cell Count:            4742
  CT Buf/Inv Cell Count:            0
  -----------------------------------


  Area
  -----------------------------------
  Combinational Area:      1089157.21
  Noncombinational Area:    651355.70
  Net Area:                      0.00
  Net XLength        :      781995.75
  Net YLength        :      711033.94
  -----------------------------------
  Cell Area:               1740512.90
  Design Area:             1740512.90
  Net Length        :      1493029.75


  Design Rules
  -----------------------------------
  Total Number of Nets:         29921
  Nets With Violations:           226
  Max Trans Violations:           224
  -----------------------------------

CPU time for timing report =    0:00:01
Elapsed time for timing report =    0:00:01
Info: worst slack in the design is 7.290977
CPU time for freeing timing design =    0:00:01
Elapsed time for freeing timing design =    0:00:02
No timing violation found. Will not run timing-driven placement.
Reference Point: Lower Left-hand corner of Core Base Array
  31 blocks freed
  0 bytes freed
*********************************************
Report     : Virtual Flat Placement
Design     : idct_chip
Version    : D-2010.03-ICC-SP5-2
Date       : Fri Apr 17 15:19:29 2020
*********************************************

Total wirelength: 1272538.75
Number of 100x100 tracks cell density regions: 441
Number of low (< 10%) cell density regions: 0 (0.000%)
Number of high (> 200%) cell density regions: 0 (0.000%)
Maximum cell density: 82.96% (at 293 561 347 615)
Checking hard macro to hard macro overlaps...
Number of hard macro to hard macro overlaps: 0
Checking hard macro to std cell overlaps...
Number of hard macro to std cell overlaps: 0
Checking plan group to plan group overlaps...
Number of plan group to plan group overlaps: 0
Number of TL cells overlapping PG: 0
Number of cells violating core area: 0
Total number of cells violating plan group or core area: 0
*** global placement done.
Begin Overlap Removal Input Checking ...
Reference Point: Lower Left-hand corner of Core Base Array
  31 blocks freed
  0 bytes freed
Checking successful.
End Overlap Removal Input Checking
Begin Overlap Removal...
Reference Point: Lower Left-hand corner of Core Base Array
*********************************
 Fri Apr 17 15:19:30 2020
*********************************

=== Place ECO Design ===

Initializing Data Structure ...
  Reading technology information ...
    Technology table contains 5 routable metal layers
    This is considered as a 5-metal-layer design
    Reading library information from DB ...
    Speed = medium
    Flow Control = 1stCut(auto)
    Flow Control = 2ndCut(auto)
    Location Constraint = seePGrPGsPGpCKrCKsPHx
  Reading netlist information from DB ...
    59 IO pads and 39 IO pins
    27047 placeable cells
    0 cover cells
    98 IO cells/pins
    27145 cell instances
    29681 nets
  Sorting cells, nets, pins ...
    net pin threshold = 33
  Reading misc information ...
    array <unit> has 0 vertical and 234 horizontal rows
    region mode: (opt netlist) free-style
    4 hard placement blockages
    62 pre-routes for placement blockage/checking
    5967 pre-routes for map congestion calculation
    No cell region in data base
    No plan group found in data base
    All region and plan group constraints are ignored
    941 nets have positive weight
    average positive net weight (>=2) = 2.0
    positive net weight range = [2, 3]
    standard deviation of net weight = 0.05
    1 net(s) treated as CLOCK for clustering
    1 clock nets, 9055 clocked instances (33.48%)
    Auto Set : first cut = horizontal
  Checking information read in ...
    design style = Horizontal masters, Horizontal rows
  Preprocessing design ...
    splitting rows by natural obstacles ...
        Unit Tile        Demand      Available
             unit      336121       419094
    calculating design statistics ...
    Auto Set : first cut = horizontal
    split into 234 row segments
    RowArea1 = total row area = 1394074.28 micron^2
    RowArea2 = RowArea1 - macros = 1394074.28 micron^2
    RowArea3 = RowArea2 - fixed standard cells = 1394074.28 micron^2
    RowArea4 = RowArea3 - hard blockages and preroutes = 1394074.28 micron^2
    RowArea5 = RowArea4 - IO pads and FC drivers = 1394074.28 micron^2
    RowArea6 = RowArea5 - soft blockages = 1394074.28 micron^2
    RowArea7 = RowArea6 - misc unusable area = 1394074.28 micron^2
    27047 placeable standard cells in 1118072.89 micron^2
    98 IO pads cells/pins in 1054199.54 micron^2
    cell/row utilization of array <unit> = 80.20%
    max local area utilization set to be 95.00%
    Initialization Time: 0 seconds.
    PR summary UTIL CHECKPOINT #2565

Starting ECO Placement ...
    no cell outside core area to be placed
    At least 1000 cells overlap in focus area
    Constructing block tree ...
        [1][2][3][4][5][6][7][8][9][10][11][12][13]
        Block Tree Time: 0 seconds
Before Overlap Removal:
        horizontal bboxLength = 649216 (micron)
        vertical   bboxLength = 566110 (micron)
        total      bboxLength = 1215326 (micron)
        average length per net = 40.95 (micron)
    27023 off-row cell instance(s) for local search ...
    25475 instance(s) placed successfully
after local window search:
        horizontal bboxLength = 658404 (micron)
        vertical   bboxLength = 589775 (micron)
        total      bboxLength = 1248178 (micron)
        average length per net = 42.05 (micron)
    Global Placement Time:      0 seconds.

Starting Area-based Overlap Removal ...
    reason: 
    Removing std cell overlaps ...
        [0%] [10%] [20%] [30%] [40%] [50%] [60%] [70%] [80%] [90%] [100%]
    cell overlaps dropped from 2629 down to 0
      placement of 15050 cells are changed (3062 moved, 13552 rotated)
    overlaps removal finished
    Overlap Removal Time:       0 seconds.

Starting Detailed Optimization ...
    27047 cell instances are ECO movable
        horizontal bboxLength (wireLength) = 666808 (794057) (micron)
        vertical   bboxLength (wireLength) = 605891 (748350) (micron)
        total      bboxLength (wireLength) = 1272699 (1542407) (micron)
        average length per net = 42.88 (51.97) (micron)
        Weighted Improvement (F) = 21310.08
        Weighted Improvement (S-II) = 0.00
        Weighted Improvement (F) = 1146.59
        Weighted Improvement (S-II) = 0.00
    Removing std cell overlaps ...
        [0%] [10%] [20%] [30%] [40%] [50%] [60%] [70%] [80%] [90%] [100%]
    cell overlaps dropped from 0 down to 0
        Weighted Improvement (F) = 2.92
        Total Weighted Improvement (F) = 22459.58
        Total Weighted Improvement (M) = 0.00
        Total Weighted Improvement (S-I) = 0.00
        Total Weighted Improvement (S-II) = 0.00
        Total Weighted Improvement (all)  = 22459.58
    Detailed Placement Time:    0 seconds.

Writing Cell Placement ...
ECO report: Placement of 27047 cells in core area are changed
            27047 cells moved, 17158 cells rotated
            max displaced cell instance = inst_idct/idct_cal_col/idct8_cal/x4_89_tmp1_reg_12_
            Total movement: manhattan(totalX, totalY) 110555(45951, 64604) (micron)
            Max displacement: manhattan: 107, X: 68, Y: 83.
            Average displacement: (against all cells)4.1, (against moved cells)4.1
    DB Update Time:     0 seconds.

Reporting placement quality ...
    >>>>> Placement Quality Report <<<<<
        @@@ horizontal bboxLength (wireLength) = 645307 (771598) (micron)
        @@@ vertical   bboxLength (wireLength) = 605891 (748350) (micron)
        @@@ total      bboxLength (wireLength) = 1251198 (1519947) (micron)
        @@@ average length per net = 42.15 (51.21) (micron)
        No placement map created
    >>>>> End of Report <<<<<
    Placement Report Time:      0 seconds.

@@@ Total CPU     Time =    0:00:00
@@@ Total Elapsed Time =    0:00:00
@@@ Peak  Memory  Used =    0.00M bytes

=== End of ECO Place ===
Completed Overlap Removal.
1
icc_shell> route_zrt_global
Start Global Route ... 
[Init] Elapsed real time: 0:00:00 
[Init] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[Init] Stage (MB): Used    0  Alloctr    0  Proc    0 
[Init] Total (MB): Used    0  Alloctr    0  Proc  854 
Printing options for 'set_route_zrt_common_options'

Printing options for 'set_route_zrt_global_options'

Begin global routing.
Turn off antenna since no rule is specified
Cell Min-Routing-Layer = METAL1
Cell Max-Routing-Layer = METAL5
Warning: BPV on 7 macros were done with "treat blockage as thin". (ZRT-023)
Current Stage stats:
[End of Read DB] Elapsed real time: 0:00:00 
[End of Read DB] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Read DB] Stage (MB): Used   33  Alloctr   33  Proc    0 
[End of Read DB] Total (MB): Used   33  Alloctr   34  Proc  854 
Constructing data structure ...
Design statistics:
Design Bounding Box (0.00,0.00,1662.06,1659.36)
Number of routing layers = 5
layer METAL1, dir Hor, min width = 0.23, min space = 0.23 pitch = 0.56
layer METAL2, dir Ver, min width = 0.28, min space = 0.28 pitch = 0.66
layer METAL3, dir Hor, min width = 0.28, min space = 0.28 pitch = 0.56
layer METAL4, dir Ver, min width = 0.28, min space = 0.28 pitch = 0.66
layer METAL5, dir Hor, min width = 0.44, min space = 0.46 pitch = 0.95
Current Stage stats:
[End of Build Tech Data] Elapsed real time: 0:00:00 
[End of Build Tech Data] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build Tech Data] Stage (MB): Used    2  Alloctr    2  Proc    0 
[End of Build Tech Data] Total (MB): Used   35  Alloctr   36  Proc  854 
Net statistics:
Total number of nets     = 29681
Number of nets to route  = 29225
Number of single or zero port nets = 417
39 nets are fully connected,
 of which 39 are detail routed and 0 are global routed.
Current Stage stats:
[End of Build All Nets] Elapsed real time: 0:00:00 
[End of Build All Nets] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build All Nets] Stage (MB): Used    7  Alloctr    7  Proc    0 
[End of Build All Nets] Total (MB): Used   43  Alloctr   43  Proc  854 
Average gCell capacity  1.29     on layer (1)    METAL1
Average gCell capacity  4.58     on layer (2)    METAL2
Average gCell capacity  5.46     on layer (3)    METAL3
Average gCell capacity  4.67     on layer (4)    METAL4
Average gCell capacity  3.21     on layer (5)    METAL5
Average number of tracks per gCell 8.98  on layer (1)    METAL1
Average number of tracks per gCell 7.63  on layer (2)    METAL2
Average number of tracks per gCell 8.98  on layer (3)    METAL3
Average number of tracks per gCell 7.63  on layer (4)    METAL4
Average number of tracks per gCell 5.29  on layer (5)    METAL5
Number of gCells = 544500
Current Stage stats:
[End of Build Congestion map] Elapsed real time: 0:00:01 
[End of Build Congestion map] Elapsed cpu  time: sys=0:00:00 usr=0:00:01 total=0:00:01
[End of Build Congestion map] Stage (MB): Used    0  Alloctr    1  Proc   70 
[End of Build Congestion map] Total (MB): Used   44  Alloctr   45  Proc  924 
Total stats:
[End of Build Data] Elapsed real time: 0:00:01 
[End of Build Data] Elapsed cpu  time: sys=0:00:00 usr=0:00:01 total=0:00:01
[End of Build Data] Stage (MB): Used   10  Alloctr   11  Proc   70 
[End of Build Data] Total (MB): Used   44  Alloctr   45  Proc  924 
Information: Using 1 threads for routing. (ZRT-444)

Start GR phase 0
Current Stage stats:
[End of Initial Routing] Elapsed real time: 0:00:01 
[End of Initial Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:01 total=0:00:01
[End of Initial Routing] Stage (MB): Used   17  Alloctr   17  Proc    0 
[End of Initial Routing] Total (MB): Used   61  Alloctr   62  Proc  924 
Initial. Routing result:
Initial. Both Dirs: Overflow =   899 Max = 4 GRCs =  1778 (0.81%)
Initial. H routing: Overflow =   455 Max = 4 (GRCs =  2) GRCs =   945 (0.86%)
Initial. V routing: Overflow =   444 Max = 2 (GRCs = 16) GRCs =   833 (0.76%)
Initial. METAL1     Overflow =   106 Max = 2 (GRCs =  1) GRCs =   118 (0.11%)
Initial. METAL2     Overflow =   417 Max = 2 (GRCs = 14) GRCs =   764 (0.70%)
Initial. METAL3     Overflow =   349 Max = 4 (GRCs =  2) GRCs =   827 (0.75%)
Initial. METAL4     Overflow =    27 Max = 2 (GRCs =  2) GRCs =    69 (0.06%)
Initial. METAL5     Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)

Initial. Total Wire Length = 1660849.00
Initial. Layer METAL1 wire length = 5601.77
Initial. Layer METAL2 wire length = 570627.56
Initial. Layer METAL3 wire length = 797576.75
Initial. Layer METAL4 wire length = 255322.17
Initial. Layer METAL5 wire length = 31720.84
Initial. Total Number of Contacts = 210582
Initial. Via via1 count = 104867
Initial. Via via2 count = 92952
Initial. Via via3 count = 11952
Initial. Via via4 count = 811
Initial. completed.

Start GR phase 1
Current Stage stats:
[End of Phase1 Routing] Elapsed real time: 0:00:00 
[End of Phase1 Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Phase1 Routing] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Phase1 Routing] Total (MB): Used   62  Alloctr   63  Proc  924 
phase1. Routing result:
phase1. Both Dirs: Overflow =   260 Max = 2 GRCs =   439 (0.20%)
phase1. H routing: Overflow =    40 Max = 1 (GRCs = 25) GRCs =    66 (0.06%)
phase1. V routing: Overflow =   220 Max = 2 (GRCs = 11) GRCs =   373 (0.34%)
phase1. METAL1     Overflow =    37 Max = 1 (GRCs = 24) GRCs =    50 (0.05%)
phase1. METAL2     Overflow =   220 Max = 2 (GRCs = 11) GRCs =   372 (0.34%)
phase1. METAL3     Overflow =     3 Max = 1 (GRCs =  1) GRCs =    16 (0.01%)
phase1. METAL4     Overflow =     0 Max = 0 (GRCs =  1) GRCs =     1 (0.00%)
phase1. METAL5     Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)

phase1. Total Wire Length = 1663818.38
phase1. Layer METAL1 wire length = 5356.68
phase1. Layer METAL2 wire length = 564990.88
phase1. Layer METAL3 wire length = 786870.75
phase1. Layer METAL4 wire length = 262782.69
phase1. Layer METAL5 wire length = 43817.42
phase1. Total Number of Contacts = 212075
phase1. Via via1 count = 104800
phase1. Via via2 count = 93032
phase1. Via via3 count = 12868
phase1. Via via4 count = 1375
phase1. completed.

Start GR phase 2
Current Stage stats:
[End of Phase2 Routing] Elapsed real time: 0:00:00 
[End of Phase2 Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Phase2 Routing] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Phase2 Routing] Total (MB): Used   62  Alloctr   62  Proc  924 
phase2. Routing result:
phase2. Both Dirs: Overflow =    94 Max = 2 GRCs =   121 (0.06%)
phase2. H routing: Overflow =    28 Max = 1 (GRCs = 18) GRCs =    39 (0.04%)
phase2. V routing: Overflow =    65 Max = 2 (GRCs =  4) GRCs =    82 (0.07%)
phase2. METAL1     Overflow =    28 Max = 1 (GRCs = 18) GRCs =    39 (0.04%)
phase2. METAL2     Overflow =    65 Max = 2 (GRCs =  4) GRCs =    82 (0.07%)
phase2. METAL3     Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase2. METAL4     Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase2. METAL5     Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)

phase2. Total Wire Length = 1663775.62
phase2. Layer METAL1 wire length = 5333.54
phase2. Layer METAL2 wire length = 565135.25
phase2. Layer METAL3 wire length = 786903.38
phase2. Layer METAL4 wire length = 262603.72
phase2. Layer METAL5 wire length = 43799.65
phase2. Total Number of Contacts = 212068
phase2. Via via1 count = 104797
phase2. Via via2 count = 93034
phase2. Via via3 count = 12862
phase2. Via via4 count = 1375
phase2. completed.

Start GR phase 3
Current Stage stats:
[End of Phase3 Routing] Elapsed real time: 0:00:00 
[End of Phase3 Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Phase3 Routing] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Phase3 Routing] Total (MB): Used   62  Alloctr   62  Proc  924 
phase3. Routing result:
phase3. Both Dirs: Overflow =    93 Max = 2 GRCs =   119 (0.05%)
phase3. H routing: Overflow =    28 Max = 1 (GRCs = 18) GRCs =    39 (0.04%)
phase3. V routing: Overflow =    65 Max = 2 (GRCs =  4) GRCs =    80 (0.07%)
phase3. METAL1     Overflow =    28 Max = 1 (GRCs = 18) GRCs =    39 (0.04%)
phase3. METAL2     Overflow =    65 Max = 2 (GRCs =  4) GRCs =    80 (0.07%)
phase3. METAL3     Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase3. METAL4     Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase3. METAL5     Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)

phase3. Total Wire Length = 1663775.62
phase3. Layer METAL1 wire length = 5333.54
phase3. Layer METAL2 wire length = 565135.25
phase3. Layer METAL3 wire length = 786903.38
phase3. Layer METAL4 wire length = 262603.72
phase3. Layer METAL5 wire length = 43799.65
phase3. Total Number of Contacts = 212070
phase3. Via via1 count = 104797
phase3. Via via2 count = 93036
phase3. Via via3 count = 12862
phase3. Via via4 count = 1375
phase3. completed.
[End of Whole Chip Routing] Elapsed real time: 0:00:04 
[End of Whole Chip Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:04 total=0:00:04
[End of Whole Chip Routing] Stage (MB): Used   28  Alloctr   28  Proc   70 
[End of Whole Chip Routing] Total (MB): Used   62  Alloctr   62  Proc  924 

Information: Global Routing terminated early: false (ZRT-103)

Congestion utilization per direction:
Average vertical track utilization   = 22.55 %
Peak    vertical track utilization   = 150.00 %
Average horizontal track utilization = 19.36 %
Peak    horizontal track utilization = 100.00 %

Current Stage stats:
[GR: Done] Elapsed real time: 0:00:00 
[GR: Done] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[GR: Done] Stage (MB): Used   -2  Alloctr   -2  Proc    0 
[GR: Done] Total (MB): Used   61  Alloctr   63  Proc  924 
GR Total stats:
[GR: Done] Elapsed real time: 0:00:05 
[GR: Done] Elapsed cpu  time: sys=0:00:00 usr=0:00:04 total=0:00:05
[GR: Done] Stage (MB): Used   61  Alloctr   62  Proc   70 
[GR: Done] Total (MB): Used   61  Alloctr   63  Proc  924 
Updating the database ...
Final total stats:
[End of Global Routing] Elapsed real time: 0:00:05 
[End of Global Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:05 total=0:00:05
[End of Global Routing] Stage (MB): Used    0  Alloctr    0  Proc   70 
[End of Global Routing] Total (MB): Used    0  Alloctr    1  Proc  924 
Information: RC extraction has been freed. (PSYN-503)
1
icc_shell> 
Information: linking reference library : /home/student/Desktop/Workspace/SMIC18/mw_lib/smic18_5ml. (PSYN-878)
Information: linking reference library : /home/student/Desktop/Workspace/SMIC18/mw_lib/SP018W_V1p5_5MT. (PSYN-878)
Warning: Could not find valid driver for hierarchical Ground net 'VSS'. (MWDC-285)
Warning: Could not find valid driver for hierarchical Power net 'VDD'. (MWDC-285)

  Linking design 'idct_chip'
  Using the following designs and libraries:
  --------------------------------------------------------------------------
  * (125 designs)             idct_chip.CEL, etc
  slow (library)              /home/student/Desktop/Workspace/SMIC18/db/slow.db
  SP018W_V1p5_max (library)   /home/student/Desktop/Workspace/SMIC18/db/SP018W_V1p5_max.db

Load global CTS reference options from NID to stack
# GUI Debug: Building dc from empty. -- Time: 1sec 634ms
Information: The design has horizontal rows, and Y-symmetry has been used for sites. (MWDC-217)
Floorplan loading succeeded.
[begin initializing data for legality checker]
Initializing Data Structure ...
  Reading technology information ...
    Technology table contains 5 routable metal layers
    This is considered as a 5-metal-layer design
    Reading library information from DB ...
  Reading misc information ...
    array <unit> has 0 vertical and 234 horizontal rows
    62 pre-routes for placement blockage/checking
    5967 pre-routes for map congestion calculation
  Checking information read in ...
    design style = Horizontal masters, Horizontal rows
  Preprocessing design ...
    splitting rows by natural obstacles ...
[end initializing data for legality checker]
Running global router for congestion map ...
Start Global Route ... 
[Init] Elapsed real time: 0:00:00 
[Init] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[Init] Stage (MB): Used    0  Alloctr    0  Proc    0 
[Init] Total (MB): Used    0  Alloctr    1  Proc  924 
Printing options for 'set_route_zrt_common_options'

Printing options for 'set_route_zrt_global_options'

Begin global routing.
Turn off antenna since no rule is specified
Cell Min-Routing-Layer = METAL1
Cell Max-Routing-Layer = METAL5
Warning: BPV on 7 macros were done with "treat blockage as thin". (ZRT-023)
Current Stage stats:
[End of Read DB] Elapsed real time: 0:00:01 
[End of Read DB] Elapsed cpu  time: sys=0:00:00 usr=0:00:01 total=0:00:01
[End of Read DB] Stage (MB): Used   51  Alloctr   52  Proc    5 
[End of Read DB] Total (MB): Used   52  Alloctr   53  Proc  929 
Constructing data structure ...
Design statistics:
Design Bounding Box (0.00,0.00,1662.06,1659.36)
Number of routing layers = 5
layer METAL1, dir Hor, min width = 0.23, min space = 0.23 pitch = 0.56
layer METAL2, dir Ver, min width = 0.28, min space = 0.28 pitch = 0.66
layer METAL3, dir Hor, min width = 0.28, min space = 0.28 pitch = 0.56
layer METAL4, dir Ver, min width = 0.28, min space = 0.28 pitch = 0.66
layer METAL5, dir Hor, min width = 0.44, min space = 0.46 pitch = 0.95
Current Stage stats:
[End of Build Tech Data] Elapsed real time: 0:00:00 
[End of Build Tech Data] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build Tech Data] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Build Tech Data] Total (MB): Used   52  Alloctr   54  Proc  929 
Net statistics:
Total number of nets     = 29681
Number of nets to route  = 29225
Number of single or zero port nets = 417
29264 nets are fully connected,
 of which 39 are detail routed and 29225 are global routed.
Information: 29225 of the existing global routes are deleted. (ZRT-102)
Current Stage stats:
[End of Build All Nets] Elapsed real time: 0:00:00 
[End of Build All Nets] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build All Nets] Stage (MB): Used   -9  Alloctr    0  Proc    0 
[End of Build All Nets] Total (MB): Used   43  Alloctr   53  Proc  929 
Average gCell capacity  1.99     on layer (1)    METAL1
Average gCell capacity  9.18     on layer (2)    METAL2
Average gCell capacity  10.89    on layer (3)    METAL3
Average gCell capacity  9.35     on layer (4)    METAL4
Average gCell capacity  6.42     on layer (5)    METAL5
Average number of tracks per gCell 17.96         on layer (1)    METAL1
Average number of tracks per gCell 15.36         on layer (2)    METAL2
Average number of tracks per gCell 17.96         on layer (3)    METAL3
Average number of tracks per gCell 15.36         on layer (4)    METAL4
Average number of tracks per gCell 10.59         on layer (5)    METAL5
Number of gCells = 135300
Current Stage stats:
[End of Build Congestion map] Elapsed real time: 0:00:01 
[End of Build Congestion map] Elapsed cpu  time: sys=0:00:00 usr=0:00:01 total=0:00:01
[End of Build Congestion map] Stage (MB): Used    0  Alloctr    0  Proc   70 
[End of Build Congestion map] Total (MB): Used   43  Alloctr   53  Proc  999 
Total stats:
[End of Build Data] Elapsed real time: 0:00:01 
[End of Build Data] Elapsed cpu  time: sys=0:00:00 usr=0:00:01 total=0:00:01
[End of Build Data] Stage (MB): Used   -8  Alloctr    0  Proc   70 
[End of Build Data] Total (MB): Used   43  Alloctr   53  Proc  999 
Information: Using 1 threads for routing. (ZRT-444)

Start GR phase 0
Current Stage stats:
[End of Initial Routing] Elapsed real time: 0:00:01 
[End of Initial Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:01 total=0:00:01
[End of Initial Routing] Stage (MB): Used   14  Alloctr    5  Proc    0 
[End of Initial Routing] Total (MB): Used   58  Alloctr   59  Proc  999 
Initial. Routing result:
Initial. Both Dirs: Overflow =  3205 Max = 13 GRCs =  2136 (3.90%)
Initial. H routing: Overflow =   923 Max = 7 (GRCs =  6) GRCs =   588 (2.15%)
Initial. V routing: Overflow =  2282 Max = 13 (GRCs =  1) GRCs =  1548 (5.65%)
Initial. METAL1     Overflow =    51 Max = 1 (GRCs = 46) GRCs =    56 (0.20%)
Initial. METAL2     Overflow =  2259 Max = 13 (GRCs =  1) GRCs =  1521 (5.55%)
Initial. METAL3     Overflow =   872 Max = 7 (GRCs =  6) GRCs =   532 (1.94%)
Initial. METAL4     Overflow =    22 Max = 2 (GRCs =  5) GRCs =    27 (0.10%)
Initial. METAL5     Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)

Initial. Total Wire Length = 1579765.62
Initial. Layer METAL1 wire length = 3148.89
Initial. Layer METAL2 wire length = 599098.31
Initial. Layer METAL3 wire length = 769391.12
Initial. Layer METAL4 wire length = 192336.20
Initial. Layer METAL5 wire length = 15791.14
Initial. Total Number of Contacts = 167599
Initial. Via via1 count = 89653
Initial. Via via2 count = 69007
Initial. Via via3 count = 8524
Initial. Via via4 count = 415
Initial. completed.

Start GR phase 1
Current Stage stats:
[End of Phase1 Routing] Elapsed real time: 0:00:00 
[End of Phase1 Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Phase1 Routing] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Phase1 Routing] Total (MB): Used   58  Alloctr   59  Proc  999 
phase1. Routing result:
phase1. Both Dirs: Overflow =  1403 Max = 13 GRCs =   760 (1.39%)
phase1. H routing: Overflow =    34 Max = 1 (GRCs = 20) GRCs =    49 (0.18%)
phase1. V routing: Overflow =  1368 Max = 13 (GRCs =  1) GRCs =   711 (2.60%)
phase1. METAL1     Overflow =    19 Max = 1 (GRCs = 14) GRCs =    24 (0.09%)
phase1. METAL2     Overflow =  1368 Max = 13 (GRCs =  1) GRCs =   709 (2.59%)
phase1. METAL3     Overflow =    15 Max = 1 (GRCs =  6) GRCs =    25 (0.09%)
phase1. METAL4     Overflow =     0 Max = 0 (GRCs =  2) GRCs =     2 (0.01%)
phase1. METAL5     Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)

phase1. Total Wire Length = 1585494.00
phase1. Layer METAL1 wire length = 2994.72
phase1. Layer METAL2 wire length = 570350.44
phase1. Layer METAL3 wire length = 752138.75
phase1. Layer METAL4 wire length = 224191.95
phase1. Layer METAL5 wire length = 35817.98
phase1. Total Number of Contacts = 169976
phase1. Via via1 count = 89617
phase1. Via via2 count = 68897
phase1. Via via3 count = 10220
phase1. Via via4 count = 1242
phase1. completed.
[End of Whole Chip Routing] Elapsed real time: 0:00:03 
[End of Whole Chip Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:02 total=0:00:03
[End of Whole Chip Routing] Stage (MB): Used    6  Alloctr    6  Proc   70 
[End of Whole Chip Routing] Total (MB): Used   58  Alloctr   59  Proc  999 

Information: Global Routing terminated early: false (ZRT-103)

Congestion utilization per direction:
Average vertical track utilization   = 31.71 %
Peak    vertical track utilization   = 164.29 %
Average horizontal track utilization = 21.98 %
Peak    horizontal track utilization = 100.00 %

Current Stage stats:
[GR: Done] Elapsed real time: 0:00:00 
[GR: Done] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[GR: Done] Stage (MB): Used    0  Alloctr    0  Proc    0 
[GR: Done] Total (MB): Used   58  Alloctr   59  Proc  999 
GR Total stats:
[GR: Done] Elapsed real time: 0:00:04 
[GR: Done] Elapsed cpu  time: sys=0:00:00 usr=0:00:04 total=0:00:04
[GR: Done] Stage (MB): Used   58  Alloctr   58  Proc   75 
[GR: Done] Total (MB): Used   58  Alloctr   59  Proc  999 
Writing out congestion map...
Updating congestion ...
[DBOUT] Elapsed real time: 0:00:00 
[DBOUT] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[DBOUT] Stage (MB): Used  -50  Alloctr  -54  Proc    0 
[DBOUT] Total (MB): Used    0  Alloctr    1  Proc  999 
Final total stats:
[End of Global Routing] Elapsed real time: 0:00:04 
[End of Global Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:04 total=0:00:04
[End of Global Routing] Stage (MB): Used    0  Alloctr    0  Proc   75 
[End of Global Routing] Total (MB): Used    0  Alloctr    1  Proc  999 

Information: Reporting global route congestion data from Milkyway...

++++++++++++++++++++++++++++++++++++++++++++++++
Layer METAL1 Congestion Map Data:
++++++++++++++++++++++++++++++++++++++++++++++++
There are 27060 GRCs (Global Route Cell) in this design
****************************************************************
****************** GRC based congestion report *****************
****************************************************************
  14 GRCs with overflow: 14 with H overflow and 0 with V overflow

++++++++ Top 10 congested GRCs ++++++++
 GRC {940560 300480 950640 310560}: H routing capacity/demand =  0/1 (occupy rate = inf), V routing capacity/demand =  0/0 (occupy rate = inf) with overflow 1
 GRC {1232880 744000 1242960 754080}: H routing capacity/demand =  0/1 (occupy rate = inf), V routing capacity/demand =  0/0 (occupy rate = inf) with overflow 1
 GRC {1182480 965760 1192560 975840}: H routing capacity/demand =  0/1 (occupy rate = inf), V routing capacity/demand =  0/0 (occupy rate = inf) with overflow 1
 GRC {366000 1217760 376080 1227840}: H routing capacity/demand =  0/1 (occupy rate = inf), V routing capacity/demand =  0/0 (occupy rate = inf) with overflow 1
 GRC {1283280 643200 1293360 653280}: H routing capacity/demand =  0/1 (occupy rate = inf), V routing capacity/demand =  0/0 (occupy rate = inf) with overflow 1
 GRC {1011120 673440 1021200 683520}: H routing capacity/demand =  0/1 (occupy rate = inf), V routing capacity/demand =  0/0 (occupy rate = inf) with overflow 1
 GRC {688560 1096800 698640 1106880}: H routing capacity/demand =  0/1 (occupy rate = inf), V routing capacity/demand =  0/0 (occupy rate = inf) with overflow 1
 GRC {1162320 502080 1172400 512160}: H routing capacity/demand =  0/1 (occupy rate = inf), V routing capacity/demand =  0/0 (occupy rate = inf) with overflow 1
 GRC {738960 240000 749040 250080}: H routing capacity/demand =  0/1 (occupy rate = inf), V routing capacity/demand =  0/0 (occupy rate = inf) with overflow 1
 GRC {849840 693600 859920 703680}: H routing capacity/demand =  0/1 (occupy rate = inf), V routing capacity/demand =  0/0 (occupy rate = inf) with overflow 1

++++++++ Top 10 horizontally congested GRCs ++++++++
 GRC {1061520 633120 1071600 643200}: H routing capacity/demand =  0/1 (occupy rate = inf) with overflow 1
 GRC {386160 824640 396240 834720}: H routing capacity/demand =  0/1 (occupy rate = inf) with overflow 1
 GRC {1011120 673440 1021200 683520}: H routing capacity/demand =  0/1 (occupy rate = inf) with overflow 1
 GRC {537360 955680 547440 965760}: H routing capacity/demand =  0/1 (occupy rate = inf) with overflow 1
 GRC {688560 1096800 698640 1106880}: H routing capacity/demand =  0/1 (occupy rate = inf) with overflow 1
 GRC {1232880 461760 1242960 471840}: H routing capacity/demand =  0/1 (occupy rate = inf) with overflow 1
 GRC {1283280 643200 1293360 653280}: H routing capacity/demand =  0/1 (occupy rate = inf) with overflow 1
 GRC {1232880 744000 1242960 754080}: H routing capacity/demand =  0/1 (occupy rate = inf) with overflow 1
 GRC {738960 240000 749040 250080}: H routing capacity/demand =  0/1 (occupy rate = inf) with overflow 1
 GRC {366000 1217760 376080 1227840}: H routing capacity/demand =  0/1 (occupy rate = inf) with overflow 1

++++++++ Top 10 vertically congested GRCs ++++++++
 GRC {335760 1106880 345840 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {325680 1106880 335760 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {315600 1106880 325680 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {305520 1106880 315600 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {295440 1106880 305520 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {285360 1106880 295440 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {275280 1106880 285360 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {265200 1106880 275280 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {255120 1106880 265200 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {245040 1106880 255120 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
++++++++++++++++++++++++++++++++++++++++++++++++
Layer METAL2 Congestion Map Data:
++++++++++++++++++++++++++++++++++++++++++++++++
There are 27060 GRCs (Global Route Cell) in this design
****************************************************************
****************** GRC based congestion report *****************
****************************************************************
  415 GRCs with overflow: 0 with H overflow and 415 with V overflow

++++++++ Top 10 congested GRCs ++++++++
 GRC {386160 834720 396240 844800}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  14/27 (occupy rate = 1.93) with overflow 13
 GRC {376080 814560 386160 824640}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  8/20 (occupy rate = 2.50) with overflow 12
 GRC {678480 703680 688560 713760}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  7/17 (occupy rate = 2.43) with overflow 10
 GRC {678480 713760 688560 723840}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  7/17 (occupy rate = 2.43) with overflow 10
 GRC {759120 723840 769200 733920}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  15/24 (occupy rate = 1.60) with overflow 9
 GRC {678480 723840 688560 733920}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  7/16 (occupy rate = 2.29) with overflow 9
 GRC {446640 824640 456720 834720}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  15/23 (occupy rate = 1.53) with overflow 8
 GRC {466800 864960 476880 875040}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  15/23 (occupy rate = 1.53) with overflow 8
 GRC {386160 814560 396240 824640}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  14/22 (occupy rate = 1.57) with overflow 8
 GRC {1293360 1197600 1303440 1207680}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  15/22 (occupy rate = 1.47) with overflow 7

++++++++ Top 10 horizontally congested GRCs ++++++++
 GRC {335760 1106880 345840 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {325680 1106880 335760 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {315600 1106880 325680 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {305520 1106880 315600 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {295440 1106880 305520 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {285360 1106880 295440 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {275280 1106880 285360 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {265200 1106880 275280 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {255120 1106880 265200 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {245040 1106880 255120 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 

++++++++ Top 10 vertically congested GRCs ++++++++
 GRC {386160 834720 396240 844800}: V routing capacity/demand =  14/27 (occupy rate = 1.93) with overflow 13
 GRC {376080 814560 386160 824640}: V routing capacity/demand =  8/20 (occupy rate = 2.50) with overflow 12
 GRC {678480 713760 688560 723840}: V routing capacity/demand =  7/17 (occupy rate = 2.43) with overflow 10
 GRC {678480 703680 688560 713760}: V routing capacity/demand =  7/17 (occupy rate = 2.43) with overflow 10
 GRC {759120 723840 769200 733920}: V routing capacity/demand =  15/24 (occupy rate = 1.60) with overflow 9
 GRC {678480 723840 688560 733920}: V routing capacity/demand =  7/16 (occupy rate = 2.29) with overflow 9
 GRC {466800 864960 476880 875040}: V routing capacity/demand =  15/23 (occupy rate = 1.53) with overflow 8
 GRC {386160 814560 396240 824640}: V routing capacity/demand =  14/22 (occupy rate = 1.57) with overflow 8
 GRC {446640 824640 456720 834720}: V routing capacity/demand =  15/23 (occupy rate = 1.53) with overflow 8
 GRC {1293360 1197600 1303440 1207680}: V routing capacity/demand =  15/22 (occupy rate = 1.47) with overflow 7
++++++++++++++++++++++++++++++++++++++++++++++++
Layer METAL3 Congestion Map Data:
++++++++++++++++++++++++++++++++++++++++++++++++
There are 27060 GRCs (Global Route Cell) in this design
****************************************************************
****************** GRC based congestion report *****************
****************************************************************
  6 GRCs with overflow: 6 with H overflow and 0 with V overflow

++++++++ Top 10 congested GRCs ++++++++
 GRC {376080 814560 386160 824640}: H routing capacity/demand =  14/15 (occupy rate = 1.07), V routing capacity/demand =  0/0 (occupy rate = inf) with overflow 1
 GRC {678480 713760 688560 723840}: H routing capacity/demand =  14/15 (occupy rate = 1.07), V routing capacity/demand =  0/0 (occupy rate = inf) with overflow 1
 GRC {678480 703680 688560 713760}: H routing capacity/demand =  14/15 (occupy rate = 1.07), V routing capacity/demand =  0/0 (occupy rate = inf) with overflow 1
 GRC {1222800 1177440 1232880 1187520}: H routing capacity/demand =  18/19 (occupy rate = 1.06), V routing capacity/demand =  0/0 (occupy rate = inf) with overflow 1
 GRC {718800 784320 728880 794400}: H routing capacity/demand =  18/19 (occupy rate = 1.06), V routing capacity/demand =  0/0 (occupy rate = inf) with overflow 1
 GRC {376080 844800 386160 854880}: H routing capacity/demand =  14/15 (occupy rate = 1.07), V routing capacity/demand =  0/0 (occupy rate = inf) with overflow 1
 GRC {305520 1106880 315600 1116960}: H routing capacity/demand =  18/17 (occupy rate = 0.94), V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {295440 1106880 305520 1116960}: H routing capacity/demand =  18/16 (occupy rate = 0.89), V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {285360 1106880 295440 1116960}: H routing capacity/demand =  18/17 (occupy rate = 0.94), V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {275280 1106880 285360 1116960}: H routing capacity/demand =  18/12 (occupy rate = 0.67), V routing capacity/demand =  0/0 (occupy rate = inf) 

++++++++ Top 10 horizontally congested GRCs ++++++++
 GRC {718800 784320 728880 794400}: H routing capacity/demand =  18/19 (occupy rate = 1.06) with overflow 1
 GRC {678480 703680 688560 713760}: H routing capacity/demand =  14/15 (occupy rate = 1.07) with overflow 1
 GRC {376080 844800 386160 854880}: H routing capacity/demand =  14/15 (occupy rate = 1.07) with overflow 1
 GRC {678480 713760 688560 723840}: H routing capacity/demand =  14/15 (occupy rate = 1.07) with overflow 1
 GRC {1222800 1177440 1232880 1187520}: H routing capacity/demand =  18/19 (occupy rate = 1.06) with overflow 1
 GRC {376080 814560 386160 824640}: H routing capacity/demand =  14/15 (occupy rate = 1.07) with overflow 1
 GRC {1636080 1096800 1646160 1106880}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1626000 1096800 1636080 1106880}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1615920 1096800 1626000 1106880}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1605840 1096800 1615920 1106880}: H routing capacity/demand =  0/0 (occupy rate = inf) 

++++++++ Top 10 vertically congested GRCs ++++++++
 GRC {335760 1106880 345840 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {325680 1106880 335760 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {315600 1106880 325680 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {305520 1106880 315600 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {295440 1106880 305520 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {285360 1106880 295440 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {275280 1106880 285360 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {265200 1106880 275280 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {255120 1106880 265200 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {245040 1106880 255120 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
++++++++++++++++++++++++++++++++++++++++++++++++
Layer METAL4 Congestion Map Data:
++++++++++++++++++++++++++++++++++++++++++++++++
There are 27060 GRCs (Global Route Cell) in this design
****************************************************************
****************** GRC based congestion report *****************
****************************************************************
  0 GRCs with overflow: 0 with H overflow and 0 with V overflow

++++++++ Top 10 congested GRCs ++++++++
 GRC {335760 1106880 345840 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  15/3 (occupy rate = 0.20) 
 GRC {325680 1106880 335760 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  15/10 (occupy rate = 0.67) 
 GRC {315600 1106880 325680 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  15/9 (occupy rate = 0.60) 
 GRC {305520 1106880 315600 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  16/10 (occupy rate = 0.62) 
 GRC {295440 1106880 305520 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  15/10 (occupy rate = 0.67) 
 GRC {285360 1106880 295440 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  15/10 (occupy rate = 0.67) 
 GRC {275280 1106880 285360 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  16/2 (occupy rate = 0.12) 
 GRC {265200 1106880 275280 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  15/2 (occupy rate = 0.13) 
 GRC {255120 1106880 265200 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  15/2 (occupy rate = 0.13) 
 GRC {245040 1106880 255120 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  15/3 (occupy rate = 0.20) 

++++++++ Top 10 horizontally congested GRCs ++++++++
 GRC {335760 1106880 345840 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {325680 1106880 335760 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {315600 1106880 325680 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {305520 1106880 315600 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {295440 1106880 305520 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {285360 1106880 295440 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {275280 1106880 285360 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {265200 1106880 275280 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {255120 1106880 265200 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {245040 1106880 255120 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 

++++++++ Top 10 vertically congested GRCs ++++++++
 GRC {184560 1379040 194640 1389120}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {194640 1379040 204720 1389120}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1454640 1379040 1464720 1389120}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1464720 1379040 1474800 1389120}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1474800 1379040 1484880 1389120}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1484880 1379040 1494960 1389120}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1494960 1379040 1505040 1389120}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1505040 1379040 1515120 1389120}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1515120 1379040 1525200 1389120}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1525200 1379040 1535280 1389120}: V routing capacity/demand =  0/0 (occupy rate = inf) 
++++++++++++++++++++++++++++++++++++++++++++++++
Layer METAL5 Congestion Map Data:
++++++++++++++++++++++++++++++++++++++++++++++++
There are 27060 GRCs (Global Route Cell) in this design
****************************************************************
****************** GRC based congestion report *****************
****************************************************************
  0 GRCs with overflow: 0 with H overflow and 0 with V overflow

++++++++ Top 10 congested GRCs ++++++++
 GRC {335760 1106880 345840 1116960}: H routing capacity/demand =  10/0 (occupy rate = 0.00), V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {325680 1106880 335760 1116960}: H routing capacity/demand =  10/0 (occupy rate = 0.00), V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {315600 1106880 325680 1116960}: H routing capacity/demand =  10/1 (occupy rate = 0.10), V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {305520 1106880 315600 1116960}: H routing capacity/demand =  10/1 (occupy rate = 0.10), V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {295440 1106880 305520 1116960}: H routing capacity/demand =  10/1 (occupy rate = 0.10), V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {285360 1106880 295440 1116960}: H routing capacity/demand =  10/1 (occupy rate = 0.10), V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {275280 1106880 285360 1116960}: H routing capacity/demand =  10/0 (occupy rate = 0.00), V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {265200 1106880 275280 1116960}: H routing capacity/demand =  10/0 (occupy rate = 0.00), V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {255120 1106880 265200 1116960}: H routing capacity/demand =  10/0 (occupy rate = 0.00), V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {245040 1106880 255120 1116960}: H routing capacity/demand =  10/0 (occupy rate = 0.00), V routing capacity/demand =  0/0 (occupy rate = inf) 

++++++++ Top 10 horizontally congested GRCs ++++++++
 GRC {1535280 1086720 1545360 1096800}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1525200 1086720 1535280 1096800}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1515120 1086720 1525200 1096800}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1505040 1086720 1515120 1096800}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1494960 1086720 1505040 1096800}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1484880 1086720 1494960 1096800}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1474800 1086720 1484880 1096800}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1464720 1086720 1474800 1096800}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1454640 1086720 1464720 1096800}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {194640 1076640 204720 1086720}: H routing capacity/demand =  0/0 (occupy rate = inf) 

++++++++ Top 10 vertically congested GRCs ++++++++
 GRC {335760 1106880 345840 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {325680 1106880 335760 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {315600 1106880 325680 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {305520 1106880 315600 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {295440 1106880 305520 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {285360 1106880 295440 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {275280 1106880 285360 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {265200 1106880 275280 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {255120 1106880 265200 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {245040 1106880 255120 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
++++++++++++++++++++++++++++++++++++++++++++++++
 Overall Congestion Map Data:
++++++++++++++++++++++++++++++++++++++++++++++++
There are 27060 GRCs (Global Route Cell) in this design
****************************************************************
****************** GRC based congestion report *****************
****************************************************************
  116 GRCs with overflow: 0 with H overflow and 116 with V overflow

++++++++ Top 10 congested GRCs ++++++++
 GRC {386160 834720 396240 844800}: H routing capacity/demand =  27/22 (occupy rate = 0.81), V routing capacity/demand =  28/40 (occupy rate = 1.43) with overflow 12
 GRC {376080 814560 386160 824640}: H routing capacity/demand =  25/22 (occupy rate = 0.88), V routing capacity/demand =  16/26 (occupy rate = 1.62) with overflow 10
 GRC {678480 703680 688560 713760}: H routing capacity/demand =  25/24 (occupy rate = 0.96), V routing capacity/demand =  14/23 (occupy rate = 1.64) with overflow 9
 GRC {678480 713760 688560 723840}: H routing capacity/demand =  25/23 (occupy rate = 0.92), V routing capacity/demand =  14/22 (occupy rate = 1.57) with overflow 8
 GRC {678480 723840 688560 733920}: H routing capacity/demand =  24/23 (occupy rate = 0.96), V routing capacity/demand =  14/22 (occupy rate = 1.57) with overflow 8
 GRC {446640 824640 456720 834720}: H routing capacity/demand =  21/18 (occupy rate = 0.86), V routing capacity/demand =  30/37 (occupy rate = 1.23) with overflow 7
 GRC {759120 723840 769200 733920}: H routing capacity/demand =  28/17 (occupy rate = 0.61), V routing capacity/demand =  30/37 (occupy rate = 1.23) with overflow 7
 GRC {527280 1147200 537360 1157280}: H routing capacity/demand =  25/17 (occupy rate = 0.68), V routing capacity/demand =  14/20 (occupy rate = 1.43) with overflow 6
 GRC {1263120 481920 1273200 492000}: H routing capacity/demand =  28/21 (occupy rate = 0.75), V routing capacity/demand =  30/36 (occupy rate = 1.20) with overflow 6
 GRC {1122000 1338720 1132080 1348800}: H routing capacity/demand =  24/16 (occupy rate = 0.67), V routing capacity/demand =  14/20 (occupy rate = 1.43) with overflow 6

++++++++ Top 10 horizontally congested GRCs ++++++++
 GRC {124080 1308480 134160 1318560}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {134160 1308480 144240 1318560}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {144240 1308480 154320 1318560}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {154320 1308480 164400 1318560}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {164400 1308480 174480 1318560}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {174480 1308480 184560 1318560}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {184560 1308480 194640 1318560}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {194640 1308480 204720 1318560}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1454640 1308480 1464720 1318560}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1464720 1308480 1474800 1318560}: H routing capacity/demand =  0/0 (occupy rate = inf) 

++++++++ Top 10 vertically congested GRCs ++++++++
 GRC {386160 834720 396240 844800}: V routing capacity/demand =  28/40 (occupy rate = 1.43) with overflow 12
 GRC {376080 814560 386160 824640}: V routing capacity/demand =  16/26 (occupy rate = 1.62) with overflow 10
 GRC {678480 703680 688560 713760}: V routing capacity/demand =  14/23 (occupy rate = 1.64) with overflow 9
 GRC {678480 713760 688560 723840}: V routing capacity/demand =  14/22 (occupy rate = 1.57) with overflow 8
 GRC {678480 723840 688560 733920}: V routing capacity/demand =  14/22 (occupy rate = 1.57) with overflow 8
 GRC {446640 824640 456720 834720}: V routing capacity/demand =  30/37 (occupy rate = 1.23) with overflow 7
 GRC {759120 723840 769200 733920}: V routing capacity/demand =  30/37 (occupy rate = 1.23) with overflow 7
 GRC {1273200 1278240 1283280 1288320}: V routing capacity/demand =  14/20 (occupy rate = 1.43) with overflow 6
 GRC {1122000 1338720 1132080 1348800}: V routing capacity/demand =  14/20 (occupy rate = 1.43) with overflow 6
 GRC {386160 885120 396240 895200}: V routing capacity/demand =  28/34 (occupy rate = 1.21) with overflow 6

icc_shell> route_zrt_global
Start Global Route ... 
[Init] Elapsed real time: 0:00:00 
[Init] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[Init] Stage (MB): Used    0  Alloctr    0  Proc    0 
[Init] Total (MB): Used    0  Alloctr    1  Proc  999 
Printing options for 'set_route_zrt_common_options'

Printing options for 'set_route_zrt_global_options'

Begin global routing.
Turn off antenna since no rule is specified
Cell Min-Routing-Layer = METAL1
Cell Max-Routing-Layer = METAL5
Warning: BPV on 7 macros were done with "treat blockage as thin". (ZRT-023)
Current Stage stats:
[End of Read DB] Elapsed real time: 0:00:01 
[End of Read DB] Elapsed cpu  time: sys=0:00:00 usr=0:00:01 total=0:00:01
[End of Read DB] Stage (MB): Used   51  Alloctr   52  Proc    0 
[End of Read DB] Total (MB): Used   52  Alloctr   53  Proc  999 
Constructing data structure ...
Design statistics:
Design Bounding Box (0.00,0.00,1662.06,1659.36)
Number of routing layers = 5
layer METAL1, dir Hor, min width = 0.23, min space = 0.23 pitch = 0.56
layer METAL2, dir Ver, min width = 0.28, min space = 0.28 pitch = 0.66
layer METAL3, dir Hor, min width = 0.28, min space = 0.28 pitch = 0.56
layer METAL4, dir Ver, min width = 0.28, min space = 0.28 pitch = 0.66
layer METAL5, dir Hor, min width = 0.44, min space = 0.46 pitch = 0.95
Current Stage stats:
[End of Build Tech Data] Elapsed real time: 0:00:00 
[End of Build Tech Data] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build Tech Data] Stage (MB): Used    2  Alloctr    2  Proc    0 
[End of Build Tech Data] Total (MB): Used   54  Alloctr   55  Proc  999 
Net statistics:
Total number of nets     = 29681
Number of nets to route  = 29225
Number of single or zero port nets = 417
29264 nets are fully connected,
 of which 39 are detail routed and 29225 are global routed.
Information: 29225 of the existing global routes are deleted. (ZRT-102)
Current Stage stats:
[End of Build All Nets] Elapsed real time: 0:00:00 
[End of Build All Nets] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build All Nets] Stage (MB): Used   -9  Alloctr    0  Proc    0 
[End of Build All Nets] Total (MB): Used   45  Alloctr   55  Proc  999 
Average gCell capacity  1.29     on layer (1)    METAL1
Average gCell capacity  4.58     on layer (2)    METAL2
Average gCell capacity  5.46     on layer (3)    METAL3
Average gCell capacity  4.67     on layer (4)    METAL4
Average gCell capacity  3.21     on layer (5)    METAL5
Average number of tracks per gCell 8.98  on layer (1)    METAL1
Average number of tracks per gCell 7.63  on layer (2)    METAL2
Average number of tracks per gCell 8.98  on layer (3)    METAL3
Average number of tracks per gCell 7.63  on layer (4)    METAL4
Average number of tracks per gCell 5.29  on layer (5)    METAL5
Number of gCells = 544500
Current Stage stats:
[End of Build Congestion map] Elapsed real time: 0:00:01 
[End of Build Congestion map] Elapsed cpu  time: sys=0:00:00 usr=0:00:01 total=0:00:01
[End of Build Congestion map] Stage (MB): Used    0  Alloctr    0  Proc   40 
[End of Build Congestion map] Total (MB): Used   46  Alloctr   56  Proc 1039 
Total stats:
[End of Build Data] Elapsed real time: 0:00:01 
[End of Build Data] Elapsed cpu  time: sys=0:00:00 usr=0:00:01 total=0:00:01
[End of Build Data] Stage (MB): Used   -6  Alloctr    3  Proc   40 
[End of Build Data] Total (MB): Used   46  Alloctr   56  Proc 1039 
Information: Using 1 threads for routing. (ZRT-444)

Start GR phase 0
Current Stage stats:
[End of Initial Routing] Elapsed real time: 0:00:01 
[End of Initial Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:01 total=0:00:01
[End of Initial Routing] Stage (MB): Used   16  Alloctr    6  Proc    0 
[End of Initial Routing] Total (MB): Used   62  Alloctr   63  Proc 1039 
Initial. Routing result:
Initial. Both Dirs: Overflow =  1473 Max = 4 GRCs =  2475 (1.13%)
Initial. H routing: Overflow =   446 Max = 4 (GRCs =  1) GRCs =   967 (0.88%)
Initial. V routing: Overflow =  1027 Max = 4 (GRCs =  1) GRCs =  1508 (1.38%)
Initial. METAL1     Overflow =   122 Max = 1 (GRCs = 104) GRCs =   140 (0.13%)
Initial. METAL2     Overflow =  1005 Max = 4 (GRCs =  1) GRCs =  1459 (1.33%)
Initial. METAL3     Overflow =   324 Max = 4 (GRCs =  1) GRCs =   827 (0.75%)
Initial. METAL4     Overflow =    21 Max = 1 (GRCs = 20) GRCs =    49 (0.04%)
Initial. METAL5     Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)

Initial. Total Wire Length = 1660677.50
Initial. Layer METAL1 wire length = 4963.90
Initial. Layer METAL2 wire length = 583031.62
Initial. Layer METAL3 wire length = 796444.81
Initial. Layer METAL4 wire length = 244997.92
Initial. Layer METAL5 wire length = 31239.32
Initial. Total Number of Contacts = 208936
Initial. Via via1 count = 104890
Initial. Via via2 count = 92426
Initial. Via via3 count = 10841
Initial. Via via4 count = 779
Initial. completed.

Start GR phase 1
Current Stage stats:
[End of Phase1 Routing] Elapsed real time: 0:00:00 
[End of Phase1 Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Phase1 Routing] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Phase1 Routing] Total (MB): Used   62  Alloctr   63  Proc 1039 
phase1. Routing result:
phase1. Both Dirs: Overflow =   395 Max = 3 GRCs =   618 (0.28%)
phase1. H routing: Overflow =    48 Max = 1 (GRCs = 27) GRCs =    84 (0.08%)
phase1. V routing: Overflow =   346 Max = 3 (GRCs =  4) GRCs =   534 (0.49%)
phase1. METAL1     Overflow =    45 Max = 1 (GRCs = 27) GRCs =    63 (0.06%)
phase1. METAL2     Overflow =   346 Max = 3 (GRCs =  4) GRCs =   534 (0.49%)
phase1. METAL3     Overflow =     3 Max = 0 (GRCs = 21) GRCs =    21 (0.02%)
phase1. METAL4     Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. METAL5     Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)

phase1. Total Wire Length = 1664528.50
phase1. Layer METAL1 wire length = 4665.54
phase1. Layer METAL2 wire length = 566190.75
phase1. Layer METAL3 wire length = 785909.19
phase1. Layer METAL4 wire length = 263378.19
phase1. Layer METAL5 wire length = 44384.71
phase1. Total Number of Contacts = 211440
phase1. Via via1 count = 104832
phase1. Via via2 count = 92736
phase1. Via via3 count = 12487
phase1. Via via4 count = 1385
phase1. completed.

Start GR phase 2
Current Stage stats:
[End of Phase2 Routing] Elapsed real time: 0:00:00 
[End of Phase2 Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Phase2 Routing] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Phase2 Routing] Total (MB): Used   62  Alloctr   63  Proc 1039 
phase2. Routing result:
phase2. Both Dirs: Overflow =   105 Max = 2 GRCs =   146 (0.07%)
phase2. H routing: Overflow =    34 Max = 1 (GRCs = 16) GRCs =    52 (0.05%)
phase2. V routing: Overflow =    71 Max = 2 (GRCs =  5) GRCs =    94 (0.09%)
phase2. METAL1     Overflow =    34 Max = 1 (GRCs = 16) GRCs =    52 (0.05%)
phase2. METAL2     Overflow =    71 Max = 2 (GRCs =  5) GRCs =    94 (0.09%)
phase2. METAL3     Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase2. METAL4     Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase2. METAL5     Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)

phase2. Total Wire Length = 1664579.00
phase2. Layer METAL1 wire length = 4625.86
phase2. Layer METAL2 wire length = 566025.19
phase2. Layer METAL3 wire length = 786059.56
phase2. Layer METAL4 wire length = 263494.06
phase2. Layer METAL5 wire length = 44374.28
phase2. Total Number of Contacts = 211478
phase2. Via via1 count = 104826
phase2. Via via2 count = 92770
phase2. Via via3 count = 12499
phase2. Via via4 count = 1383
phase2. completed.

Start GR phase 3
Current Stage stats:
[End of Phase3 Routing] Elapsed real time: 0:00:00 
[End of Phase3 Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Phase3 Routing] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Phase3 Routing] Total (MB): Used   62  Alloctr   63  Proc 1039 
phase3. Routing result:
phase3. Both Dirs: Overflow =   105 Max = 2 GRCs =   146 (0.07%)
phase3. H routing: Overflow =    34 Max = 1 (GRCs = 16) GRCs =    52 (0.05%)
phase3. V routing: Overflow =    71 Max = 2 (GRCs =  5) GRCs =    94 (0.09%)
phase3. METAL1     Overflow =    34 Max = 1 (GRCs = 16) GRCs =    52 (0.05%)
phase3. METAL2     Overflow =    71 Max = 2 (GRCs =  5) GRCs =    94 (0.09%)
phase3. METAL3     Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase3. METAL4     Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase3. METAL5     Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)

phase3. Total Wire Length = 1664579.00
phase3. Layer METAL1 wire length = 4625.86
phase3. Layer METAL2 wire length = 566025.19
phase3. Layer METAL3 wire length = 786059.56
phase3. Layer METAL4 wire length = 263494.06
phase3. Layer METAL5 wire length = 44374.28
phase3. Total Number of Contacts = 211478
phase3. Via via1 count = 104826
phase3. Via via2 count = 92770
phase3. Via via3 count = 12499
phase3. Via via4 count = 1383
phase3. completed.
[End of Whole Chip Routing] Elapsed real time: 0:00:04 
[End of Whole Chip Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:04 total=0:00:04
[End of Whole Chip Routing] Stage (MB): Used   10  Alloctr   10  Proc   40 
[End of Whole Chip Routing] Total (MB): Used   62  Alloctr   63  Proc 1039 

Information: Global Routing terminated early: false (ZRT-103)

Congestion utilization per direction:
Average vertical track utilization   = 22.54 %
Peak    vertical track utilization   = 150.00 %
Average horizontal track utilization = 19.30 %
Peak    horizontal track utilization = 100.00 %

Current Stage stats:
[GR: Done] Elapsed real time: 0:00:00 
[GR: Done] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[GR: Done] Stage (MB): Used   -2  Alloctr   -2  Proc    0 
[GR: Done] Total (MB): Used   62  Alloctr   63  Proc 1039 
GR Total stats:
[GR: Done] Elapsed real time: 0:00:05 
[GR: Done] Elapsed cpu  time: sys=0:00:00 usr=0:00:05 total=0:00:05
[GR: Done] Stage (MB): Used   61  Alloctr   62  Proc   40 
[GR: Done] Total (MB): Used   62  Alloctr   63  Proc 1039 
Updating the database ...
Final total stats:
[End of Global Routing] Elapsed real time: 0:00:06 
[End of Global Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:06 total=0:00:06
[End of Global Routing] Stage (MB): Used    0  Alloctr    0  Proc   40 
[End of Global Routing] Total (MB): Used    0  Alloctr    1  Proc 1039 
Information: RC extraction has been freed. (PSYN-503)
1
icc_shell> 
[begin initializing data for legality checker]
Initializing Data Structure ...
  Reading technology information ...
    Technology table contains 5 routable metal layers
    This is considered as a 5-metal-layer design
    Reading library information from DB ...
  Reading misc information ...
    array <unit> has 0 vertical and 234 horizontal rows
    62 pre-routes for placement blockage/checking
    5967 pre-routes for map congestion calculation
  Checking information read in ...
    design style = Horizontal masters, Horizontal rows
  Preprocessing design ...
    splitting rows by natural obstacles ...
[end initializing data for legality checker]
Running global router for congestion map ...
Start Global Route ... 
[Init] Elapsed real time: 0:00:00 
[Init] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[Init] Stage (MB): Used    0  Alloctr    0  Proc    0 
[Init] Total (MB): Used    0  Alloctr    1  Proc 1039 
Printing options for 'set_route_zrt_common_options'

Printing options for 'set_route_zrt_global_options'

Begin global routing.
Turn off antenna since no rule is specified
Cell Min-Routing-Layer = METAL1
Cell Max-Routing-Layer = METAL5
Warning: BPV on 7 macros were done with "treat blockage as thin". (ZRT-023)
Current Stage stats:
[End of Read DB] Elapsed real time: 0:00:01 
[End of Read DB] Elapsed cpu  time: sys=0:00:00 usr=0:00:01 total=0:00:01
[End of Read DB] Stage (MB): Used   50  Alloctr   51  Proc    0 
[End of Read DB] Total (MB): Used   51  Alloctr   52  Proc 1039 
Constructing data structure ...
Design statistics:
Design Bounding Box (0.00,0.00,1662.06,1659.36)
Number of routing layers = 5
layer METAL1, dir Hor, min width = 0.23, min space = 0.23 pitch = 0.56
layer METAL2, dir Ver, min width = 0.28, min space = 0.28 pitch = 0.66
layer METAL3, dir Hor, min width = 0.28, min space = 0.28 pitch = 0.56
layer METAL4, dir Ver, min width = 0.28, min space = 0.28 pitch = 0.66
layer METAL5, dir Hor, min width = 0.44, min space = 0.46 pitch = 0.95
Current Stage stats:
[End of Build Tech Data] Elapsed real time: 0:00:00 
[End of Build Tech Data] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build Tech Data] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Build Tech Data] Total (MB): Used   52  Alloctr   53  Proc 1039 
Net statistics:
Total number of nets     = 29681
Number of nets to route  = 29225
Number of single or zero port nets = 417
29264 nets are fully connected,
 of which 39 are detail routed and 29225 are global routed.
Information: 29225 of the existing global routes are deleted. (ZRT-102)
Current Stage stats:
[End of Build All Nets] Elapsed real time: 0:00:00 
[End of Build All Nets] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build All Nets] Stage (MB): Used   -8  Alloctr    0  Proc    0 
[End of Build All Nets] Total (MB): Used   43  Alloctr   53  Proc 1039 
Average gCell capacity  1.99     on layer (1)    METAL1
Average gCell capacity  9.18     on layer (2)    METAL2
Average gCell capacity  10.89    on layer (3)    METAL3
Average gCell capacity  9.35     on layer (4)    METAL4
Average gCell capacity  6.42     on layer (5)    METAL5
Average number of tracks per gCell 17.96         on layer (1)    METAL1
Average number of tracks per gCell 15.36         on layer (2)    METAL2
Average number of tracks per gCell 17.96         on layer (3)    METAL3
Average number of tracks per gCell 15.36         on layer (4)    METAL4
Average number of tracks per gCell 10.59         on layer (5)    METAL5
Number of gCells = 135300
Current Stage stats:
[End of Build Congestion map] Elapsed real time: 0:00:01 
[End of Build Congestion map] Elapsed cpu  time: sys=0:00:00 usr=0:00:01 total=0:00:01
[End of Build Congestion map] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Build Congestion map] Total (MB): Used   43  Alloctr   53  Proc 1039 
Total stats:
[End of Build Data] Elapsed real time: 0:00:01 
[End of Build Data] Elapsed cpu  time: sys=0:00:00 usr=0:00:01 total=0:00:01
[End of Build Data] Stage (MB): Used   -7  Alloctr    0  Proc    0 
[End of Build Data] Total (MB): Used   43  Alloctr   53  Proc 1039 
Information: Using 1 threads for routing. (ZRT-444)

Start GR phase 0
Current Stage stats:
[End of Initial Routing] Elapsed real time: 0:00:01 
[End of Initial Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:01 total=0:00:01
[End of Initial Routing] Stage (MB): Used   14  Alloctr    6  Proc    0 
[End of Initial Routing] Total (MB): Used   58  Alloctr   59  Proc 1039 
Initial. Routing result:
Initial. Both Dirs: Overflow =  3105 Max = 14 GRCs =  2104 (3.84%)
Initial. H routing: Overflow =   937 Max = 8 (GRCs =  1) GRCs =   601 (2.19%)
Initial. V routing: Overflow =  2167 Max = 14 (GRCs =  1) GRCs =  1503 (5.49%)
Initial. METAL1     Overflow =    46 Max = 1 (GRCs = 42) GRCs =    50 (0.18%)
Initial. METAL2     Overflow =  2139 Max = 14 (GRCs =  1) GRCs =  1465 (5.35%)
Initial. METAL3     Overflow =   891 Max = 8 (GRCs =  1) GRCs =   551 (2.01%)
Initial. METAL4     Overflow =    28 Max = 2 (GRCs =  5) GRCs =    38 (0.14%)
Initial. METAL5     Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)

Initial. Total Wire Length = 1580293.75
Initial. Layer METAL1 wire length = 3060.50
Initial. Layer METAL2 wire length = 597014.62
Initial. Layer METAL3 wire length = 770144.44
Initial. Layer METAL4 wire length = 193346.09
Initial. Layer METAL5 wire length = 16728.09
Initial. Total Number of Contacts = 168072
Initial. Via via1 count = 89633
Initial. Via via2 count = 69271
Initial. Via via3 count = 8751
Initial. Via via4 count = 417
Initial. completed.

Start GR phase 1
Current Stage stats:
[End of Phase1 Routing] Elapsed real time: 0:00:00 
[End of Phase1 Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Phase1 Routing] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Phase1 Routing] Total (MB): Used   58  Alloctr   59  Proc 1039 
phase1. Routing result:
phase1. Both Dirs: Overflow =  1335 Max = 14 GRCs =   708 (1.29%)
phase1. H routing: Overflow =    37 Max = 3 (GRCs =  1) GRCs =    52 (0.19%)
phase1. V routing: Overflow =  1298 Max = 14 (GRCs =  1) GRCs =   656 (2.40%)
phase1. METAL1     Overflow =    15 Max = 1 (GRCs = 11) GRCs =    19 (0.07%)
phase1. METAL2     Overflow =  1298 Max = 14 (GRCs =  1) GRCs =   654 (2.39%)
phase1. METAL3     Overflow =    22 Max = 3 (GRCs =  1) GRCs =    33 (0.12%)
phase1. METAL4     Overflow =     0 Max = 0 (GRCs =  2) GRCs =     2 (0.01%)
phase1. METAL5     Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)

phase1. Total Wire Length = 1586016.88
phase1. Layer METAL1 wire length = 2837.93
phase1. Layer METAL2 wire length = 567941.94
phase1. Layer METAL3 wire length = 753503.19
phase1. Layer METAL4 wire length = 225790.70
phase1. Layer METAL5 wire length = 35943.11
phase1. Total Number of Contacts = 170421
phase1. Via via1 count = 89597
phase1. Via via2 count = 69140
phase1. Via via3 count = 10462
phase1. Via via4 count = 1222
phase1. completed.
[End of Whole Chip Routing] Elapsed real time: 0:00:03 
[End of Whole Chip Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:03 total=0:00:03
[End of Whole Chip Routing] Stage (MB): Used    7  Alloctr    7  Proc    0 
[End of Whole Chip Routing] Total (MB): Used   58  Alloctr   59  Proc 1039 

Information: Global Routing terminated early: false (ZRT-103)

Congestion utilization per direction:
Average vertical track utilization   = 31.70 %
Peak    vertical track utilization   = 175.00 %
Average horizontal track utilization = 22.04 %
Peak    horizontal track utilization = 108.00 %

Current Stage stats:
[GR: Done] Elapsed real time: 0:00:00 
[GR: Done] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[GR: Done] Stage (MB): Used    0  Alloctr    0  Proc    0 
[GR: Done] Total (MB): Used   58  Alloctr   59  Proc 1039 
GR Total stats:
[GR: Done] Elapsed real time: 0:00:04 
[GR: Done] Elapsed cpu  time: sys=0:00:00 usr=0:00:04 total=0:00:04
[GR: Done] Stage (MB): Used   58  Alloctr   58  Proc    0 
[GR: Done] Total (MB): Used   58  Alloctr   59  Proc 1039 
Writing out congestion map...
Updating congestion ...
[DBOUT] Elapsed real time: 0:00:00 
[DBOUT] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[DBOUT] Stage (MB): Used  -50  Alloctr  -54  Proc    0 
[DBOUT] Total (MB): Used    0  Alloctr    1  Proc 1039 
Final total stats:
[End of Global Routing] Elapsed real time: 0:00:04 
[End of Global Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:04 total=0:00:04
[End of Global Routing] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Global Routing] Total (MB): Used    0  Alloctr    1  Proc 1039 

Information: Reporting global route congestion data from Milkyway...

++++++++++++++++++++++++++++++++++++++++++++++++
Layer METAL1 Congestion Map Data:
++++++++++++++++++++++++++++++++++++++++++++++++
There are 27060 GRCs (Global Route Cell) in this design
****************************************************************
****************** GRC based congestion report *****************
****************************************************************
  11 GRCs with overflow: 11 with H overflow and 0 with V overflow

++++++++ Top 10 congested GRCs ++++++++
 GRC {688560 1096800 698640 1106880}: H routing capacity/demand =  0/1 (occupy rate = inf), V routing capacity/demand =  0/0 (occupy rate = inf) with overflow 1
 GRC {1232880 744000 1242960 754080}: H routing capacity/demand =  0/1 (occupy rate = inf), V routing capacity/demand =  0/0 (occupy rate = inf) with overflow 1
 GRC {849840 693600 859920 703680}: H routing capacity/demand =  0/1 (occupy rate = inf), V routing capacity/demand =  0/0 (occupy rate = inf) with overflow 1
 GRC {1293360 1268160 1303440 1278240}: H routing capacity/demand =  0/1 (occupy rate = inf), V routing capacity/demand =  0/0 (occupy rate = inf) with overflow 1
 GRC {366000 1217760 376080 1227840}: H routing capacity/demand =  0/1 (occupy rate = inf), V routing capacity/demand =  0/0 (occupy rate = inf) with overflow 1
 GRC {1182480 965760 1192560 975840}: H routing capacity/demand =  0/1 (occupy rate = inf), V routing capacity/demand =  0/0 (occupy rate = inf) with overflow 1
 GRC {406320 1217760 416400 1227840}: H routing capacity/demand =  0/1 (occupy rate = inf), V routing capacity/demand =  0/0 (occupy rate = inf) with overflow 1
 GRC {285360 1116960 295440 1127040}: H routing capacity/demand =  0/1 (occupy rate = inf), V routing capacity/demand =  0/0 (occupy rate = inf) with overflow 1
 GRC {1061520 633120 1071600 643200}: H routing capacity/demand =  0/1 (occupy rate = inf), V routing capacity/demand =  0/0 (occupy rate = inf) with overflow 1
 GRC {1303440 371040 1313520 381120}: H routing capacity/demand =  0/1 (occupy rate = inf), V routing capacity/demand =  0/0 (occupy rate = inf) with overflow 1

++++++++ Top 10 horizontally congested GRCs ++++++++
 GRC {1293360 1268160 1303440 1278240}: H routing capacity/demand =  0/1 (occupy rate = inf) with overflow 1
 GRC {688560 1096800 698640 1106880}: H routing capacity/demand =  0/1 (occupy rate = inf) with overflow 1
 GRC {1182480 965760 1192560 975840}: H routing capacity/demand =  0/1 (occupy rate = inf) with overflow 1
 GRC {406320 1217760 416400 1227840}: H routing capacity/demand =  0/1 (occupy rate = inf) with overflow 1
 GRC {1232880 461760 1242960 471840}: H routing capacity/demand =  0/1 (occupy rate = inf) with overflow 1
 GRC {1232880 744000 1242960 754080}: H routing capacity/demand =  0/1 (occupy rate = inf) with overflow 1
 GRC {1303440 371040 1313520 381120}: H routing capacity/demand =  0/1 (occupy rate = inf) with overflow 1
 GRC {366000 1217760 376080 1227840}: H routing capacity/demand =  0/1 (occupy rate = inf) with overflow 1
 GRC {849840 693600 859920 703680}: H routing capacity/demand =  0/1 (occupy rate = inf) with overflow 1
 GRC {1061520 633120 1071600 643200}: H routing capacity/demand =  0/1 (occupy rate = inf) with overflow 1

++++++++ Top 10 vertically congested GRCs ++++++++
 GRC {335760 1106880 345840 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {325680 1106880 335760 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {315600 1106880 325680 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {305520 1106880 315600 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {295440 1106880 305520 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {285360 1106880 295440 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {275280 1106880 285360 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {265200 1106880 275280 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {255120 1106880 265200 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {245040 1106880 255120 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
++++++++++++++++++++++++++++++++++++++++++++++++
Layer METAL2 Congestion Map Data:
++++++++++++++++++++++++++++++++++++++++++++++++
There are 27060 GRCs (Global Route Cell) in this design
****************************************************************
****************** GRC based congestion report *****************
****************************************************************
  394 GRCs with overflow: 0 with H overflow and 394 with V overflow

++++++++ Top 10 congested GRCs ++++++++
 GRC {386160 834720 396240 844800}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  14/28 (occupy rate = 2.00) with overflow 14
 GRC {376080 814560 386160 824640}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  8/20 (occupy rate = 2.50) with overflow 12
 GRC {678480 713760 688560 723840}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  7/17 (occupy rate = 2.43) with overflow 10
 GRC {678480 703680 688560 713760}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  7/17 (occupy rate = 2.43) with overflow 10
 GRC {678480 723840 688560 733920}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  7/16 (occupy rate = 2.29) with overflow 9
 GRC {759120 723840 769200 733920}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  15/23 (occupy rate = 1.53) with overflow 8
 GRC {295440 1006080 305520 1016160}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  15/22 (occupy rate = 1.47) with overflow 7
 GRC {618000 1248000 628080 1258080}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  15/22 (occupy rate = 1.47) with overflow 7
 GRC {386160 814560 396240 824640}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  14/21 (occupy rate = 1.50) with overflow 7
 GRC {1273200 1278240 1283280 1288320}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  7/14 (occupy rate = 2.00) with overflow 7

++++++++ Top 10 horizontally congested GRCs ++++++++
 GRC {335760 1106880 345840 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {325680 1106880 335760 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {315600 1106880 325680 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {305520 1106880 315600 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {295440 1106880 305520 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {285360 1106880 295440 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {275280 1106880 285360 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {265200 1106880 275280 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {255120 1106880 265200 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {245040 1106880 255120 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 

++++++++ Top 10 vertically congested GRCs ++++++++
 GRC {386160 834720 396240 844800}: V routing capacity/demand =  14/28 (occupy rate = 2.00) with overflow 14
 GRC {376080 814560 386160 824640}: V routing capacity/demand =  8/20 (occupy rate = 2.50) with overflow 12
 GRC {678480 713760 688560 723840}: V routing capacity/demand =  7/17 (occupy rate = 2.43) with overflow 10
 GRC {678480 703680 688560 713760}: V routing capacity/demand =  7/17 (occupy rate = 2.43) with overflow 10
 GRC {678480 723840 688560 733920}: V routing capacity/demand =  7/16 (occupy rate = 2.29) with overflow 9
 GRC {759120 723840 769200 733920}: V routing capacity/demand =  15/23 (occupy rate = 1.53) with overflow 8
 GRC {386160 814560 396240 824640}: V routing capacity/demand =  14/21 (occupy rate = 1.50) with overflow 7
 GRC {295440 1006080 305520 1016160}: V routing capacity/demand =  15/22 (occupy rate = 1.47) with overflow 7
 GRC {1273200 1278240 1283280 1288320}: V routing capacity/demand =  7/14 (occupy rate = 2.00) with overflow 7
 GRC {618000 1248000 628080 1258080}: V routing capacity/demand =  15/22 (occupy rate = 1.47) with overflow 7
++++++++++++++++++++++++++++++++++++++++++++++++
Layer METAL3 Congestion Map Data:
++++++++++++++++++++++++++++++++++++++++++++++++
There are 27060 GRCs (Global Route Cell) in this design
****************************************************************
****************** GRC based congestion report *****************
****************************************************************
  5 GRCs with overflow: 5 with H overflow and 0 with V overflow

++++++++ Top 10 congested GRCs ++++++++
 GRC {376080 814560 386160 824640}: H routing capacity/demand =  14/17 (occupy rate = 1.21), V routing capacity/demand =  0/0 (occupy rate = inf) with overflow 3
 GRC {678480 713760 688560 723840}: H routing capacity/demand =  14/16 (occupy rate = 1.14), V routing capacity/demand =  0/0 (occupy rate = inf) with overflow 2
 GRC {678480 723840 688560 733920}: H routing capacity/demand =  14/15 (occupy rate = 1.07), V routing capacity/demand =  0/0 (occupy rate = inf) with overflow 1
 GRC {1122000 1258080 1132080 1268160}: H routing capacity/demand =  14/15 (occupy rate = 1.07), V routing capacity/demand =  0/0 (occupy rate = inf) with overflow 1
 GRC {527280 1147200 537360 1157280}: H routing capacity/demand =  14/15 (occupy rate = 1.07), V routing capacity/demand =  0/0 (occupy rate = inf) with overflow 1
 GRC {325680 1106880 335760 1116960}: H routing capacity/demand =  18/16 (occupy rate = 0.89), V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {305520 1106880 315600 1116960}: H routing capacity/demand =  18/16 (occupy rate = 0.89), V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {315600 1106880 325680 1116960}: H routing capacity/demand =  18/13 (occupy rate = 0.72), V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {295440 1106880 305520 1116960}: H routing capacity/demand =  18/17 (occupy rate = 0.94), V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {275280 1106880 285360 1116960}: H routing capacity/demand =  18/10 (occupy rate = 0.56), V routing capacity/demand =  0/0 (occupy rate = inf) 

++++++++ Top 10 horizontally congested GRCs ++++++++
 GRC {376080 814560 386160 824640}: H routing capacity/demand =  14/17 (occupy rate = 1.21) with overflow 3
 GRC {678480 713760 688560 723840}: H routing capacity/demand =  14/16 (occupy rate = 1.14) with overflow 2
 GRC {527280 1147200 537360 1157280}: H routing capacity/demand =  14/15 (occupy rate = 1.07) with overflow 1
 GRC {678480 723840 688560 733920}: H routing capacity/demand =  14/15 (occupy rate = 1.07) with overflow 1
 GRC {1122000 1258080 1132080 1268160}: H routing capacity/demand =  14/15 (occupy rate = 1.07) with overflow 1
 GRC {1636080 1096800 1646160 1106880}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1626000 1096800 1636080 1106880}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1605840 1096800 1615920 1106880}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1595760 1096800 1605840 1106880}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1575600 1096800 1585680 1106880}: H routing capacity/demand =  0/0 (occupy rate = inf) 

++++++++ Top 10 vertically congested GRCs ++++++++
 GRC {335760 1106880 345840 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {325680 1106880 335760 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {315600 1106880 325680 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {305520 1106880 315600 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {295440 1106880 305520 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {285360 1106880 295440 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {275280 1106880 285360 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {265200 1106880 275280 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {255120 1106880 265200 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {245040 1106880 255120 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
++++++++++++++++++++++++++++++++++++++++++++++++
Layer METAL4 Congestion Map Data:
++++++++++++++++++++++++++++++++++++++++++++++++
There are 27060 GRCs (Global Route Cell) in this design
****************************************************************
****************** GRC based congestion report *****************
****************************************************************
  0 GRCs with overflow: 0 with H overflow and 0 with V overflow

++++++++ Top 10 congested GRCs ++++++++
 GRC {335760 1106880 345840 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  15/4 (occupy rate = 0.27) 
 GRC {325680 1106880 335760 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  15/10 (occupy rate = 0.67) 
 GRC {315600 1106880 325680 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  15/7 (occupy rate = 0.47) 
 GRC {305520 1106880 315600 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  16/11 (occupy rate = 0.69) 
 GRC {295440 1106880 305520 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  15/12 (occupy rate = 0.80) 
 GRC {285360 1106880 295440 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  15/8 (occupy rate = 0.53) 
 GRC {275280 1106880 285360 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  16/0 (occupy rate = 0.00) 
 GRC {265200 1106880 275280 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  15/2 (occupy rate = 0.13) 
 GRC {255120 1106880 265200 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  15/2 (occupy rate = 0.13) 
 GRC {245040 1106880 255120 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf), V routing capacity/demand =  15/3 (occupy rate = 0.20) 

++++++++ Top 10 horizontally congested GRCs ++++++++
 GRC {335760 1106880 345840 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {325680 1106880 335760 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {315600 1106880 325680 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {305520 1106880 315600 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {295440 1106880 305520 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {285360 1106880 295440 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {275280 1106880 285360 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {265200 1106880 275280 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {255120 1106880 265200 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {245040 1106880 255120 1116960}: H routing capacity/demand =  0/0 (occupy rate = inf) 

++++++++ Top 10 vertically congested GRCs ++++++++
 GRC {1525200 1338720 1535280 1348800}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1535280 1338720 1545360 1348800}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1545360 1338720 1555440 1348800}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1555440 1338720 1565520 1348800}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1565520 1338720 1575600 1348800}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1575600 1338720 1585680 1348800}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1585680 1338720 1595760 1348800}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1595760 1338720 1605840 1348800}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1605840 1338720 1615920 1348800}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1615920 1338720 1626000 1348800}: V routing capacity/demand =  0/0 (occupy rate = inf) 
++++++++++++++++++++++++++++++++++++++++++++++++
Layer METAL5 Congestion Map Data:
++++++++++++++++++++++++++++++++++++++++++++++++
There are 27060 GRCs (Global Route Cell) in this design
****************************************************************
****************** GRC based congestion report *****************
****************************************************************
  0 GRCs with overflow: 0 with H overflow and 0 with V overflow

++++++++ Top 10 congested GRCs ++++++++
 GRC {335760 1106880 345840 1116960}: H routing capacity/demand =  10/0 (occupy rate = 0.00), V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {325680 1106880 335760 1116960}: H routing capacity/demand =  10/0 (occupy rate = 0.00), V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {315600 1106880 325680 1116960}: H routing capacity/demand =  10/0 (occupy rate = 0.00), V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {305520 1106880 315600 1116960}: H routing capacity/demand =  10/0 (occupy rate = 0.00), V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {295440 1106880 305520 1116960}: H routing capacity/demand =  10/0 (occupy rate = 0.00), V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {285360 1106880 295440 1116960}: H routing capacity/demand =  10/0 (occupy rate = 0.00), V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {275280 1106880 285360 1116960}: H routing capacity/demand =  10/0 (occupy rate = 0.00), V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {265200 1106880 275280 1116960}: H routing capacity/demand =  10/0 (occupy rate = 0.00), V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {255120 1106880 265200 1116960}: H routing capacity/demand =  10/0 (occupy rate = 0.00), V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {245040 1106880 255120 1116960}: H routing capacity/demand =  10/0 (occupy rate = 0.00), V routing capacity/demand =  0/0 (occupy rate = inf) 

++++++++ Top 10 horizontally congested GRCs ++++++++
 GRC {1525200 1086720 1535280 1096800}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1515120 1086720 1525200 1096800}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1505040 1086720 1515120 1096800}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1494960 1086720 1505040 1096800}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1484880 1086720 1494960 1096800}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1474800 1086720 1484880 1096800}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1464720 1086720 1474800 1096800}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1454640 1086720 1464720 1096800}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {194640 1076640 204720 1086720}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {184560 1076640 194640 1086720}: H routing capacity/demand =  0/0 (occupy rate = inf) 

++++++++ Top 10 vertically congested GRCs ++++++++
 GRC {335760 1106880 345840 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {325680 1106880 335760 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {315600 1106880 325680 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {305520 1106880 315600 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {295440 1106880 305520 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {285360 1106880 295440 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {275280 1106880 285360 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {265200 1106880 275280 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {255120 1106880 265200 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {245040 1106880 255120 1116960}: V routing capacity/demand =  0/0 (occupy rate = inf) 
++++++++++++++++++++++++++++++++++++++++++++++++
 Overall Congestion Map Data:
++++++++++++++++++++++++++++++++++++++++++++++++
There are 27060 GRCs (Global Route Cell) in this design
****************************************************************
****************** GRC based congestion report *****************
****************************************************************
  112 GRCs with overflow: 1 with H overflow and 111 with V overflow

++++++++ Top 10 congested GRCs ++++++++
 GRC {386160 834720 396240 844800}: H routing capacity/demand =  27/23 (occupy rate = 0.85), V routing capacity/demand =  28/42 (occupy rate = 1.50) with overflow 14
 GRC {376080 814560 386160 824640}: H routing capacity/demand =  25/27 (occupy rate = 1.08), V routing capacity/demand =  16/28 (occupy rate = 1.75) with overflow 12
 GRC {386160 814560 396240 824640}: H routing capacity/demand =  27/25 (occupy rate = 0.93), V routing capacity/demand =  28/35 (occupy rate = 1.25) with overflow 7
 GRC {678480 703680 688560 713760}: H routing capacity/demand =  25/24 (occupy rate = 0.96), V routing capacity/demand =  14/21 (occupy rate = 1.50) with overflow 7
 GRC {678480 713760 688560 723840}: H routing capacity/demand =  25/24 (occupy rate = 0.96), V routing capacity/demand =  14/21 (occupy rate = 1.50) with overflow 7
 GRC {678480 723840 688560 733920}: H routing capacity/demand =  24/23 (occupy rate = 0.96), V routing capacity/demand =  14/21 (occupy rate = 1.50) with overflow 7
 GRC {1263120 481920 1273200 492000}: H routing capacity/demand =  28/23 (occupy rate = 0.82), V routing capacity/demand =  30/36 (occupy rate = 1.20) with overflow 6
 GRC {305520 1086720 315600 1096800}: H routing capacity/demand =  29/18 (occupy rate = 0.62), V routing capacity/demand =  32/38 (occupy rate = 1.19) with overflow 6
 GRC {759120 723840 769200 733920}: H routing capacity/demand =  28/18 (occupy rate = 0.64), V routing capacity/demand =  30/36 (occupy rate = 1.20) with overflow 6
 GRC {1273200 1278240 1283280 1288320}: H routing capacity/demand =  25/16 (occupy rate = 0.64), V routing capacity/demand =  14/20 (occupy rate = 1.43) with overflow 6

++++++++ Top 10 horizontally congested GRCs ++++++++
 GRC {376080 814560 386160 824640}: H routing capacity/demand =  25/27 (occupy rate = 1.08) with overflow 2
 GRC {134160 1308480 144240 1318560}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {144240 1308480 154320 1318560}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {154320 1308480 164400 1318560}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {164400 1308480 174480 1318560}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {124080 1308480 134160 1318560}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {184560 1308480 194640 1318560}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {194640 1308480 204720 1318560}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1454640 1308480 1464720 1318560}: H routing capacity/demand =  0/0 (occupy rate = inf) 
 GRC {1464720 1308480 1474800 1318560}: H routing capacity/demand =  0/0 (occupy rate = inf) 

++++++++ Top 10 vertically congested GRCs ++++++++
 GRC {386160 834720 396240 844800}: V routing capacity/demand =  28/42 (occupy rate = 1.50) with overflow 14
 GRC {376080 814560 386160 824640}: V routing capacity/demand =  16/28 (occupy rate = 1.75) with overflow 12
 GRC {386160 814560 396240 824640}: V routing capacity/demand =  28/35 (occupy rate = 1.25) with overflow 7
 GRC {678480 713760 688560 723840}: V routing capacity/demand =  14/21 (occupy rate = 1.50) with overflow 7
 GRC {678480 723840 688560 733920}: V routing capacity/demand =  14/21 (occupy rate = 1.50) with overflow 7
 GRC {678480 703680 688560 713760}: V routing capacity/demand =  14/21 (occupy rate = 1.50) with overflow 7
 GRC {1273200 1278240 1283280 1288320}: V routing capacity/demand =  14/20 (occupy rate = 1.43) with overflow 6
 GRC {305520 1086720 315600 1096800}: V routing capacity/demand =  32/38 (occupy rate = 1.19) with overflow 6
 GRC {1263120 481920 1273200 492000}: V routing capacity/demand =  30/36 (occupy rate = 1.20) with overflow 6
 GRC {759120 723840 769200 733920}: V routing capacity/demand =  30/36 (occupy rate = 1.20) with overflow 6

icc_shell> :q
Error: unknown command ':q' (CMD-005)
icc_shell> route_zrt_global
Start Global Route ... 
[Init] Elapsed real time: 0:00:00 
[Init] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[Init] Stage (MB): Used    0  Alloctr    0  Proc    0 
[Init] Total (MB): Used    0  Alloctr    1  Proc 1039 
Printing options for 'set_route_zrt_common_options'

Printing options for 'set_route_zrt_global_options'

Begin global routing.
Turn off antenna since no rule is specified
Cell Min-Routing-Layer = METAL1
Cell Max-Routing-Layer = METAL5
Warning: BPV on 7 macros were done with "treat blockage as thin". (ZRT-023)
Current Stage stats:
[End of Read DB] Elapsed real time: 0:00:01 
[End of Read DB] Elapsed cpu  time: sys=0:00:00 usr=0:00:01 total=0:00:01
[End of Read DB] Stage (MB): Used   50  Alloctr   51  Proc    0 
[End of Read DB] Total (MB): Used   51  Alloctr   52  Proc 1039 
Constructing data structure ...
Design statistics:
Design Bounding Box (0.00,0.00,1662.06,1659.36)
Number of routing layers = 5
layer METAL1, dir Hor, min width = 0.23, min space = 0.23 pitch = 0.56
layer METAL2, dir Ver, min width = 0.28, min space = 0.28 pitch = 0.66
layer METAL3, dir Hor, min width = 0.28, min space = 0.28 pitch = 0.56
layer METAL4, dir Ver, min width = 0.28, min space = 0.28 pitch = 0.66
layer METAL5, dir Hor, min width = 0.44, min space = 0.46 pitch = 0.95
Current Stage stats:
[End of Build Tech Data] Elapsed real time: 0:00:00 
[End of Build Tech Data] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build Tech Data] Stage (MB): Used    2  Alloctr    2  Proc    0 
[End of Build Tech Data] Total (MB): Used   53  Alloctr   55  Proc 1039 
Net statistics:
Total number of nets     = 29681
Number of nets to route  = 29225
Number of single or zero port nets = 417
29264 nets are fully connected,
 of which 39 are detail routed and 29225 are global routed.
Information: 29225 of the existing global routes are deleted. (ZRT-102)
Current Stage stats:
[End of Build All Nets] Elapsed real time: 0:00:00 
[End of Build All Nets] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build All Nets] Stage (MB): Used   -8  Alloctr    0  Proc    0 
[End of Build All Nets] Total (MB): Used   45  Alloctr   54  Proc 1039 
Average gCell capacity  1.29     on layer (1)    METAL1
Average gCell capacity  4.58     on layer (2)    METAL2
Average gCell capacity  5.46     on layer (3)    METAL3
Average gCell capacity  4.67     on layer (4)    METAL4
Average gCell capacity  3.21     on layer (5)    METAL5
Average number of tracks per gCell 8.98  on layer (1)    METAL1
Average number of tracks per gCell 7.63  on layer (2)    METAL2
Average number of tracks per gCell 8.98  on layer (3)    METAL3
Average number of tracks per gCell 7.63  on layer (4)    METAL4
Average number of tracks per gCell 5.29  on layer (5)    METAL5
Number of gCells = 544500
Current Stage stats:
[End of Build Congestion map] Elapsed real time: 0:00:01 
[End of Build Congestion map] Elapsed cpu  time: sys=0:00:00 usr=0:00:01 total=0:00:01
[End of Build Congestion map] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Build Congestion map] Total (MB): Used   46  Alloctr   55  Proc 1039 
Total stats:
[End of Build Data] Elapsed real time: 0:00:01 
[End of Build Data] Elapsed cpu  time: sys=0:00:00 usr=0:00:01 total=0:00:01
[End of Build Data] Stage (MB): Used   -5  Alloctr    3  Proc    0 
[End of Build Data] Total (MB): Used   46  Alloctr   55  Proc 1039 
Information: Using 1 threads for routing. (ZRT-444)

Start GR phase 0
Current Stage stats:
[End of Initial Routing] Elapsed real time: 0:00:01 
[End of Initial Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:01 total=0:00:01
[End of Initial Routing] Stage (MB): Used   16  Alloctr    7  Proc    0 
[End of Initial Routing] Total (MB): Used   62  Alloctr   63  Proc 1039 
Initial. Routing result:
Initial. Both Dirs: Overflow =  1395 Max = 4 GRCs =  2391 (1.09%)
Initial. H routing: Overflow =   447 Max = 3 (GRCs =  2) GRCs =   931 (0.85%)
Initial. V routing: Overflow =   948 Max = 4 (GRCs =  1) GRCs =  1460 (1.33%)
Initial. METAL1     Overflow =   107 Max = 1 (GRCs = 91) GRCs =   124 (0.11%)
Initial. METAL2     Overflow =   920 Max = 4 (GRCs =  1) GRCs =  1406 (1.28%)
Initial. METAL3     Overflow =   339 Max = 3 (GRCs =  2) GRCs =   807 (0.74%)
Initial. METAL4     Overflow =    27 Max = 2 (GRCs =  1) GRCs =    54 (0.05%)
Initial. METAL5     Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)

Initial. Total Wire Length = 1661302.75
Initial. Layer METAL1 wire length = 5232.45
Initial. Layer METAL2 wire length = 583069.12
Initial. Layer METAL3 wire length = 796398.25
Initial. Layer METAL4 wire length = 245755.41
Initial. Layer METAL5 wire length = 30847.65
Initial. Total Number of Contacts = 209128
Initial. Via via1 count = 104900
Initial. Via via2 count = 92488
Initial. Via via3 count = 10999
Initial. Via via4 count = 741
Initial. completed.

Start GR phase 1
Current Stage stats:
[End of Phase1 Routing] Elapsed real time: 0:00:00 
[End of Phase1 Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Phase1 Routing] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Phase1 Routing] Total (MB): Used   62  Alloctr   63  Proc 1039 
phase1. Routing result:
phase1. Both Dirs: Overflow =   351 Max = 4 GRCs =   588 (0.27%)
phase1. H routing: Overflow =    45 Max = 1 (GRCs = 26) GRCs =    77 (0.07%)
phase1. V routing: Overflow =   306 Max = 4 (GRCs =  1) GRCs =   511 (0.47%)
phase1. METAL1     Overflow =    42 Max = 1 (GRCs = 26) GRCs =    59 (0.05%)
phase1. METAL2     Overflow =   306 Max = 4 (GRCs =  1) GRCs =   510 (0.47%)
phase1. METAL3     Overflow =     3 Max = 0 (GRCs = 18) GRCs =    18 (0.02%)
phase1. METAL4     Overflow =     0 Max = 0 (GRCs =  1) GRCs =     1 (0.00%)
phase1. METAL5     Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)

phase1. Total Wire Length = 1664699.25
phase1. Layer METAL1 wire length = 4963.05
phase1. Layer METAL2 wire length = 566989.19
phase1. Layer METAL3 wire length = 785863.44
phase1. Layer METAL4 wire length = 263413.12
phase1. Layer METAL5 wire length = 43470.40
phase1. Total Number of Contacts = 211594
phase1. Via via1 count = 104844
phase1. Via via2 count = 92768
phase1. Via via3 count = 12641
phase1. Via via4 count = 1341
phase1. completed.

Start GR phase 2
Current Stage stats:
[End of Phase2 Routing] Elapsed real time: 0:00:00 
[End of Phase2 Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Phase2 Routing] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Phase2 Routing] Total (MB): Used   62  Alloctr   63  Proc 1039 
phase2. Routing result:
phase2. Both Dirs: Overflow =   105 Max = 3 GRCs =   154 (0.07%)
phase2. H routing: Overflow =    39 Max = 1 (GRCs = 12) GRCs =    66 (0.06%)
phase2. V routing: Overflow =    66 Max = 3 (GRCs =  1) GRCs =    88 (0.08%)
phase2. METAL1     Overflow =    39 Max = 1 (GRCs = 12) GRCs =    66 (0.06%)
phase2. METAL2     Overflow =    66 Max = 3 (GRCs =  1) GRCs =    88 (0.08%)
phase2. METAL3     Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase2. METAL4     Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase2. METAL5     Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)

phase2. Total Wire Length = 1664741.38
phase2. Layer METAL1 wire length = 4906.85
phase2. Layer METAL2 wire length = 566872.56
phase2. Layer METAL3 wire length = 785892.38
phase2. Layer METAL4 wire length = 263491.31
phase2. Layer METAL5 wire length = 43578.36
phase2. Total Number of Contacts = 211629
phase2. Via via1 count = 104841
phase2. Via via2 count = 92798
phase2. Via via3 count = 12649
phase2. Via via4 count = 1341
phase2. completed.

Start GR phase 3
Current Stage stats:
[End of Phase3 Routing] Elapsed real time: 0:00:00 
[End of Phase3 Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Phase3 Routing] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Phase3 Routing] Total (MB): Used   62  Alloctr   63  Proc 1039 
phase3. Routing result:
phase3. Both Dirs: Overflow =   105 Max = 3 GRCs =   154 (0.07%)
phase3. H routing: Overflow =    39 Max = 1 (GRCs = 12) GRCs =    67 (0.06%)
phase3. V routing: Overflow =    66 Max = 3 (GRCs =  1) GRCs =    87 (0.08%)
phase3. METAL1     Overflow =    39 Max = 1 (GRCs = 12) GRCs =    67 (0.06%)
phase3. METAL2     Overflow =    66 Max = 3 (GRCs =  1) GRCs =    87 (0.08%)
phase3. METAL3     Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase3. METAL4     Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase3. METAL5     Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)

phase3. Total Wire Length = 1664752.88
phase3. Layer METAL1 wire length = 4906.85
phase3. Layer METAL2 wire length = 566866.81
phase3. Layer METAL3 wire length = 785903.75
phase3. Layer METAL4 wire length = 263497.06
phase3. Layer METAL5 wire length = 43578.36
phase3. Total Number of Contacts = 211631
phase3. Via via1 count = 104841
phase3. Via via2 count = 92798
phase3. Via via3 count = 12651
phase3. Via via4 count = 1341
phase3. completed.
[End of Whole Chip Routing] Elapsed real time: 0:00:04 
[End of Whole Chip Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:04 total=0:00:04
[End of Whole Chip Routing] Stage (MB): Used   11  Alloctr   10  Proc    0 
[End of Whole Chip Routing] Total (MB): Used   62  Alloctr   63  Proc 1039 

Information: Global Routing terminated early: false (ZRT-103)

Congestion utilization per direction:
Average vertical track utilization   = 22.55 %
Peak    vertical track utilization   = 150.00 %
Average horizontal track utilization = 19.29 %
Peak    horizontal track utilization = 100.00 %

Current Stage stats:
[GR: Done] Elapsed real time: 0:00:00 
[GR: Done] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[GR: Done] Stage (MB): Used   -2  Alloctr   -2  Proc    0 
[GR: Done] Total (MB): Used   62  Alloctr   63  Proc 1039 
GR Total stats:
[GR: Done] Elapsed real time: 0:00:05 
[GR: Done] Elapsed cpu  time: sys=0:00:00 usr=0:00:05 total=0:00:05
[GR: Done] Stage (MB): Used   61  Alloctr   62  Proc    0 
[GR: Done] Total (MB): Used   62  Alloctr   63  Proc 1039 
Updating the database ...
Final total stats:
[End of Global Routing] Elapsed real time: 0:00:05 
[End of Global Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:05 total=0:00:05
[End of Global Routing] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Global Routing] Total (MB): Used    0  Alloctr    1  Proc 1039 
Information: RC extraction has been freed. (PSYN-503)
1
icc_shell> redirect -tee ../reports/floorplan.timing { report_timing }
icc_shell> save_mw_cel -as 2_3_floorplan_complete
Information: Performing CEL netlist consistency check. (MWDC-118)
Information: CEL consistency check PASSED. (MWDC-119)
Information: Saved design named 2_3_floorplan_complete. (UIG-5)
1
icc_shell> remove_placement -object_type standard_cell
1
icc_shell> write_def -version 5.6 -placed -all_vias -blockages -routed_nets -specialnets -rows_tracks_gcells -output ../outputs/idct_chip.def
Output DEF file
Information: Writing ROWS statement (DDEFW-014)
Information: Completed ROWS statement  (DDEFW-016)
Information: Writing TRACKS statement (DDEFW-014)
Information: Completed TRACKS statement  (DDEFW-016)
Information: Writing GCELLGRID statement (DDEFW-014)
Information: Completed GCELLGRID statement  (DDEFW-016)
Information: Writing VIAS section (DDEFW-014)
Information: Completed VIAS section  (DDEFW-016)
Information: Writing COMPONENTS section (DDEFW-014)
Information: Completed COMPONENTS section  (DDEFW-016)
Information: Writing SPECIALNETS section (DDEFW-014)
Information: Completed SPECIALNETS section  (DDEFW-016)
Information: Writing NETS section (DDEFW-014)
Information: Completed NETS 1000/28184 (DDEFW-015)
Information: Completed NETS 2000/28184 (DDEFW-015)
Information: Completed NETS 3000/28184 (DDEFW-015)
Information: Completed NETS 4000/28184 (DDEFW-015)
Information: Completed NETS 5000/28184 (DDEFW-015)
Information: Completed NETS 6000/28184 (DDEFW-015)
Information: Completed NETS 7000/28184 (DDEFW-015)
Information: Completed NETS 8000/28184 (DDEFW-015)
Information: Completed NETS 9000/28184 (DDEFW-015)
Information: Completed NETS 10000/28184 (DDEFW-015)
Information: Completed NETS 11000/28184 (DDEFW-015)
Information: Completed NETS 12000/28184 (DDEFW-015)
Information: Completed NETS 13000/28184 (DDEFW-015)
Information: Completed NETS 14000/28184 (DDEFW-015)
Information: Completed NETS 15000/28184 (DDEFW-015)
Information: Completed NETS 16000/28184 (DDEFW-015)
Information: Completed NETS 17000/28184 (DDEFW-015)
Information: Completed NETS 18000/28184 (DDEFW-015)
Information: Completed NETS 19000/28184 (DDEFW-015)
Information: Completed NETS 20000/28184 (DDEFW-015)
Information: Completed NETS 21000/28184 (DDEFW-015)
Information: Completed NETS 22000/28184 (DDEFW-015)
Information: Completed NETS 23000/28184 (DDEFW-015)
Information: Completed NETS 24000/28184 (DDEFW-015)
Information: Completed NETS 25000/28184 (DDEFW-015)
Information: Completed NETS 26000/28184 (DDEFW-015)
Information: Completed NETS 27000/28184 (DDEFW-015)
Information: Completed NETS 28000/28184 (DDEFW-015)
Information: Completed NETS section  (DDEFW-016)
DEF output completed
1
icc_shell> exit
icc_shell> save_mw_cel  -design "idct_chip.CEL;1"
Information: Performing CEL netlist consistency check. (MWDC-118)
Information: CEL consistency check PASSED. (MWDC-119)
Information: Saved design named idct_chip. (UIG-5)
icc_shell> 

Memory usage for main task 603 Mbytes.
Memory usage for this session 603 Mbytes.
CPU usage for this session 234 seconds ( 0.07 hours ).

Thank you...

